"      Massive crude oil inventory draw supports case for higher Brent | Forexlive        ADVERTISEMENT - CONTINUE READING BELOW     Home    >  Massive crude oil inventory draw supports case for higher Brent     News      Oil   Massive crude oil inventory draw supports case for higher Brent   To USD90 and beyond!      Eamonn Sheridan    Tuesday, 02/07/2024 | 20:52 GMT-0     02/07/2024 | 20:52 GMT-0      0       The private survey of oil stocks is out, and its a monster draw:Oil: Private survey of inventory shows a much larger headline crude oil draw than expectedThe official government data is due tomorrow morning out of the US.Oil has been well supported: Analysts at Standard Chartered have a US$90 target, and beyond, in sight: From a fundamental viewpoint, we still think the rally can be sustained well past USD 90/bbl given our projected Q3 and Q4 global oil balances   ADVERTISEMENT - CONTINUE READING BELOW   Tags  Oil  ADVERTISEMENT - CONTINUE READING BELOW   Most Popular   Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)   Weekly Market Outlook (15-19 July)   Statement from Former Pres. Trump after assassination attempt   US June PPI +2.6% vs +2.3% expected   China plenum meeting against the background of calls for more economic stimulus   Former Pres. Trump rushed off stage after apparent shots fired   Dollar gives up light gains from earlier in the day   ADVERTISEMENT - CONTINUE READING BELOW    ADVERTISEMENT - CONTINUE READING BELOW             Contact us     Newsletter          GMT  00:00:00 LON  00:00:00 NY  00:00:00 TKYO  00:00:00 SYD  00:00:00        Get the Forexlive newsletter     Your email         First name         Last name       Select additional content:    Education    Trading offers from relevant providers        By submitting I agree to Forexlive's Terms, Cookies and Privacy Notice.     Submit      Stock Daily Updates AAPL stockAMD stockAMZN stockAXON stock   Top Forex Brokers    Must Read  Kickstart the FX trading day for July 12 w/a technical look at the EURUSD, USDJPY & GBPUSD 🔥📊🚀Unbelievable REAL trading success: A trader turned $200 to $190,000! 🔥📊🚀 How to use fundamentals to trade forex I am shorting oil here near 84-85 USD, see the plan It's not you.. The temperature definitely feels hotter Gold Technical Analysis - The NFP report increased the bullish sentiment Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)        !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}    "