[
  {
    "Title": "China’s oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia — report - The North Africa Post",
    "Link": "https://news.google.com/rss/articles/CBMigwFodHRwczovL25vcnRoYWZyaWNhcG9zdC5jb20vNzg3NzktY2hpbmFzLW9pbC1pbXBvcnRzLWZyb20tYWZyaWNhLXBsdW5nZS1hbWlkLXNoaWZ0LXRvLXN1cHBsaWVycy1pbi1ndWxmLWFzaWEtYW5kLXJ1c3NpYS1yZXBvcnQuaHRtbNIBAA?oc=5",
    "Published": "Tue, 16 Jul 2024 09:42:36 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report - The North Africa Post The North Africa Post HomeHeadlines Algeria Egypt Libya Mauritania Morocco Tunisia Business Emerging Markets Finance EnergyInternational Africa Americas Asia Europe Opinions Columns Editorials Letters to the Editor Op Eds Profile Interview Portrait Lifestyle Culture Eating out Technology Community Blogs Comments Videos HomeHeadlinesInternational China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report North Africa PostJuly 16, 2024 10:42 am Africa once accounted for more than a third of Chinese oil imports, but now major African oil suppliers are struggling with declining production and exports to China that has found other markets due to geopolitical considerations, infrastructure issues, and domestic political problems, according to a recent report by the Carnegie Endowment for International Peace. China used to import more than a third of its oil supplies from Africa but by 2022, that figure had dropped to about one-tenth, according to the Observatory of Economic Complexity (OEC), an online data platform. According to Carnegie's report entitled 'How Is China's Economic Transition Affecting its Relations with Africa?', between 2019 and 2023, there were dramatic increases in China's imports of oil from Malaysia (408%), the UAE (254%), Kazakhstan (214%) and Kuwait (41%). By contrast, during the same period, all eight major African oil producers, except Chad, earned much less than they did before the pandemic, according to the report. Angola has fallen down the list from being China's No. 2 source of crude oil a decade ago to the eighth place in the ranking today. The sharp declines in China's oil imports from Angola, but also South Sudan (77%), Sudan (67%) and Nigeria (61%), for example, have been due to a number of factors, observers say, including geopolitical considerations, lack of investment in equipment and new oil fields and domestic political problems. As China's oil imports from Africa decline, it is increasingly turning to the more predictable production infrastructure of the Gulf countries and Russia and other Asian countries, according to the report from the Washington-based think tank. CATEGORIES AfricaAsiaBusinessEnergyHeadlinesInternational Share This AUTHORNorth Africa Post North Africa Post's news desk is composed of journalists and editors, who are constantly working to provide new and accurate stories to NAP readers. NEWER POSTMorocco's farming sector to the test of drought OLDER POSTMorocco donates 9 high-voltage generators to Niger, confirming its African solidarity Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies 3rd Party Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. 3rd Party Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Please enable Strictly Necessary Cookies first so that we can save your preferences! Enable All Save Settings We'd like to show you notifications for the latest news and updates. AllowCancel",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil Price Update – Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulse",
    "Link": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm1hcmtldHB1bHNlLmNvbS9mdW5kYW1lbnRhbC9vaWwtcHJpY2UtdXBkYXRlLW9pbC1wcmljZXMtaG9sZC1maXJtLWFzLWNoaW5lc2UtZGVtYW5kLWNvbmNlcm5zLXJpc2UvenZhd2Rh0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 10:50:26 GMT",
    "Categories": [
      "Market Trends",
      "Supply and Demand"
    ],
    "Content": "Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulseMarketPulse Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulse Home/Commodities/Fundamental/News events/Oil/Technical analysis/TradingView/USD Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise July 15, 2024 Share Print 0 Oil prices remain stable despite a turbulent weekend and a strong US dollar. Chinese economic data, including disappointing GDP growth and declining refinery output, raises concerns about oil demand. The focus shifts from supply concerns in the US to demand worries in China. Technical analysis suggests potential for a triple bottom pattern in oil prices, with key support and resistance levels identified. Most Read: The Week Ahead - ECB Spotlight as Fed Rate Speculations Drive Market Shifts Oil prices remained resilient this morning following a turbulent weekend. An attack on US Presidential hopeful Donald Trump has seen the US Dollar start the week on the front foot but Oil prices have held firm. Data out of China this morning stoked fears around demand once more, something which market participants had hoped was in the rearview mirror. The overall fundamental picture remains largely positive but demand concerns may hamper any further gains in the short-term. Chinese Data China's GDP data released this morning was disappointing as sluggish domestic demand bites. The data prompted several investment banks to lower their GDP forecasts. GDP growth slowed to 0.7% quarter-on-quarter (q/q) seasonally adjusted (SA) in Q2, down from 1.6% q/q in Q1 and below market expectations of 0.9%, impacted by slower retail sales growth. Domestic demand and consumer confidence remain weak, with the NBS also attributing the slowdown to extreme weather events and flooding. Although industrial output growth is cooling, it exceeded market expectations, highlighting the uneven nature of China's recovery. Strong exports are supporting manufacturing activity, with shipments rising 8.6% year-on-year (y/y) in June, up from 7.6% in May. The secondary industry, which includes manufacturing and construction, grew by 5.6% y/y in Q2, down from 6.0% in Q1, while the tertiary industry, or services, increased by 4.2%, down from 5.0%. Chinese GDP Q2 YoY Source: LSEG (click to enlarge) Chinese refinery output declined for the third consecutive month due to planned maintenance and weak fuel demand, leading independent plants to reduce production. Output for the first half of the year was down 0.4% compared to the same period last year, indicating a sluggish economic recovery and reduced processing profits for refineries. Crude oil imports for the month of June dropped 11% while H1 imports were down 2.3% YoY. According to the IEA the Chinese share of global oil demand growth is declining to 40% this year from last year's 70%. This decline in China has reignited worries about demand, a notable shift from the past two weeks where supply concerns were prevalent in the US. The Week Ahead Oil inventory data is very important as the US and Europe are currently in the middle of summer. This period is typically the peak driving season in the US, leading to high demand for petroleum and other oil-related products. Due to the busy summer season in the US, there is a good chance that weekly oil inventories will decrease more than expected. This could help keep oil prices strong and prevent any significant long-term price drops. Geopolitics also remains a concern and could once more play an important role in the absence of high impact US economic data. For all market-moving economic releases and events (GMT-Time), see the MarketPulse Economic Calendar. (click to enlarge) Technical Analysis Oil prices snapped a four week winning streak to close around 2.33% lower. The weekly timeframe has price testing the 100-day MA which could prove to be a stern area of resistance. The daily timeframe is even more interesting as it appears markets could be setting up a triple bottom pattern. Such a pattern would no doubt embolden bulls eyeing further appreciation in oil prices. A daily candle close below the 85.25 handle opens up a potential selloff in Brent crude with support levels at 83.50 and 82.50 coming into focus. Immediate resistance rests at 86.21 with a break above carrying oil toward 87.90 and potentially the 90.00 psychological level. Support 85.25 83.50 (200-day MA) 83.00 81.58 Resistance 86.21 87.90 90.00 (psychological level) Brent Crude Oil Daily Chart, July 15, 2024 Source: TradingView.com (click to enlarge) Follow Zain on Twitter/X for Additional Market News and Insights @zvawda Content is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. (c) 2023 OANDA Business Information & Services Inc. BioLatest Posts Zain Vawda Market Analyst at OANDA Zain is an experienced financial markets analyst and educator with a rich tapestry of experience in the world of retail forex, economics, and market analysis. Initially starting out in a sales and business development role, his passion for economics and technical analysis propelled him towards a career as an analyst. He has spent the last 3 years in an analyst role honing his skills across various financial domains, including technical analysis, economic data interpretation, price action strategies, and analyzing the geopolitical impacts on global markets. Currently, Zain is advancing in obtaining his Capital Markets & Security Analyst (CMSA) designation through the Corporate Finance Institute (CFI), where he has completed modules in fixed income fundamentals, portfolio management fundamentals, equity market fundamentals, introduction to capital markets, and derivative fundamentals. He is also a regular guest on radio and television programs in South Africa, providing insight into global markets and the economy. Additionally, he has contributed to the development of a financial markets course approved by BankSeta (Banking Sector Education and Training Authority) at NQF level 6 in South Africa. Latest posts by Zain Vawda (see all) USD/CAD Eyes Breakout as Oil Price Slide Continues, BoC Meeting Next - 22 July 2024 Safe Havens Gain Favor Amid Geopolitical Tensions and US Election Uncertainty, Gold Above $2400/oz, DXY Slips - 22 July 2024 Weekly Market Outlook: US PCE, GDP, and Earnings Expected to Drive Volatility - 19 July 2024 Baker Hughes Oil Rig Count, Brent Crude oil prices, Brent Crude Oil Technical Analysis, Brent Oil, China's economic data, Chinese demand, Crude oil imports, EIA crude oil inventory, GDP Growth, Geopolitics, Refinery output, WTI Technical Analysis Back to Top",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil prices surge amid political uncertainty, geopolitical tensions - MENAFN.COM",
    "Link": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vbWVuYWZuLmNvbS8xMTA4NDQzNTYwL09pbC1wcmljZXMtc3VyZ2UtYW1pZC1wb2xpdGljYWwtdW5jZXJ0YWludHktZ2VvcG9saXRpY2FsLXRlbnNpb25z0gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 08:45:28 GMT",
    "Categories": [],
    "Content": "Oil prices surge amid political uncertainty, geopolitical tensions We use cookies We use cookies and other tracking technologies to improve your browsing experience on our website, to show you personalized content and targeted ads, to analyze our website traffic, and to understand where our visitors are coming from. I agreeI declineChange my preferences US Europe Arab Asia Africa | Politics Economy Oil&Energy Entertainment Sport Oil prices surge amid political uncertainty, geopolitical tensions Date 7/16/2024 4:45:28 AM Share on Facebook Tweet on Twitter (MENAFN) Oil prices saw a modest increase on Monday as geopolitical uncertainty in the United States and the Middle East outweighed pressures from a stronger dollar and subdued demand in China. brent crude futures edged up by 15 cents, or 0.2 percent, to reach USD85.18 per barrel by 0425 GMT, following a slight decline of 37 cents on Friday. Similarly, U.S. West Texas Intermediate crude rose by 20 cents to USD82.41 per barrel, marking a 0.2 percent gain.The attempted assassination of U.S. presidential candidate Donald Trump earlier in the week contributed to market uncertainty, according to Tony Sycamore, a market analyst at IG. This event has cast a shadow over the political landscape of a deeply divided country as it approaches the election period, potentially influencing market sentiment.Geopolitical risks in the Middle East also played a role in supporting oil prices, highlighting ongoing concerns about regional stability. Furthermore, the market remains bolstered by the continuing supply cuts by OPEC+ members. Iraq's oil ministry has pledged to counter any excess oil production starting from 2024, indicating a commitment to manage global supply levels amidst market fluctuations.Despite these factors, oil prices had faced downward pressure last week. Brent crude had declined by more than 1.7 percent after four consecutive weeks of gains, while U.S. West Texas Intermediate futures dropped by 1.1 percent. This decline was attributed to weak demand for oil in China, the largest importer of crude globally, where crude oil imports fell by 2.3 percent in the first half of the year to 11.05 million barrels per day. Factors contributing to this decline included disappointing fuel demand and reduced output by independent refiners amid narrow profit margins.China's economic slowdown in the second quarter, exacerbated by challenges such as a prolonged property downturn and job market instability, has raised expectations for additional stimulus measures from Beijing to bolster domestic demand. These developments are closely monitored by market participants for potential implications on global oil consumption and economic recovery trends. MENAFN16072024000045015682ID1108443560 Legal Disclaimer: MENAFN provides the information \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the provider above. Tags Label Comments No comment Category Date 7/16/2024 Most popular stories New Nature Writing Genre Brings Wild And Tricky Aspects Of Climate Cri... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Jensen Huang And Mark Zuckerberg To Explore The Future Of AI And Virtu... 'We Failed': US Secret Service Admits 'Most Significant Mistake' Leadi... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... Market Research Infrastructure-As-A-Service (Iaas) Market Trends, Size, Share, Analysis, ... Unlocking Insights: Lithium Carbonate Analysis Report... Saudi Arabia Hybrid Cloud Market To Witness 21.91% CAGR Until 2032... Saudi Arabia Lingerie Market Share, Size, Growth, Trends, Analysis And Re... United States Hybrid Cloud Market Size To Expand At A CAGR Of 21.95% Duri... Australia Glamping Market Industry Size, Share, Growth, Leading Companies... United States Home Infusion Therapy Market Trends, Scope, Demand, Opportu... More Stories 'Sexist' falsehoods target Kamala Harris after Biden drops out... UN Chief Urges Reform Of Int'l Financial System... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... Kremlin Awaits 'Concrete Action' Following Zelensky's Proposal On Negotia... UNHCR To Reduce Workforce In Lebanon Amid Budget Constraints... 4.7-Magnitude Quake Jolts Turkey... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Ananya Panday Buys Herself A Powerful New Luxury SUV... Rebounding chip shares lead US stocks higher... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... The coconut tree presidency? Harris memes break the internet... Times When Nikki Tamboli Showed Off Her SEXY Body That Took The Internet ... Newsletter Daily(English) Daily(Arabic) All() Search ******************** Home News News by Industry News by Region Americas Europe Arab World Asia Africa Press Releases Submit Your press Authors Register Submit your Articles RSS MarketData Equities Market Global Indices MENA Indices Qutoes & Charts End of Day stocks Currencies Currency Convertor Cross Rates Historical Currencies Libor Mena Stocks Stocks Search Commodoties Oil & Energy Economic Calendar Stocks Search Research Premium Research Free Research Countries Saudi Arabia UAE Bahrain Qatar Kuwait Jordan Oman Egypt Lebanon Iraq Palestine Syria Tunisia Algeria Morocco Yemen Sections Events Financial Glossary 🍪 We use cookies! Hi, this website uses essential cookies to ensure its proper operation and tracking cookies to understand how you interact with it. The latter will be set only after consent. Let me choose Accept allReject all Cookie usage 📢 I use cookies to ensure the basic functionalities of the website and to enhance your online experience. You can choose for each category to opt-in/out whenever you want. For more details relative to cookies and other sensitive data, please read the full privacy policy. Strictly necessary cookiesStrictly necessary cookies These cookies are essential for the proper functioning of my website. Without these cookies, the website would not work properly Performance and Analytics cookiesPerformance and Analytics cookies These cookies allow the website to remember the choices you have made in the past NameDomainExpirationDescription^_gagoogle.com2 yearsdescription ..._gidgoogle.com1 daydescription ... Advertisement and Targeting cookiesAdvertisement and Targeting cookies These cookies collect information about how you use the website, which pages you visited and which links you clicked on. All of the data is anonymized and cannot be used to identify you More information For any queries in relation to my policy on cookies and your choices, please contact us. Accept allReject allSave settings",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude oil falls after weak Chinese growth - London Loves Business",
    "Link": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vbG9uZG9ubG92ZXNidXNpbmVzcy5jb20vY3J1ZGUtb2lsLWZhbGxzLWFmdGVyLXdlYWstY2hpbmVzZS1ncm93dGgv0gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 09:26:27 GMT",
    "Categories": [],
    "Content": "Crude oil falls after weak Chinese growth - London Business News | Londonlovesbusiness.com Tech Property Business London Loves Home Business News Crude oil falls after weak Chinese growth IMAGO/Westlight / Avalon Business NewsEconomic NewsFinance NewsInvestment News Crude oil falls after weak Chinese growth by Antonio Ernesto Di Giacomo Market Analyst Latam at XS.com July 16, 2024 written by Antonio Ernesto Di Giacomo Market Analyst Latam at XS.com 16 th Jul 24 10:26 am Crude oil prices fell slightly on Monday as weak Chinese data raised doubts about the growth of this significant economy. The slowdown in the world's second-largest economy has caused investors' concern, impacting global crude oil prices. West Texas Intermediate (WTI) fell from the market opening, dropping from $81.20 to $80.45 per barrel. Meanwhile, Brent crude also declined, trading at $83.80 per barrel. These drops reflect market concerns over China's economic weakness, a country that plays a crucial role in global oil demand. The world's second-largest economy recorded its weakest year-on-year growth in the second quarter. Forecasts indicated a 5.1% growth, but actual growth was 4.7%. This figure surprised analysts and generated uncertainty about China's ability to maintain its growth pace shortly. Additionally, China's crude oil imports fell by 2.3% in the first half of this year, standing at 11.05 million barrels per day. This decrease in imports is due to disappointing fuel demand, suggesting that economic activity in the country is not as robust as expected. These data indicate that China faces increasing economic headwinds, likely a bad sign for crude oil demand in this vital market. The decline in Chinese demand could have a significant impact on global oil prices, given China's weight in global energy consumption. Losses have been limited as political uncertainty in the United States and the Middle East has supported prices. Despite weak Chinese demand, other geopolitical factors have maintained stability in crude oil prices, preventing more pronounced declines. In conclusion, the weakening of Chinese economic growth has immediately impacted crude oil prices, reflecting concerns about future oil demand. Although geopolitical factors have limited declines, China's economic situation will remain a key factor to monitor in the coming months to understand the evolution of crude oil prices in the global market. More Like This: The influence of Hurricane Beryl and economic...Oil demand outlook drives Brent and WTI prices higherDrop in WTI and Brent amid geopolitical concernsRedundancies fuel further expansions in candidate... Leave a Comment Please enable JavaScript to view the comments powered by Disqus. EconomyfinanceInvestmentOil & Gas Share 0 FacebookTwitterLinkedinWhatsappTelegramEmail You may also like Markets could be set for billions in loses amid the... Major UK airline companies suffer staggering £3.37 billion loss following... Crude oil prices declines as Biden pulls out of presidential... Bitcoin's rally faces resistance amid long liquidations and Mt. Gox... More than 1,000 jobs could be lost as Tapi to... Gold gains on Biden's presidential race withdrawal and weaker dollar CLOSE AD Skip Ads by",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Global Oil Prices Inched Down amid China's Slowing Economy - Tempo.co English",
    "Link": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZW4udGVtcG8uY28vcmVhZC8xODkxOTQ5L2dsb2JhbC1vaWwtcHJpY2VzLWluY2hlZC1kb3duLWFtaWQtY2hpbmFzLXNsb3dpbmctZWNvbm9tedIBAA?oc=5",
    "Published": "Tue, 16 Jul 2024 03:59:15 GMT",
    "Categories": [],
    "Content": "Global Oil Prices Inched Down amid China's Slowing Economy - News En.tempo.co Email Kata Sandi Lupa Kata Sandi? Klik di Sini Masuk atau Masuk melalui Google Belum Memiliki Akun Daftar di Sini Nama Lengkap Email Kata Sandi Ulangi Kata Sandi Daftar atau Daftar melalui Google Sudah Memiliki Akun Masuk di Sini Konfirmasi Email Kami telah mengirimkan link aktivasi melalui email ke rudihamdani@gmail.com . Klik link aktivasi dan dapatkan akses membaca 2 artikel gratis non Laput di koran dan Majalah Tempo Jika Anda tidak menerima email, Kirimkan Lagi Sekarang Home Economy & Business Global Oil Prices Inched Down amid China's Slowing Economy Translator Ririe Ranggasari Editor Petir Garda Bhwana 16 July 2024 10:59 WIB Oil drilling off the coast of Qatar. [www.gdi.com.qa] TEMPO.CO , Jakarta - World oil prices fell on Tuesday, July 16. Reuters reported that Brent crude fell 9 cents, or 0.1 percent, to US$84.76 per barrel, while West Texas Intermediate (WTI) crude fell 13 cents, or 0.2 percent, to US$81.78 per barrel. Reuters wrote that the drop in global oil prices was due to concerns over declining demand from China amid the country's economic slowdown. In the second quarter of 2024, China's economy grew at a much slower rate than forecast, triggered by a prolonged property downturn and job insecurity. In April-June 2024, China's economy was recorded to have grown 4.7 percent, the slowest since Q1/2023 and below the 5.1 percent estimated in a Reuters poll. China's oil refinery output also fell 3.7 percent in June. The three-month drop in output was due to planned maintenance. Meanwhile, lower refining margins and sluggish fuel demand are prompting independent mills to cut production.Meanwhile, Fed chair Jerome Powell said that U.S. inflation readings in the second quarter of this year slightly increased confidence that the rate of price increases was returning to the central bank's target on a sustainable basis. His statement was interpreted by market players as an indication of a shift to lower interest rates, possibly soon. Lower interest rates are expected to lower borrowing costs, allowing economic activity and oil demand to increase. RIRI RAHAYU Editor's Choice: The World's Richest Women in 2024; Forbes List Unveiled Click here to get the latest news updates from Tempo on Google News oil priceChinaEconomy Recommended Indonesia to Call on International Communities to Follow Up on ICJ Advisory Opinion 6 hours ago Reasons Why Indonesian Foreign Minister Yet to Visit Palestine 6 hours ago Sri Mulyani Says Simbara Boosts Coal, Mineral Non-Tax Revenue 6 hours ago Indonesia Finalizing Family Office, Aims for Pre-October Launch 8 hours ago Palace Announces Resolution of Social Conflict on Maluku's Haruku Island 8 hours ago Family Office Plan; Luhut to Imitate UAE's Arbitration Courts 13 hours ago Today's Top 3 News: Indonesian Police Seize 394 Packages of Marijuana Belongs to Papua-Papua New Guinea Kingpin 14 hours ago Cosmetic Preservatives Found in Aoka, Okko Bread; Here's the Chronology 14 hours ago Jokowi Plans Cabinet Meeting in Nusantara for Late July 15 hours ago Jokowi Kicks Off Papua Visit, Slated to Attend National Children's Day Commemoration Tomorrow 17 hours ago China's Xi Jinping Urges All-out Rescue Efforts After Highway Bridge Collapse Kills 11 1 hari lalu China's Xi Jinping Urges All-out Rescue Efforts After Highway Bridge Collapse Kills 11 President Xi Jinping urged all-out rescue efforts after a highway bridge collapse on Friday in Shaanxi province in China's northwest killed 11 people. Read More Today's Top 3 News: Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall 3 hari lalu Today's Top 3 News: Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall Here is the list of the top 3 news on Tempo English today. Read More 6 Must-Try Traditional Chinese Foods for Tourists 3 hari lalu 6 Must-Try Traditional Chinese Foods for Tourists Exploring Chinese foods is an essential part of any visit to the country. Read More Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall 3 hari lalu Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall President-elect Prabowo Subianto expressed optimism about achieving 8% economic growth. Read More Indonesia Needs to Push for EV Localization to Lead ASEAN Market, Boost Economy, Analysts Said 4 hari lalu Indonesia Needs to Push for EV Localization to Lead ASEAN Market, Boost Economy, Analysts Said Indonesia should localize its EV component production to become a leader in the electric vehicle (EV) industry within ASEAN, analsysts said. Read More Philippines, China to Set Up New Channels to Handle South China Sea Rows 5 hari lalu Philippines, China to Set Up New Channels to Handle South China Sea Rows The Philippines and China have agreed to set up new lines of communication to improve their handling of maritime disputes. Read More Top 10 Best-Selling Electric Cars in June 2024; Chery Omoda E5 Tops the List 5 hari lalu Top 10 Best-Selling Electric Cars in June 2024; Chery Omoda E5 Tops the List The electric car market in Indonesia continues to heat up, with manufacturers vying for dominance each month. Read More Imported Clothes Allegedly Sold Illegally in Tanah Abang 5 hari lalu Imported Clothes Allegedly Sold Illegally in Tanah Abang The Tanah Abang Wholesale Market is known to be a hub for buying and selling imported clothes, including from China. Read More IMF Sees Steady Global Growth, Warns of Slowing Disinflation Momentum 6 hari lalu IMF Sees Steady Global Growth, Warns of Slowing Disinflation Momentum The IMF warns in an update to its World Economic Outlook(WEO) that momentum in the fight against inflation is slowing. Read More BPS: Chinese Imports Dominate Indonesian Market, Led by Machinery and Electronics 6 hari lalu BPS: Chinese Imports Dominate Indonesian Market, Led by Machinery and Electronics Statistics Indonesia (BPS) revealed that imported products from China dominated Indonesia's non-oil and gas import landscape in June 2024. Read More [x] close",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "EIA reports surge in Iraqi oil exports to the US - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L0VJQS1yZXBvcnRzLXN1cmdlLWluLUlyYXFpLW9pbC1leHBvcnRzLXRvLXRoZS1VU9IBUmh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9FSUEtcmVwb3J0cy1zdXJnZS1pbi1JcmFxaS1vaWwtZXhwb3J0cy10by10aGUtVVM?oc=5",
    "Published": "Sun, 14 Jul 2024 07:13:33 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "EIA reports surge in Iraqi oil exports to the US - Shafaq News Breaking News Iraqi Parliament includes the General Amnesty Bill on the agenda for next Wednesday's session Iraq's Federal Intelligence Investigation Agency arrests seven in Nineveh UN Iraq and Ministry of Water Resources launch \"Water is Life\" Campaign Iraq and Iran discuss enhanced security cooperation and border management 2024-07-14 10:59 Share font Enable Reading Mode A- A A+ Shafaq News/ Iraqi oil exports to the United States saw an increase last week, according to the US Energy Information Administration (EIA) on Sunday. The EIA reported that the average US crude oil imports from nine key countries reached 5.635 million barrels per day (bpd) last week, up by 235,000 bpd from the previous week's average of 5.400 million bpd. The report said that Iraq's oil exports to the US averaged 217,000 bpd last week, marking an increase of 22,000 bpd from the previous week's average of 195,000 bpd. Canada led the oil imports to the US last week, averaging 3.889 million bpd, followed by Mexico with 417,000 bpd. Saudi Arabia came next with 239,000 bpd, Colombia with 226,000 bpd, and Brazil with 217,000 bpd. According to the EIA data, the US imported 170,000 bpd from Nigeria, 162,000 bpd from Ecuador, and 44,000 bpd from Libya. Related News Snapshot of recent data: Iraqi oil exports to the United States halved last week Iraq's oil exports to the US in March decline amid global market shifts Iraqi oil exports to the US declined last week: EIA Iraq exported more than 6 million barrels of oil to the United States in January Iraq exported 5.5 million barrels of oil to the US during March OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance PausePlay % buffered00:00 00:00 UnmuteMute Disable captionsEnable captions Settings CaptionsDisabledQualityundefinedSpeedNormal CaptionsGo back to previous menu QualityGo back to previous menu SpeedGo back to previous menu 0.5x0.75xNormal1.25x1.5x1.75x2x4x PIPExit fullscreenEnter fullscreen Play Shafaq Live Shafaq Live English English Radio facebook",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyNC8wNy8xNC9kYW5nb3RlLXJlZmluZXJ5LXRvLXNvdXJjZS1jcnVkZS1vaWwtZnJvbS1vdGhlci1hZnJpY2FuLWNvdW50cmllcy1hZnRlci1pbXBvcnRzLWZyb20tdXMtYnJhemlsLTIv0gGLAWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDI0LzA3LzE0L2RhbmdvdGUtcmVmaW5lcnktdG8tc291cmNlLWNydWRlLW9pbC1mcm9tLW90aGVyLWFmcmljYW4tY291bnRyaWVzLWFmdGVyLWltcG9ydHMtZnJvbS11cy1icmF6aWwtMi8_YW1wPTE?oc=5",
    "Published": "Sun, 14 Jul 2024 11:03:03 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics Login Register HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: No Result View All Result Home Sectors Energy Dangote Refinery to source crude oil from other African countries after imports from US, Brazil by Cyrus Ademola 1 week ago in Energy, Sectors Aliko Dangote Share on FacebookShare on TwitterShare on Linkedin The Chairman of Dangote Refinery, Aliko Dangote, said that his company will source crude oil from other African oil-producing nations following recent imports from the United States and Brazil.Dangote made this disclosure in a statement to newsmen during a tour in his Lagos-based refinery on Saturday.According to the business mogul, the refinery is expecting feedstock acquired from the US and Brazil in the coming months. Related Stories Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 He mentioned that conversations are ongoing to secure more crude from African countries like Angola, Senegal, and Libya, all of which are oil-producing nations. \"We will start importing crude oil from African countries. When we get to those countries, we'll start negotiating with them. We'll start bringing in from there. \"We have just bought from US and Brazil. So I think by next month, we'll expand the scope to most of African countries. \"If we availability in Nigeria, we won't have to turn to these other countries,\" Dangote said.When asked about the timeline for sourcing crude from these African countries, Dangote stated that it could begin as soon as next month. News continues after this ad \"Very soon. I think by next month. You know crude, you have to book two months in advance. So, I'll say October we'll be bringing in from these African countries,\" Dangote responded. Feedstock from US, Brazil According to recent reports, Dangote refinery secured 6 million barrel crude oil from US, which is expected to reach the $19 billion facility by August.In addition, the mega refinery will also receive about 5 million barrel of crude oil from US by September, data from Bloomberg show.Accordingly, Dangote is also sourcing crude from the South American country, Brazil, in the coming months to ramp up production as it sets to commence the supply of petrol to the market this month.The leadership of Dangote has vehemently lamented the unavailability of crude in Nigeria, forcing the oil facility to seek alternatives from other countries. IOCs unable to supply local refineries Despite being a leading oil producer, Nigeria still struggles to meet its OPEC quota as well as supply local refineries in the country.Some local refineries, including Dangote, have accused International Oil Companies (IOCs) of refusal to meet their demands, alleging that these IOCs prefer to sell the crude abroad.In response, the regulatory body of oil in Nigeria, NUPRC, has insisted that the IOCs meet local demands first, before exporting to other African countries. PMS Supply expected in July Moreover, Dangote has said his refinery will supply petrol to local marketers this month.Dangote mentioned that the change in date was due to a slight delay, prompting the shift from the originally proposed June to mid-July.The CEO said the refinery will commence production of petrol between 10 and 15 of July, while supply to local marketers will commence from the third week of the same month. \"We had a bit of delay, but PMS will start coming out by 10 to 15 of July. But then we want to keep it in tank to make sure that it settles. So by third week of July, we'll be able coming out to take it into the market,\" Dangote said.The refinery is expected to significantly reduce Nigeria's dependence on imported petroleum products. Follow us for Breaking News and Market Intelligence. Tags: Aliko DangoteBrazilCrude Oil ImportDangote RefineryOPECUS Cyrus Ademola Cyrus Ademola is a political and economy analyst with over half a decade experience in journalism, research-based oped, economic reportage and political analysis. His works have been featured on different media outlets, covering from politics to business trends, to crime and security as well as the real estate sector. Related Posts Energy Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Op-Eds Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Economy Dangote Refinery: 'Non-availability of crude oil' to domestic refineries affecting fuel quality in Nigeria - Lawmakers July 22, 2024 Energy Dangote refinery to import crude oil from Libya July 22, 2024 Energy \"Let them (NNPCL) buy me out and run the refinery\" says Aliko Dangote amid monopoly allegations July 21, 2024 Digital Media Energy Expert Kelvin Emmanuel on Dangote Refinery Challenges and NNPC's Strategic Stake. July 21, 2024 Next Post How digital financial services are transforming property transactions in Nigeria Comments 2 Michael says: July 14, 2024 at 3:50 pm It is a shame on this country and government not to provide crude oil for Dangote Refinery. It is not patriotic on the side of the people in government to allow this to happen. Our local refineries ought to get crude first before exporting the excess to other countries. By this action government and NNPC and all regulators concern have proved to us that making money for themselves is more important than Nigeria economy and her citizen s welfare. There should be immediate ban on crude oil exchange or swap for refined products outside Nigeria. If there should be any, it should be given to Dangote Refinery or any of the local Refineries not foreign Refineries. Reply Abba says: July 14, 2024 at 6:49 pm So this is how we are going to continue to be clolonised indirectly.. Shame on our leaders. They prefer to please their western evil freinds in exchange for their immunity. Rather than putting their country first. Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment *Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Ad Next Stay Riding Motorbike Alone Across Laos - Beautiful Memories from LAOS - Nếm TV 40 42 00:00 00:00 / 00:00 10 Sec Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar Consultant returns N1.5 billion from NIRSAL contract to EFCC Follow us on social media: Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Download Nairametrics iOS AppDownload Nairametrics Android AppHomeMarketsSectorsEconomyBusiness NewsFinancial LiteracyDisclaimerAds Disclaimer (c) 2024 Nairametrics Welcome Back! Login to your account below Remember Me Forgotten Password? Sign Up Create New Account! Fill the forms below to register All fields are required. Log In Retrieve your password Please enter your username or email address to reset your password. Log In No Result View All Result HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Login Sign Up (c) 2024 Nairametrics Advertisement",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil prices tumble as demand worries in China - Al Bawaba",
    "Link": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmFsYmF3YWJhLmNvbS9idXNpbmVzcy9vaWwtcHJpY2VzLXR1bWJsZS1kZW1hbmQtd29ycmllcy1jaGluYS0xNTc3MzU40gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 07:50:00 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "Oil prices tumble as demand worries in China | Al Bawaba Skip to main content Home BUSINESS Oil prices tumble as demand worries in China Oil prices tumble as demand worries in China Published July 16th, 2024 - 07:50 GMT FacebookTwitterWhatsAppShare Shutterstock Oil prices decreased on Tuesday as the weak economic data in China caused worries about a slowing economy crimping demand in the world's largest crude oil importer. International benchmark Brent crude traded at $84.23 per barrel at 09.39 a.m. local time (0639GMT), a decline of 0.73% from the closing price of $84.85 per barrel in the previous trading session.The American benchmark West Texas Intermediate (WTI) traded at $80.22 per barrel at the same time, a 0.77% fall from the previous session that closed at $80.84 per barrel.The gross domestic product (GDP) of China rose by 4.7% in the second quarter of 2024, below market expectations, according to official figures on Monday.The country's economy expanded by 5.3% in the first quarter, and the market forecast was a GDP growth rate of 5.1% in the second quarter, the National Bureau of Statistics said.This comes after data last week showed softness in oil imports, according to Daniel Hynes, a commodity strategist at the Australia and New Zealand Banking Group.\"Over the first six months of the year, the world's top importer bought less crude oil compared with last year. June crude oil imports fell on both a monthly and annual basis to 46.45 million tons,\" Hynes said in an e-mailed note.Hynes also added that a stronger US dollar emerged as investors ratcheted up their bets that former US President Trump would win back the White House, which dented investor appetite. The US dollar index rose by 0.18% to 104.065 at 09.39 a.m. local time (0639GMT), compared to the previous trading session close. The higher US dollar curbs oil demand and supports price declines.Trump was targeted in an assassination attempt during a rally in Pennsylvania on Saturday, just days before he was set to accept the Republican nomination for a third term.However, increased expectations that the US Federal Reserve's (Fed) interest rate cut will start soon limited further price declines.The Fed is receiving \"more good\" inflation data, paving the way for its first interest rate cut later this year, Chair Jerome Powell said Monday.Speaking at the Economic Club of Washington, DC, Powell reiterated his comments that the US central bank is looking for \"greater confidence\" that inflation is returning to its 2% target.Powell noted the Fed does not need to wait until inflation hits its 2% long-term target to begin lowering interest rates because of the lagging effect of monetary tightening on inflation data.Market players interpreted Powell's remarks as a return to interest rate cuts may not be far off.Lower interest rates are set to reduce the cost of consumer borrowing and stoke expectations of increased economic growth and demand for oil. Tags:ChinaOilOil Prices Via SyndiGate.info LatestPopular Oil prices tumble as demand worries in China Billie Eilish set to read CBeebies bedtime story to ... New research shows how reducing screen time improves ... American Kestrel finds temporary home in Winnipeg city hall Canada's manufacturing sales see a rise by 0.4% in May Loading content ... Sign up to our newsletter for exclusive updates and enhanced content Sign up to get Al Bawaba's exclusive celeb scoops and entertainment news (c) 2000 - 2024 Al Bawaba (www.albawaba.com) ✓ Thanks for sharing! AddToAny More...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil futures: Crude prices extend losses on economic, demand concerns - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvb2lsLWZ1dHVyZXMtY3J1ZGUtcHJpY2VzLWV4dGVuZC1sb3NzZXMtb24tZWNvbm9taWMtZGVtYW5kLWNvbmNlcm5zLTI2OTU5Lmh0bWzSAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 16:47:02 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Oil futures: Crude prices extend losses on economic, demand concerns Oil futures: Crude prices extend losses on economic, demand concerns Crude Oil Refined Products 16 Jul 2024 Quantum Commodity Intelligence - Crude oil futures Tuesday were sliding lower as concerns over broader economic growth offset increasing prospects for a September US rate cut. Front-month Sep24 ICE Brent futures were trading at $83.75/b (1900 GMT), compared to Monday's settle of $84.85/b and an intraday low of $83.30/b. At the same time Aug24 NYMEX WTI was trading at $80.77/b , versus Monday's settle of $81.91/b. Markets remained subdued in the early part of the week despite Federal Reserve Chair Jerome Powell indicating that the nation's central bank does not need to see inflation at 2% before cutting rates. \"The implication of that is that if you wait until inflation gets all the way down to 2%, you've probably waited too long, because the tightening that you're doing, or the level of tightness that you have, is still having effects which will probably drive inflation below 2%,\" Powell said in Monday's comments to the Economic Club of Washington, DC. The comments came after last Thursday's lower-than-expected inflation report lifted the prospect of a long-awaited interest rate cut this September, in turn boosting economic growth and oil consumption. China Benchmarks opened the week softer after disappointing GDP figures from China, while crude oil throughput continued to slide last month as thin margins weighed on utilisation rates across the country. The Chinese National Bureau of Statistics data showed Asia's biggest oil refiner processing 58.32 million mt of crude oil in June, equating to 14.19 million bpd. \"The weak economic data in China also weighed on sentiment in the crude oil market. This comes after data last week showed softness in oil imports. Over the first six months of the year,\" said ANZ commodity strategist Daniel Hynes, adding there are also concerns that demand in the US peaked during the 4 July holiday. Elsewhere, investors continue to monitor stop-start ceasefire talks on the Gaza conflict, while Houthi militants have launched three attempted attacks on regional shipping, including an oil tanker, as the Yemen-based group expands its range to the Mediterranean. This included Houthis publishing a video of a uncrewed surface vessel (USV) hitting the crude oil tanker Chios Lion in the Red Sea on 15 July. The North Sea physical market was also in retreat this week as flagship Forties traded in Monday's MOC window at +$0.60/b to the underlying Dated Brent swap on a FOB basis, having last traded at +1/b on Wednesday. twitter linkedin send print Related Total sees higher Q2 output, slump in refinery margins Crude Oil Refined Products 16 Jul 2024 TotalEnergies sees upstream output at the higher end of its second-quarter guidance, the company said Tuesday... Total's Port Arthur refinery shut for at least a week on steam loss Crude Oil Refined Products 16 Jul 2024 TotalEnergies has been forced to close its troubled Port Arthur refinery in Texas because of a loss of steam... Iraq reaffirms support for OPEC, vows to make up for overproduction Crude Oil 15 Jul 2024 Iraq has reaffirmed its commitment to OPEC and has vowed to make up for overproduction... CHINA DATA: June crude throughput falls to six-month low Crude Oil Refined Products 15 Jul 2024 China's crude oil throughput continued to slide last month as prolonged refinery outages and thin margins weighed on plant... Spec crude net length rises on US rate cut hopes, crude stock draw Crude Oil Refined Products 15 Jul 2024 The speculative net length of Brent and WTI futures extended gains...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "The interplay of inclusiveness, technology and sustainability in today’s turbulent trade finance landscape - Global Trade Review (GTR)",
    "Link": "https://news.google.com/rss/articles/CBMipwFodHRwczovL3d3dy5ndHJldmlldy5jb20vbWFnYXppbmUvdGhlLWRpZ2l0YWwtdHJhZGUtaXNzdWUtMjAyNC90aGUtaW50ZXJwbGF5LW9mLWluY2x1c2l2ZW5lc3MtdGVjaG5vbG9neS1hbmQtc3VzdGFpbmFiaWxpdHktaW4tdG9kYXlzLXR1cmJ1bGVudC10cmFkZS1maW5hbmNlLWxhbmRzY2FwZdIBAA?oc=5",
    "Published": "Mon, 15 Jul 2024 11:14:00 GMT",
    "Categories": [],
    "Content": "The interplay of inclusiveness, technology and sustainability in today's turbulent trade finance landscape | Global Trade Review (GTR) Share this The interplay of inclusiveness, technology and sustainability in today's turbulent trade finance landscape Sponsored Statement / 15-07-24 / by GTR Amit Agarwal, MD and group head of trade products, Global Transaction Services at DBS Bank, provides an overview of the Asia Pacific trade industry, from the challenges brought about by geopolitical tensions and economic uncertainty, to the opportunities arising from regulatory support and technological advancements. The trade industry in Asia Pacific is experiencing turbulent times as geopolitical challenges and macroeconomic uncertainty affect trade volumes and financing in the region. Ongoing geopolitical tensions between the big markets continue to stoke movement among Western companies to explore nearshoring or diversification strategies, resulting in impacts on the trade finance market. While the full effect of these shifts from a trade finance perspective is only likely to emerge over the next two to three years once capex investments have been made, procurement for many goods has started to move to Southeast Asia, Mexico and India, reducing China's direct market share to the Western world. Compounding issues is the broader slowdown in the domestic Chinese economy - headwinds in the real estate sector1 have led to overall slower, though still positive, trade growth in Asia Pacific in 2023. Against this backdrop, a key avenue for growth in many Asian economies (including India) will be the considerable spend expected on infrastructure projects by governments and through public-private partnerships. The participation of mid-cap companies and small and medium-sized enterprises (SMEs) in this space will also play a critical role in moving these projects forward. For now, Asia's cross-border trade finance market has also been hit by the high interest rate environment. High US dollar interest rates are making companies reluctant to borrow from banks, and resulting in many of them turning to internal cash flows to manage their working capital. While large corporations have the cash required to do this, SMEs continue to pay high interest rates when borrowing from banks. Hurdles to SME trade financing access SMEs account for a large share of enterprises and jobs globally, but face higher trade costs and have less access to financing. According to the Asian Development Bank,2 roughly 43% of SMEs report having unmet financing needs, resulting in the global trade finance gap expanding from US$1.7tn to US$2.5tn3 in two years. While these numbers are daunting, the reality on the ground is more nuanced. For the most part, larger SMEs (firms with a turnover of more than US$20mn) tend to be sufficiently banked, especially in major Asian markets like India and China. However, in instances where SMEs can access financing, these loans usually come in the form of secured financing - which depends on businesses pledging their fixed assets as collateral - and at very high interest rates. That can limit profitability and constrain SMEs' expansion and growth potential. Additionally, conventional trade finance is intrinsically expensive for banks to service, with high operational costs incurred in processing reams of documentation, security perfection, validating data, and so on. Banks have historically found it challenging to provide low-cost trade financing to SMEs. The industry must do more to enable an inclusive trade financing environment, given the crucial role it plays in supporting trade, and in financing sustainable development. Achieving net-zero targets, for example, hinges on more democratic access to sustainable trade financing. Investing more time and resources into supporting SMEs is key to driving the sustainability agenda for the large upstream corporates. In our view, two aspects are going to be key in broadening access to financing solutions and spurring development worldwide: regulation and technology. The driving force of regulation We are seeing heartening developments in the regulatory landscape in large markets such as India, China and Vietnam, with policymakers developing new rules that actively support more trade finance by creating laws that enable these forms of lending. For example, the creation of trade receivable registries enables banks to log their rights over these exposures and reduce losses on account of double financing issues. Other regulations take a more direct approach. In India, the launch of the Reserve Bank of India's Trade Receivables Discounting System (TReDS)4 has already led to the collateral-free trade financing of more than US$14bn of domestic trade in 2023. Changes in trade credit insurance guidelines and the launch of Gift City, an international financial centre, aim to multiply the success and expand benefits to cross-border trade as well. In China, regulators have been avid supporters of trade financing for decades. Most recently, in 2023, the State Administration of Foreign Exchange introduced nine new measures5 to facilitate cross-border trade, investment and financing to help stabilise foreign trade and investment. Technology as a catalyst While favourable regulations can help spur trade financing, effectively managing and cutting operational costs will have an equal impact and result in lower-cost trade finance. This will come about by leveraging digital technologies to save resources spent on tedious document evaluations or time-consuming onboarding processes. These technological changes are occurring in different ways. Digital marketing, for one, is dramatically broadening the reach of banks to quickly market trade finance solutions to a vast customer base. Until now, SMEs with turnovers of less than US$20mn faced challenges in accessing trade finance due to the high costs associated with acquisition and servicing. Leveraging artificial intelligence (AI) for customer servicing and transaction processing can change this. Fintechs have taken the lead in this regard, but established institutions like DBS Bank are also heavily investing in this space. Secondly, industry-grade digital information services are helping to streamline trade transaction processing such as document verification processes. In India, for example, banks have been able to readily access GST information6 online since 2017 to enable rapid verification of invoice data, which means they do not need to physically screen paper trade documents to weed out fraudsters. In Singapore, meanwhile, the MAS-sponsored trade finance registry7 will also help banks identify duplicate invoice financing. A third aspect is the e-commerce wave, which has significantly expanded Asia Pacific's trade industry over the past few years and helped create a new crop of digital solutions to tackle more niche segments. For smaller SMEs in this sector, banks leverage an alternative lending model known as \"cloud cashflow-based financing\" that plugs banking solutions into existing e-commerce platforms. Through these partnerships, banks can obtain an in-depth history of suppliers' trade volumes and a range of non-financial factors that allow the bank to assess SMEs' creditworthiness without traditional documentation. For example, DBS Bank has collaborated with Infor Nexus to co-create a digital, data-led financing programme for the company's clients, and this delivers trade financing quickly and efficiently. The platform helps Infor Nexus' customers get financing support from DBS, while the bank gains access to a broad network of suppliers. Leveraging such types of partnerships, DBS Bank has worked with over 300 clients and more than 9,000 suppliers to date to enhance connectivity in digital supply chain financing. A future still in flux Beyond the technological changes, there is much excitement around the potential for blockchain technologies to revolutionise trade financing, but the reality is that in the present context, simple automation will have a larger impact on documentation processes and help streamline trade finance. Generative AI can play an important role as a general-use technology that will have influences across organisations and accelerate the pace of backend office operations, similarly affecting trade finance. Increasingly, however, with a sharpening focus on the future of the planet, trade finance will become more and more closely linked with sustainable business practices. Across many sectors of industry, suppliers need to be encouraged or cajoled into moving towards cleaner, more sustainable business practices, and banks can play a major role in driving this transition through the provision of tailored sustainable trade financing. While geopolitical challenges will continue to shake up trade in the near term, expanding access to financing offers a pathway to ensuring opportunities for growth are equally spread out to companies of all sizes. The challenge for us in the financial industry is not just geopolitical or technological change but how we can adapt and respond to these shifts and provide clients with alternate flows, so that a more equitable and sustainable path to economic development can be realised. Tags: Amit Agarwal, Asian Development Bank (ADB), DBS Bank, Fatr, Trade Receivables Discounting System (TReDS) take me back Recommended for you Supply chain disruption starting to ease after global technology outage AfDB scolds Nigeria over food import policy Former director of Singapore fuel trader liable over US$146mn trade finance fraud Trade recovery continues but risks remain, UN says Privacy Policy Our privacy commitments This Privacy Policy outlines the information we may collect about you in relation to your use of our websites, events, related publications and services (\"personal data\") and how we may use that personal data . It also outlines the methods by which we and our service providers may (subject to necessary consents) monitor your online behaviour to deliver customised advertisements, marketing materials and other tailored services. This Privacy Policy also tells you how you can verify the accuracy of your personal data and how you can request that we delete or update it. This Privacy Policy applies to all websites operated by Exporta Publishing & Events Ltd (as indicated on the relevant website). This privacy statement does not cover the activities of third parties, and you should consult those third-party sites' privacy policies for information on how your data is used by them. Any questions regarding this Policy and our privacy practices should be sent by e-mail to privacy@gtreview.com or by writing to Data Protection Officer at, Exporta Publishing & Events Ltd, 4 Hillgate Place, London, SW12 9ER, United Kingdom. Alternatively, you can telephone our London headquarters at +44 (0) 20 8673 9666. Who are we? Established in 2002 and with offices in London and Singapore, Exporta Publishing & Events Ltd is the world's leading trade and trade finance media company, offering information, news, events and services for companies and individuals involved in global trade. Our principal business activities are: Business-to-Business financial publishing. We provide a range of products and services focused on international commodities, export, supply chain and trade finance markets including magazines, newsletters, electronic information and data Organisers of seminars, conferences, training courses and exhibitions for the finance industry Exporta Publishing & Events Ltd is a company registered in the United Kingdom with company number 4407327 | VAT Registration: 799 1585 59 Data Protection Policy This Data Protection Policy explains when and why we collect personal information about people who visit our website, how we use it, the conditions under which we may disclose it to others and how we keep it secure. Why do we collect information from you? Our primary goal in collecting personal data from you is to give you an enjoyable customised experience whilst allowing us to provide services and features that will meet your needs. We collect certain personal data from you, which you give to us when using our Site and/or registering or subscribing for our products and services. However, we also give you the option to access our Sites' home pages without subscribing or registering or disclosing your personal data. We also collect certain personal data from other group companies to whom you have given information through their websites (including, by way of example, Exporta Publishing & Events Ltd and subsidiaries, in accordance with the purposes listed below). Should we discover that any such personal data has been delivered to any of the Sites, we will remove that information as soon as possible. Why this policy exists This Data Protection Policy ensures Exporta Publishing & Events Ltd: Complies with data protection law and follow good practice Protects the rights of staff, customers and partners Is open about how it stores and processes individuals' data pretexts itself from the risk of a data breach We may change this Policy from time to time so please check this page occasionally to ensure that you're happy with any changes. By using our website, you're agreeing to be bound by this Policy. Data protection law The Data Protection Act 1998 described how organisations - including Exporta Publishing & Events Ltd - must collect, handle and store personal information. These rules apply regardless of whether data is stored electronically, on paper or on other materials. To comply with the law, personal information collected must be stored safely, not disclosed unlawfully and used fairly. The Data Protection Act is underpinned by eight important principles. These say that personal data must: Be processed fairly and lawfully Be obtained only for specific, lawful purposes Be adequate, relevant and not excessive Be accurate and kept up to date Not be held for any longer than necessary Processed in accordance with the rights of data subjects Be protected in appropriate ways Not be transferred outside the European Economic Area (EEA), unless that country of territory also ensures an adequate level of protection How do we collect information from you? We obtain information about you when you use our website, for example, when you contact us about products and services, when you register for an event, register to receive eNewsletters, subscribe or register for a trial to our GTR magazine/website. Types of Personal Data Held and its Use 1. Customer Services and Administration On some Sites, Exporta Publishing & Events Ltd collects personal data such as your name, job title, department, company, e-mail, phone, work and/or home address, in order to register you for access to certain content, subscriptions and events. In addition, we may also store information including IP address and page analytics, including information regarding what pages are accessed, by whom and when. This information is used to administer and deliver to you the products and/or services you have requested, to operate our Sites efficiently and improve our service to you, and to retain records of our business transactions and communications. By using the Sites and submitting personal information through the registration process you are agreeing that we may collect, hold, process and use your information (including personal information) for the purpose of providing you with the Site services and developing our business, which shall include (without limitation) the purposes described in the below paragraphs. 2. Monitoring use of our Sites Where, as part of our Site services, we enable you to post information or materials on our Site, we may access and monitor any information which you upload or input, including in any password-protected sections. Subject to any necessary consents, we also monitor and/or record the different Sites you visit and actions taken on those Sites, e.g. content viewed or searched for. If you are a registered user (e.g. a subscriber or taking a trial), when you log on, this places a cookie on your machine. This enables your access to content and services that are not publicly available. Once you are logged on, the actions you take - for example, viewing an article - will be recorded (subject to any necessary consents). We may use technology or a service provider to do this for us. This information may be used for one or more of the following purposes: to fulfil our obligations to you; to improve the efficiency, quality and design of our Sites and services; to see which articles, features and services are most read and used to track compliance with our terms and conditions of use, e.g. to ensure that you are acting within the scope of your user licence; for marketing purposes (subject to your rights to opt-in and opt-out of receiving certain marketing communications) - see paragraph 3 below; for advertising purposes, although the information used for these purposes does not identify you personally. Please see paragraph 5 below for more details; to protect or comply with our legal rights and obligations; and to enable our journalists to contact and interact with you online in connection with any content you may post to our Sites. Please see paragraph 5 below for more information on cookies and similar technologies and a link to a page where you can turn them on or off. 3. Marketing Some of your personal data collected under paragraphs 1 and 2 above may be used by us to contact you by e-mail, telephone and/or post for sending information or promotional material on our products and/or services and/or those of our other group companies. We give you the opportunity to opt-out of receiving marketing communications. Further detail can be found on the applicable Site and in the footer of each marketing communication sent by us, our group companies or service providers. See also \"Consents and opt-outs\" section below. We will not share your information with third parties for marketing purposes. 4. Profiling We may analyse your personal information to create a profile of your interests and preferences so that we can contact you with information relevant to you. 5. Cookies and similar technologies All our Sites use cookies and similar technical tools to collect information about your access to the Site and the services we provide. What is a cookie? When you enter some sites, your computer will be issued with a cookie. Cookies are text files that identify your computer to servers. Cookies in themselves do not identify the individual user, just the computer used. Many sites do this whenever a user visits their site in order to track traffic flows, recording those areas of the site that have been visited by the computer in question, and for how long. Users have the opportunity to set their computers to accept all cookies, to notify them when a cookie is issued, or not to receive cookies at any time. Selecting not to receive means that certain personalised services Exporta Publishing & Events Ltd offers cannot then be provided to that user. Why do we use cookies? Log In - Where we provide log in mechanisms for site users a cookie is created at login and for the duration of the session. Each cookie contains a unique reference number only (no personal information) which is used to confirm you are authorised. Analytics - To allow us to keep track of traffic to our website we use cookies. The cookies simply tell us if you have previously visited our website so we can get more accurate figures for New vs Returning visitors. Find and control your cookies All of the major browser providers offer advice on setting up and using the privacy and security functions for their products. If you require technical advice or support for a specific browser/version please contact the provider or visit their website for further details: www.microsoft.com / www.mozilla.com / www.apple.com / www.opera.com / www.aol.com / www.netscape.com / www.flock.com / www.google.com. We may use cookies to: remember that you have used the Site before; this means we can identify the number of unique visitors we receive to different parts of the Site. This allows us to make sure we have enough capacity for the number of users that we get and make sure that the Site runs fast enough remember your login session so you can move from one page to another within the Site; store your preferences or your user name and password so that you do not need to input these details every time you visit the Site; customise elements of the layout and/or content of the pages of Site for you; record activity on our Sites so that we understand how you use our Sites enabling us to better tailor our content, services and marketing to your needs; collect statistical information about how you use the Site so that we can improve the Site; and gather information about the pages on the Site that you visit, and other information about other websites that you visit, so as to place you in a \"market segment\". This information is only collected by reference to the IP address that you are using, but does include information about the county and city you are in, together with the name of your internet service provider. Most web browsers automatically accept cookies but, if you prefer, you can change your browser to prevent that, or to notify you each time a cookie is set. You can also learn more about cookies in general by visiting www.allaboutcookies.org which includes additional useful information on cookies and how to block cookies using different types of browser. Please note however, that by blocking, deleting or turning off cookies used on the Site you may not be able to take full advantage of the Site. 6. E-mail tracking E-mail tracking is a method for monitoring the e-mail delivery to those subscribers who have opted-in to receive marketing e-mails from GTR, including GTR Africa, GTR Asia, GTR Americas, GTR Europe, GTR Mena, GTR eNews, Third party e-mails and GTR Ventures. Why do we track e-mails? So that we can better understand our users' needs, we track responses, subscription behaviour and engagement to our e-mails - for example, to see which links are the most popular in newsletters. They enable us to understand the consumers journey through metrics including open rate, click-through rate, bounces and unsubscribes. Any other purposes for which Exporta Publishing & Events Ltd wishes to use your personal data will be notified to you and your personal data will not be used for any such purpose without obtaining your prior consent. How do you track GTR eNewsletters? To do this, we use pixel GIFs, also known as \"pixel tags\" - these are small image files that are placed within the body of our e-mail messages. When that image is downloaded from our web servers, the e-mail is recorded as being opened. By using some form of digitally time-stamped record to reveal the exact time and date that an e-mail was received or opened, as well the IP address of the recipient. 7. Consents and opt-outs You can give your consent to opt-out of all or any particular uses of your data as indicated above by: Indicating at the point on the relevant Site where personal data is collected Informing us by e-mail, post or phone Updating your preferences on the applicable Site or eNewsletter (unsubscribe and preference options are available in the footer of each eNewsletter) To turn cookies and similar technologies on and off, see the information in paragraph 5 above. Any questions regarding consents and opt-outs should be sent by e-mail to privacy@gtreview.com or by writing to Data Protection Officer at, Exporta Publishing & Events Ltd, 4 Hillgate Place, London, SW12 9ER, United Kingdom. Alternatively, you can telephone our London headquarters at +44 (0) 20 8673 9666. 8. Disclosures Information collected at one Site may be shared between Exporta Publishing & Events Ltd and other group companies for the purposes listed above. We may transfer, sell or assign any of the information described in this policy to third parties as a result of a sale, merger, consolidation, change of control, transfer of assets or reorganisation of our business. 9. Public forums, message boards and blogs Some of our Sites may have a message board, blogs or other facilities for user generated content available and users can participate in these facilities. Any information that is disclosed in these areas becomes public information and you should always be careful when deciding to disclose your personal information. 10. Data outside the EEA Services on the Internet are accessible globally so collection and transmission of personal data is not always limited to one country. Exporta Publishing & Events Ltd may transfer your personal data, for the above-listed purposes to other third parties, which may be located outside the European Economic Area and/or with a different level of personal data protection. However, when conducting transfers, we take all necessary steps to ensure that your data is treated reasonably, securely and in accordance with this Privacy Statement. Who has access to your information? Confidentiality and Security of Your Personal Data We are committed to keeping the data you provide us secure and will take reasonable precautions to protect your personal data from loss, misuse or alteration. However, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal data, we cannot guarantee the security of your data transmitted to our Site; any transmission is at your own risk. Once we have received your information, we will use strict procedures and security features described above to try to prevent unauthorised access. We have implemented information security policies, rules and technical measures to protect the personal data that we have under our control from: unauthorised access improper use or disclosure unauthorised modification unlawful destruction or accidental loss All our employees, contractors and data processors (i.e. those who process your personal data on our behalf, for the purposes listed above), who have access to, and are associated with the processing of your personal data, are obliged to keep the information confidential and not use it for any other purpose than to carry out the services they are performing for us. Responsibilities Everyone who works for or with Exporta Publishing & Events Ltd has some responsibility for ensuring data is collected, stored and handled appropriately. Each team handling personal data must ensure that it is handled and processed in line with this policy and data protection principles. However, the following people have key areas of responsibility. The board of directors is ultimately responsible for ensuring that Exporta Publishing & Events Ltd meets its legal obligations. Name of Data Controller The Data Controller is Exporta Publishing & Events Ltd. Exporta Publishing & Events Ltd is subject to the UK Data Protection Act 1998 and is registered in the UK with the Information Commissioner`s Office. How to access, update and erase your personal information If you wish to know whether we are keeping personal data about you, or if you have an enquiry about our privacy policy or your personal data held by us, in relation to any of the Sites, you can contact the Data Protection Officer via: By writing to this address: Data Protection Officer, Exporta Publishing & Events Ltd, 4 Hillgate Place, London, SW12 9ER, UK Telephone: +44 (0) 20 8673 9666 E-mail: privacy@gtreview.com Upon request, we will provide you with a readable copy of the personal data which we keep about you. We may require proof of your identity and may charge a small fee (not exceeding the statutory maximum fee that can be charged) to cover administration and postage. Exporta Publishing & Events Ltd allows you to challenge the data that we hold about you and, where appropriate in accordance with applicable laws, you may have your personal information: erased rectified or amended completed Disclosing data for other reasons In certain circumstances, the Data Protection Act allows personal data to be disclosed to law enforcement agencies without the consent of the data subject. Under these circumstances, Exporta Publishing & Events Ltd, will disclose requested data. However, the Data Controller will ensure the request is legitimate, seeking assistance from the board and from the company's legal advisors where necessary. Changes to this Privacy Statement We will occasionally update this Privacy Statement to reflect new legislation or industry practice, group company changes and customer feedback. We encourage you to review this Privacy Statement periodically to be informed of how we are protecting your personal data. Providing information Exporta Publishing & Events Ltd aims to ensure that individuals are aware that their data is being processed, and that they understand. How the data is being used How to exercise their rights To this end, the company has a privacy statement, setting out how data relating to individuals is used by the company. This is available on request and available on the company's website. Review of this policy We keep this Policy under regular review. This Privacy Statement was last updated in April 2018. I agree I do not agree Due to a high number of registrations you may have issues logging in or registering. If you are experiencing issues, please contact events@gtreview.com . x",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "2024 - Alberta | Oil company fined for exposing animals to toxins - Actual News Magazine",
    "Link": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYWN0dWFsbmV3c21hZ2F6aW5lLmNvbS9lbmdsaXNoL2FsYmVydGEtb2lsLWNvbXBhbnktZmluZWQtZm9yLWV4cG9zaW5nLWFuaW1hbHMtdG8tdG94aW5zL9IBAA?oc=5",
    "Published": "Tue, 16 Jul 2024 01:39:46 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "2024 - Alberta | Oil company fined for exposing animals to toxins İçeriğe atla Arama yap: Son dakika: UK government launches plan to reduce reliance on immigration for labour market Democratic Nomination Bid | Kamala Harris and Canada: What to Expect? When hockey takes Louis Leblanc and Pierre Dagenais to China Canada-US border | New rules for dogs abandoned (Edmonton) A major oilsands producer has been fined after hundreds of birds, wolves and coyotes were exposed to toxins in one of its tailings ponds. Published at 5:48 p.m. Bob Weber The Canadian Press The Alberta Energy Regulator has fined Canadian Natural Resources (CNRL) $278,000. \"CNRL's breach had a direct and seriously negative impact on wildlife,\" the regulator's report said. \"Live animals were killed and euthanized as a result of this breach. There could be no more serious impact on wildlife.\" The report says that in the spring of 2022, Canadian Natural workers discovered an island had emerged in one of its tailings ponds. While the company normally levels these islands to prevent animals from being attracted to them, it did not do so in this case. On May 21, 2022, workers discovered birds on the island. They counted 271 California gull nests and one Canada goose nest. The company notified the regulator on June 7, more than two weeks later. At that time, Canadian Natural said it had installed bird deterrents. \"These and subsequent mitigation measures were not effective in preventing animals from coming into contact with a hazardous substance,\" the regulator's report said. By mid-July, workers were noticing oil-soaked gull chicks. The situation continued until August 4, when the surviving chicks were able to fly away. Canadian Natural reported 411 dead birds in or near the tailings site during the entire incident. Coyotes and wolves may have also visited the island. \"The predators were able to cross the water and enter the island,\" the report said. \"CNRL acknowledged that the predators were walking in the water and killing the oiled birds.\" The regulator reduced the possible fine because the company eventually installed a fence to keep predators off the island and chicks out of the water. Canadian Natural spokeswoman Julie Woo said in an email that the company regrets the situation. \"We have applied the lessons learned to mitigate the risk of recidivism,\" she said. \"We are currently reviewing the enforcement decision. [du regulateur] and potential responses.\" M me Woo did not indicate whether the island was still there. The tailings ponds, which together cover more than 300 square kilometres, lie on a major bird migration route, and measures to keep birds away from toxic water bodies are a condition of licence for all oil sands producers. These measures are not always successful. In the most recent case, 32 waterfowl died in a Suncor pond in May 2023. The heaviest toll occurred in 2008, when 1,600 ducks died after landing in a Syncrude pond. source site-61",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vcnVzc2lhbi1waXBlbGluZS1nYXMtZXhwb3J0cy10by1ldS1pbmNyZWFzZS0yNC15L3ktaW4tamFuLWp1bmUtZ2FzLWdyb3VwLXNheXMtMTEyMTc10gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 10:24:52 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says MOSCOW, July 16 (Reuters) - Russian natural gas exports via pipelines to the European Union countries have jumped by 24% in the first half of the year from the same period in 2023, according to a July report published by the Gas Exporting Countries Forum (GECF). It did not provide the volumes. Russia is a part of the GECF, sometimes dubbed the \"gas OPEC\", which accounts for more than two thirds of global natural gas reserves. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt GECF said pipeline gas imports by the EU from Russia and Azerbaijan have been higher in each month of 2024, compared with the corresponding months in 2023. Russian pipeline gas exports plummeted to Europe to a post-Soviet lows last year after Moscow's relations with the West reached its rock bottom since the 1962 Cuban Missile Crisis over the conflict in Ukraine. Russia supplied a total of about 63.8 billion cubic metres (bcm) of gas to Europe by various pipelines in 2022, according to Reuters calculations. The volume decreased further, by 55.6%, to 28.3 bcm last year. At their peak in 2018-19, annual flows to the region reached between 175 bcm and 180 bcm. According to Reuters calculations, Russian energy giant Gazprom's GAZP.MM average daily natural gas supplies to Europe jumped by almost 23% in June from a year earlier to 81.8 million cubic metres, rebounding from last year's post-Soviet lows, although they fell 8.6% from May. Russian pipeline gas supplies have been closely watched in recent months as Moscow's five-year gas transit deal with Ukraine expires after Dec. 31. While Russia has signalled it was willing to continue with the transit, Ukraine has said it would not renew the agreement with Moscow. (Reporting by Vladimir Soldatkin; Editing by Arun Koyyur) Related Articles Jul 22, 2024 1:45:pm EUROPE GAS-Prices inch down on comfortable stocks, Freeport LNG Jul 22, 2024 4:05:am Azerbaijan upbeat on Russian gas transit to EU via Ukraine Jul 19, 2024 12:30:pm Azerbaijan says will raise gas exports to Europe to 13 bcm in 2024 BDOW!",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Foreign policy to emphasize Taiwan’s key role in global supply chains - Taiwan News",
    "Link": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LnRhaXdhbm5ld3MuY29tLnR3L2VuL25ld3MvNTkwMTY2MtIBAA?oc=5",
    "Published": "Tue, 16 Jul 2024 07:18:00 GMT",
    "Categories": [
      "Production Updates",
      "Supply and Demand"
    ],
    "Content": "Foreign policy to emphasize Taiwan's key role in global supply chains | Taiwan News | Jul. 16, 2024 15:18 Home/Politics/Foreign Affairs Foreign policy to emphasize Taiwan's key role in global supply chains Cabinet to launch economic diplomacy taskforce Jul. 16, 2024 15:18 Ministry of Foreign Affairs Spokesperson Jeff Liu speaks with the media Tuesday. (CNA photo) Matthew Strong Taiwan News, Staff Writer 1318 1318 TAIPEI (Taiwan News) - The Ministry of Foreign Affairs (MOFA) said Tuesday (July 16) it would focus on maintaining Taiwan's crucial role in global supply chains once a new taskforce is formed.The Cabinet is planning to launch an economic diplomacy taskforce, with Foreign Minister Lin Chia-lung (林佳龍) as its head of strategic planning, Radio Taiwan International reported. MOFA said it would emphasize the use of inter-ministerial resources and cooperation across government departments to safeguard Taiwan's role.International cooperation is also to be expanded as part of the core strategy developed by Lin, MOFA said. The minister recently presented a plan to develop diplomacy based on values and economic diplomacy.One of the projects involves the setting up of industrial zones overseas, but MOFA said Tuesday the Ministry of Economic Affairs (MOEA) would be in charge of the plan. # economic diplomacy# Lin Chia-lung# supply chains# MOFA Related Articles Taiwan to host congressional delegation from GuatemalaJul. 14, 2024 20:08 Taiwan welcomes Thai visa waiverJul. 14, 2024 11:52 Taiwan president prepares first overseas trip since inaugurationJul. 10, 2024 19:53 Taiwan trains agricultural experts from 8 African countriesJul. 9, 2024 19:55 Taiwan to boost ownership rate of diplomatic missionsJul. 8, 2024 11:56 Taiwan warns travelers against taking gold, jewelry to JapanJul. 4, 2024 18:01 MOST READ Chinese coast guard ships approach Taiwan's outlying island of Kinmen Typhoon Gaemi may reach Taiwan Wednesday Tropical Storm Gaemi to impact Taiwan mid-week Japan warns China could land troops in Taiwan within a week Video captures Tainan factory explosion Typhoon forecast includes warnings for Taiwan fruit farmers Century-long data shows Taipei warmer than southern Taiwan Global Microsoft outage affects flights at Taiwan Taoyuan International Airport Taiwan mulls new rules to attract digital nomads and foreign professionals Taiwan forecasters see possibility of typhoon next week About UsDirectory of Taiwan About UsDirectory of TaiwanTaiwan News (c) 2024 All Rights Reserved.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Chronicle-Tribune",
    "Link": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5jaHJvbmljbGUtdHJpYnVuZS5jb20vbmV3cy93aXJlL2FldGhvbi1jb21wbGV0ZXMtYWNxdWlzaXRpb24tb2YtdGVsbHVyaWFuLXVwc3RyZWFtLWFuZC1taWRzdHJlYW0tYXNzZXRzL2FydGljbGVfYjk4NzRhZjktMjhkZC01ZTk1LTg4OGYtMjhlYWYxYjg5NTYzLmh0bWzSAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:49 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets | Wire | chronicle-tribune.com Skip to main content You have permission to edit this article. Edit Close Share This Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save DALLAS--(BUSINESS WIRE)--Jul 1, 2024-- Aethon Energy Management LLC (Aethon) today announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375,000 net acres with gathering and treating capacity of over 3 Bcf/d. x This page requires Javascript. Javascript is required for you to be able to read premium content. Please enable it in your browser settings. kAmr@?4FCC6?E H:E9 E96 24BF:D:E:@?[ p6E9@? 2=D@ D:8?65 2 w625D @7 p8C66>6?E Ww~pX 7@C EH@ >6EC:4 E@?D A6C 2??F> W>EA2X @7 =:BF:7:65 ?2EFC2= 82D W{}vX 7C@> E96 sC:7EH@@5 {}v AC@;64E]k^Am kAm\"pD 2 AC:G2E6 6BF:EJ 7:C> 2?5 @A6C2E@C[ H6 2C6 6I4:E65 E@ 6?92?46 @FC DEC2E68:4 7@@EAC:?E 3J :?E68C2E:?8 %6==FC:2?VD FADEC62> 2?5 >:5DEC62> 2DD6ED :?E@ @FC 6IE6?D:G6 w2J?6DG:==6 A@D:E:@?[\" D2:5 v@C5@? wF55=6DE@?[ !C6D:56?E 2?5 !2CE?6C @7 p6E9@? t?6C8J] \"~FC 8@2= :D E@ 86?6C2E6 4@>A6==:?8 C6EFC?D H9:=6 DFAA@CE:?8 E96 4@>>F?:E:6D H6 @A6C2E6 :? 2D H6 >2<6 AC@8C6DD E@H2C5D AC@G:5:?8 ?6E K6C@ ?2EFC2= 82D E@ 3@E9 5@>6DE:4 2?5 :?E6C?2E:@?2= 4FDE@>6CD] (6 4@?E:?F6 E@ H@C< H:E9 %6==FC:2? @? 2 =@?8\\E6C> D2=6 2?5 AFC492D6 28C66>6?E 7@C EH@ >EA2 @7 {}v 2?5 36=:6G6 :? E96 >2?J 36?67:ED E92E =@H 6>:DD:@? 6IA@CED 92G6 7@C E96 3C@256C 6?6C8J EC2?D:E:@?]\"k^Am kAm\"%9:D EC2?D24E:@? :D 2 D:8?:7:42?E DE6A :? D64FC:?8 @FC 32=2?46 D966E 2?5 AC@8C6DD:?8 sC:7EH@@5[\" 25565 %6==FC:2? tI64FE:G6 r92:C>2? |2CE:? w@FDE@?] \"%96 A2CE?6CD9:A 36EH66? p6E9@? 2?5 %6==FC:2? :D G:E2= 2D H6 4@?E:?F6 D64FC:?8 3FJ6CD 7@C sC:7EH@@5'D C6>2:?:?8 42A24:EJ 2?5 25G2?46 :ED 56G6=@A>6?E] ~FC 28C66>6?E G2=:52E6D E96 C@=6 @7 &]$] {}v 2D E96 8=@32= EC2?D:E:@? 7F6= 2?5 :? AC@G:5:?8 6?6C8J D64FC:EJ E@ p>6C:42'D A2CE?6CD 2C@F?5 E96 H@C=5]\"k^Am kAmr:E: 2?5 %CF:DE $64FC:E:6D D6CG65 2D 7:?2?4:2= 25G:D@CD E@ p6E9@?[ 2?5 v:3D@? sF?? 2D =682= 4@F?D6=] {2K2C5 H2D 7:?2?4:2= 25G:D@C E@ %6==FC:2?[ 2?5 p<:? vF>A AC@G:565 =682= 4@F?D6=]k^Am kAmk6>mp3@FE p6E9@? t?6C8J |2?286>6?Ek^6>mk^Am kAmp6E9@? t?6C8J |2?286>6?E :D 2 AC:G2E6 :?G6DE>6?E 7:C> 2?5 C68:DE6C65 :?G6DE>6?E 25G:D6C E92E >2?286D 4=@D65\\6?5 7F?5D 7@4FD65 @? 24BF:C:?8[ @A6C2E:?8[ 2?5 56G6=@A:?8 @?D9@C6 6?6C8J C6D@FC46D 24C@DD }@CE9 p>6C:42] w625BF2CE6C65 :? s2==2D[ %)[ p6E9@? 92D 56A=@J65 >@C6 E92? Sh 3:==:@? @G6C 2 bc\\J62C EC24< C64@C5 H9:=6 86?6C2E:?8 2EEC24E:G6 C6EFC?D 7@C :ED 7F?5 :?G6DE@CD 24C@DD >F=E:A=6 4@>>@5:EJ AC:46 4J4=6D] p6E9@?'D G6CE:42==J :?E68C2E65 DEC2E68J AC@G:56D 42A:E2= 677:4:6?E 8C@HE9[ 4@>3:?65 H:E9 5:D4:A=:?65 C:D< >2?286>6?E E@ DFAA@CE 42D9 7=@H 2DDFC2?46] %@52J[ p6E9@? :D 2 =625:?8[ =@H\\6>:DD:@? @A6C2E@C 2?5 @?6 @7 E96 =2C86DE AC:G2E6 ?2EFC2= 82D AC@5F46CD 2?5 DFAA=:6CD E@ {}v 724:=:E:6D :? E96 &]$][ :?4=F5:?8 >@C6 E92? `[f__ >:=6D @7 >:5DEC62> :?7C2DECF4EFC6] !=62D6 G:D:E k2 9C67lQ9EEADi^^4ED]3FD:?6DDH:C6]4@>^4E^r%n:5lD>2CE=:?<U2>AjFC=l9EEATbpTauTauHHH]p6E9@?t?6C8J]4@>U2>Aj6D966Eldc_gggebU2>Aj?6HD:E6>:5la_ac_f_``ag`__U2>Aj=2?l6?\\&$U2>Aj2?49@ClHHH]p6E9@?t?6C8J]4@>U2>Aj:?56Il`U2>Aj>5dl223eb__cd24c_6bb5`2hdgd6673e4a4_Q C6=lQ?@7@==@HQ D92A6lQC64EQmHHH]p6E9@?t?6C8J]4@>k^2m 7@C >@C6 :?7@C>2E:@?]k^Am kAm':6H D@FC46 G6CD:@? @? k2 9C67lQ9EEAi^^3FD:?6DDH:C6]4@>Qm3FD:?6DDH:C6]4@>k^2mik2 9C67lQ9EEADi^^HHH]3FD:?6DDH:C6]4@>^?6HD^9@>6^a_ac_f_``ag`__^6?^Q C6=lQ?@7@==@HQm9EEADi^^HHH]3FD:?6DDH:C6]4@>^?6HD^9@>6^a_ac_f_``ag`__^6?^k^2mk^Am kAmr~}%pr%i r=2JE@? |4vC2EEJk^Am kAm!9@?6i Z` Wa`cX bde\\fhdhk^Am kAmt>2:=i4>48C2EEJo26E9@?6?6C8J]4@>p?5C6H '@? z6C6?Dk^Am kAm!9@?6i Z`Wg`fX cde\\aag_k^Am kAmt>2:=i2G@?<6C6?Do26E9@?6?6C8J]4@>k^Am kAmzt*(~#si %t)p$ &}x%ts $%p%t$ }~#%w p|t#xrpk^Am kAmx}s&$%#* zt*(~#si ~%wt# t}t#v* ~x{^vp$ }p%&#p{ #t$~&#rt$ ux}p}rt t}t#v* r~}$&{%x}v !#~ut$$x~}p{ $t#'xrt$ ~%wt# }p%&#p{ #t$~&#rt$k^Am kAm$~&#rti p6E9@? t?6C8J |2?286>6?E {{rk^Am kAmr@AJC:89E qFD:?6DD (:C6 a_ac]k^Am kAm!&qi _f^_`^a_ac _gi__ p|^sx$ri _f^_`^a_ac _gi__ p|k^Am kAmk2 9C67lQ9EEAi^^HHH]3FD:?6DDH:C6]4@>^?6HD^9@>6^a_ac_f_``ag`__^6?Qm9EEAi^^HHH]3FD:?6DDH:C6]4@>^?6HD^9@>6^a_ac_f_``ag`__^6?k^2mk^Am Facebook Twitter WhatsApp SMS Email Print Copy article link Save Recommended for you Featured Local Savings x Post a comment as anonymous Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment x Your comment has been submitted. anonymous x Report Cancel Report Abuse xReported xThere was a problem reporting this. x Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd, racist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another person will not be tolerated. Be Truthful. Don't knowingly lie about anyone or anything. Be Nice. No racism, sexism or any sort of -ism that is degrading to another person. Be Proactive. Use the 'Report' link on each comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness accounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Latest e-Edition Chronicle-Tribune To view our latest e-Edition click the image on the left. Special Sections Senior Health 2024 May 7, 2024 Special Sections Business Cards Mar 27, 2024 Special Sections Real Estate Mar 2024 Mar 6, 2024 Special Sections Small Business Showcase 2024 Feb 21, 2024 Most Popular Articles Images Videos Commented ArticlesMiller set to chase Olympic judo dreamThe Fresh Factory Expands Operations with New 56,000 SF Facility in Downers Grove, IllinoisMississinewa hires Brooks to lead athletic departmentHigh school for adults opens in MarionCare chase results in crash, narcotics chargesMilk and Honey Coffee Co. opens cart at Marion HealthGeneral Motors evacuates after explosion scareNew Meijer Grocery Store Opens in Noblesville TodayMoore files reply, motion for continuanceJonesboro and Hands of Hope hosts groundbreaking for new greenspace Images Videos CommentedSorry, there are no recent results for popular commented articles. Latest News City council passes more than $4.25 million in ARPA spending Indiana death row inmate's lawyers say mental illness should preclude him from execution Community Calendar: Things to do Happenings @ MPL Church notes for the weekend of July 13, 2024 Club News published July 13 To Do Milk and Honey Coffee Co. opens cart at Marion Health Stocks Market Data by TradingView Chronicle-Tribune 610 S. Adams St, Marion, IN | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital. Back x Sorry , an error occurred. Cancel anytime Get StartedManage Service Log In You are logged in Switch accounts Secure transaction. Cancel anytime. Back x Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely! * First name * Last name * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. Contact information Phone CAPTCHA Create Account Have an account? Log In x You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back x Log In Invalid password or account does not exist Email Address Password Remember me Forgot your password? Log In Email me a log in link Need an account? Sign Up Back x Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password x Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back x Email me a log in link Account Email CAPTCHA Send Email Back x Promotional Offers Enter Promo Code Redeem No promotional rates found. Back x Purchase Gift Purchase Access See More Offers details close x x Secure & Encrypted What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Purchaser zip code Delivery date Delivery date What's your billing location? Address City State AlabamaAlaskaArizonaArkansasCaliforniaColoradoConnecticutDelawareFloridaGeorgiaHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaOhioOklahomaOregonPennsylvaniaRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahVermontVirginiaWashingtonWashington D.C.West VirginiaWisconsinWyomingPuerto RicoUS Virgin IslandsArmed Forces AmericasArmed Forces PacificArmed Forces EuropeNorthern Mariana IslandsMarshall IslandsAmerican SamoaFederated States of MicronesiaGuamPalauAlberta, CanadaBritish Columbia, CanadaManitoba, CanadaNew Brunswick, CanadaNewfoundland, CanadaNova Scotia, CanadaNorthwest Territories, CanadaNunavut, CanadaOntario, CanadaPrince Edward Island, CanadaQuebec, CanadaSaskatchewan, CanadaYukon Territory, Canada Zip Code Country United States of AmericaUS Virgin IslandsUnited States Minor Outlying IslandsCanadaMexico, United Mexican StatesBahamas, Commonwealth of theCuba, Republic ofDominican RepublicHaiti, Republic ofJamaicaAfghanistanAlbania, People's Socialist Republic ofAlgeria, People's Democratic Republic ofAmerican SamoaAndorra, Principality ofAngola, Republic ofAnguillaAntarctica (the territory South of 60 deg S)Antigua and BarbudaArgentina, Argentine RepublicArmeniaArubaAustralia, Commonwealth ofAustria, Republic ofAzerbaijan, Republic ofBahrain, Kingdom ofBangladesh, People's Republic ofBarbadosBelarusBelgium, Kingdom ofBelizeBenin, People's Republic ofBermudaBhutan, Kingdom ofBolivia, Republic ofBosnia and HerzegovinaBotswana, Republic ofBouvet Island (Bouvetoya)Brazil, Federative Republic ofBritish Indian Ocean Territory (Chagos Archipelago)British Virgin IslandsBrunei DarussalamBulgaria, People's Republic ofBurkina FasoBurundi, Republic ofCambodia, Kingdom ofCameroon, United Republic ofCape Verde, Republic ofCayman IslandsCentral African RepublicChad, Republic ofChile, Republic ofChina, People's Republic ofChristmas IslandCocos (Keeling) IslandsColombia, Republic ofComoros, Union of theCongo, Democratic Republic ofCongo, People's Republic ofCook IslandsCosta Rica, Republic ofCote D'Ivoire, Ivory Coast, Republic of theCyprus, Republic ofCzech RepublicDenmark, Kingdom ofDjibouti, Republic ofDominica, Commonwealth ofEcuador, Republic ofEgypt, Arab Republic ofEl Salvador, Republic ofEquatorial Guinea, Republic ofEritreaEstoniaEthiopiaFaeroe IslandsFalkland Islands (Malvinas)Fiji, Republic of the Fiji IslandsFinland, Republic ofFrance, French RepublicFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabon, Gabonese RepublicGambia, Republic of theGeorgiaGermanyGhana, Republic ofGibraltarGreece, Hellenic RepublicGreenlandGrenadaGuadaloupeGuamGuatemala, Republic ofGuinea, Revolutionary People's Rep'c ofGuinea-Bissau, Republic ofGuyana, Republic ofHeard and McDonald IslandsHoly See (Vatican City State)Honduras, Republic ofHong Kong, Special Administrative Region of ChinaHrvatska (Croatia)Hungary, Hungarian People's RepublicIceland, Republic ofIndia, Republic ofIndonesia, Republic ofIran, Islamic Republic ofIraq, Republic ofIrelandIsrael, State ofItaly, Italian RepublicJapanJordan, Hashemite Kingdom ofKazakhstan, Republic ofKenya, Republic ofKiribati, Republic ofKorea, Democratic People's Republic ofKorea, Republic ofKuwait, State ofKyrgyz RepublicLao People's Democratic RepublicLatviaLebanon, Lebanese RepublicLesotho, Kingdom ofLiberia, Republic ofLibyan Arab JamahiriyaLiechtenstein, Principality ofLithuaniaLuxembourg, Grand Duchy ofMacao, Special Administrative Region of ChinaMacedonia, the former Yugoslav Republic ofMadagascar, Republic ofMalawi, Republic ofMalaysiaMaldives, Republic ofMali, Republic ofMalta, Republic ofMarshall IslandsMartiniqueMauritania, Islamic Republic ofMauritiusMayotteMicronesia, Federated States ofMoldova, Republic ofMonaco, Principality ofMongolia, Mongolian People's RepublicMontserratMorocco, Kingdom ofMozambique, People's Republic ofMyanmarNamibiaNauru, Republic ofNepal, Kingdom ofNetherlands AntillesNetherlands, Kingdom of theNew CaledoniaNew ZealandNicaragua, Republic ofNiger, Republic of theNigeria, Federal Republic ofNiue, Republic ofNorfolk IslandNorthern Mariana IslandsNorway, Kingdom ofOman, Sultanate ofPakistan, Islamic Republic ofPalauPalestinian Territory, OccupiedPanama, Republic ofPapua New GuineaParaguay, Republic ofPeru, Republic ofPhilippines, Republic of thePitcairn IslandPoland, Polish People's RepublicPortugal, Portuguese RepublicPuerto RicoQatar, State ofReunionRomania, Socialist Republic ofRussian FederationRwanda, Rwandese RepublicSamoa, Independent State ofSan Marino, Republic ofSao Tome and Principe, Democratic Republic ofSaudi Arabia, Kingdom ofSenegal, Republic ofSerbia and MontenegroSeychelles, Republic ofSierra Leone, Republic ofSingapore, Republic ofSlovakia (Slovak Republic)SloveniaSolomon IslandsSomalia, Somali RepublicSouth Africa, Republic ofSouth Georgia and the South Sandwich IslandsSpain, Spanish StateSri Lanka, Democratic Socialist Republic ofSt. HelenaSt. Kitts and NevisSt. LuciaSt. Pierre and MiquelonSt. Vincent and the GrenadinesSudan, Democratic Republic of theSuriname, Republic ofSvalbard & Jan Mayen IslandsSwaziland, Kingdom ofSweden, Kingdom ofSwitzerland, Swiss ConfederationSyrian Arab RepublicTaiwan, Province of ChinaTajikistanTanzania, United Republic ofThailand, Kingdom ofTimor-Leste, Democratic Republic ofTogo, Togolese RepublicTokelau (Tokelau Islands)Tonga, Kingdom ofTrinidad and Tobago, Republic ofTunisia, Republic ofTurkey, Republic ofTurkmenistanTurks and Caicos IslandsTuvaluUganda, Republic ofUkraineUnited Arab EmiratesUnited Kingdom of Great Britain & N. IrelandUruguay, Eastern Republic ofUzbekistanVanuatuVenezuela, Bolivarian Republic ofViet Nam, Socialist Republic ofWallis and Futuna IslandsWestern SaharaYemenZambia, Republic ofZimbabwe What's your delivery address? Copy billing location Address City State AlabamaAlaskaArizonaArkansasCaliforniaColoradoConnecticutDelawareFloridaGeorgiaHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaOhioOklahomaOregonPennsylvaniaRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahVermontVirginiaWashingtonWashington D.C.West VirginiaWisconsinWyomingPuerto RicoUS Virgin IslandsArmed Forces AmericasArmed Forces PacificArmed Forces EuropeNorthern Mariana IslandsMarshall IslandsAmerican SamoaFederated States of MicronesiaGuamPalauAlberta, CanadaBritish Columbia, CanadaManitoba, CanadaNew Brunswick, CanadaNewfoundland, CanadaNova Scotia, CanadaNorthwest Territories, CanadaNunavut, CanadaOntario, CanadaPrince Edward Island, CanadaQuebec, CanadaSaskatchewan, CanadaYukon Territory, Canada Zip code Country United States of AmericaUS Virgin IslandsUnited States Minor Outlying IslandsCanadaMexico, United Mexican StatesBahamas, Commonwealth of theCuba, Republic ofDominican RepublicHaiti, Republic ofJamaicaAfghanistanAlbania, People's Socialist Republic ofAlgeria, People's Democratic Republic ofAmerican SamoaAndorra, Principality ofAngola, Republic ofAnguillaAntarctica (the territory South of 60 deg S)Antigua and BarbudaArgentina, Argentine RepublicArmeniaArubaAustralia, Commonwealth ofAustria, Republic ofAzerbaijan, Republic ofBahrain, Kingdom ofBangladesh, People's Republic ofBarbadosBelarusBelgium, Kingdom ofBelizeBenin, People's Republic ofBermudaBhutan, Kingdom ofBolivia, Republic ofBosnia and HerzegovinaBotswana, Republic ofBouvet Island (Bouvetoya)Brazil, Federative Republic ofBritish Indian Ocean Territory (Chagos Archipelago)British Virgin IslandsBrunei DarussalamBulgaria, People's Republic ofBurkina FasoBurundi, Republic ofCambodia, Kingdom ofCameroon, United Republic ofCape Verde, Republic ofCayman IslandsCentral African RepublicChad, Republic ofChile, Republic ofChina, People's Republic ofChristmas IslandCocos (Keeling) IslandsColombia, Republic ofComoros, Union of theCongo, Democratic Republic ofCongo, People's Republic ofCook IslandsCosta Rica, Republic ofCote D'Ivoire, Ivory Coast, Republic of theCyprus, Republic ofCzech RepublicDenmark, Kingdom ofDjibouti, Republic ofDominica, Commonwealth ofEcuador, Republic ofEgypt, Arab Republic ofEl Salvador, Republic ofEquatorial Guinea, Republic ofEritreaEstoniaEthiopiaFaeroe IslandsFalkland Islands (Malvinas)Fiji, Republic of the Fiji IslandsFinland, Republic ofFrance, French RepublicFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabon, Gabonese RepublicGambia, Republic of theGeorgiaGermanyGhana, Republic ofGibraltarGreece, Hellenic RepublicGreenlandGrenadaGuadaloupeGuamGuatemala, Republic ofGuinea, Revolutionary People's Rep'c ofGuinea-Bissau, Republic ofGuyana, Republic ofHeard and McDonald IslandsHoly See (Vatican City State)Honduras, Republic ofHong Kong, Special Administrative Region of ChinaHrvatska (Croatia)Hungary, Hungarian People's RepublicIceland, Republic ofIndia, Republic ofIndonesia, Republic ofIran, Islamic Republic ofIraq, Republic ofIrelandIsrael, State ofItaly, Italian RepublicJapanJordan, Hashemite Kingdom ofKazakhstan, Republic ofKenya, Republic ofKiribati, Republic ofKorea, Democratic People's Republic ofKorea, Republic ofKuwait, State ofKyrgyz RepublicLao People's Democratic RepublicLatviaLebanon, Lebanese RepublicLesotho, Kingdom ofLiberia, Republic ofLibyan Arab JamahiriyaLiechtenstein, Principality ofLithuaniaLuxembourg, Grand Duchy ofMacao, Special Administrative Region of ChinaMacedonia, the former Yugoslav Republic ofMadagascar, Republic ofMalawi, Republic ofMalaysiaMaldives, Republic ofMali, Republic ofMalta, Republic ofMarshall IslandsMartiniqueMauritania, Islamic Republic ofMauritiusMayotteMicronesia, Federated States ofMoldova, Republic ofMonaco, Principality ofMongolia, Mongolian People's RepublicMontserratMorocco, Kingdom ofMozambique, People's Republic ofMyanmarNamibiaNauru, Republic ofNepal, Kingdom ofNetherlands AntillesNetherlands, Kingdom of theNew CaledoniaNew ZealandNicaragua, Republic ofNiger, Republic of theNigeria, Federal Republic ofNiue, Republic ofNorfolk IslandNorthern Mariana IslandsNorway, Kingdom ofOman, Sultanate ofPakistan, Islamic Republic ofPalauPalestinian Territory, OccupiedPanama, Republic ofPapua New GuineaParaguay, Republic ofPeru, Republic ofPhilippines, Republic of thePitcairn IslandPoland, Polish People's RepublicPortugal, Portuguese RepublicPuerto RicoQatar, State ofReunionRomania, Socialist Republic ofRussian FederationRwanda, Rwandese RepublicSamoa, Independent State ofSan Marino, Republic ofSao Tome and Principe, Democratic Republic ofSaudi Arabia, Kingdom ofSenegal, Republic ofSerbia and MontenegroSeychelles, Republic ofSierra Leone, Republic ofSingapore, Republic ofSlovakia (Slovak Republic)SloveniaSolomon IslandsSomalia, Somali RepublicSouth Africa, Republic ofSouth Georgia and the South Sandwich IslandsSpain, Spanish StateSri Lanka, Democratic Socialist Republic ofSt. HelenaSt. Kitts and NevisSt. LuciaSt. Pierre and MiquelonSt. Vincent and the GrenadinesSudan, Democratic Republic of theSuriname, Republic ofSvalbard & Jan Mayen IslandsSwaziland, Kingdom ofSweden, Kingdom ofSwitzerland, Swiss ConfederationSyrian Arab RepublicTaiwan, Province of ChinaTajikistanTanzania, United Republic ofThailand, Kingdom ofTimor-Leste, Democratic Republic ofTogo, Togolese RepublicTokelau (Tokelau Islands)Tonga, Kingdom ofTrinidad and Tobago, Republic ofTunisia, Republic ofTurkey, Republic ofTurkmenistanTurks and Caicos IslandsTuvaluUganda, Republic ofUkraineUnited Arab EmiratesUnited Kingdom of Great Britain & N. IrelandUruguay, Eastern Republic ofUzbekistanVanuatuVenezuela, Bolivarian Republic ofViet Nam, Socialist Republic ofWallis and Futuna IslandsWestern SaharaYemenZambia, Republic ofZimbabwe Phone Subtotal: Total: How would you like to pay? Ending in Add New Card Name on card Credit card CVV Expiration Month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Expiration year 2024 2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. x You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. Rate: Begins: Transaction ID: A receipt was sent to your email. OK x An error occurred This offer is currently unavailable. Close",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Bedford gas leak after drilling company hits natural gas pocket - BBC.com",
    "Link": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jeHcybnc0M3A0cm_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:47:08 GMT",
    "Categories": [
      "Company News",
      "Exploration"
    ],
    "Content": "Bedford gas leak after drilling company hits natural gas pocket Skip to content HomeNewsIsrael-Gaza WarWar in UkraineUS & CanadaUKUK PoliticsEnglandN. IrelandN. Ireland PoliticsScotlandScotland PoliticsWalesWales PoliticsAfricaAsiaChinaIndiaAustraliaEuropeLatin AmericaMiddle EastIn PicturesBBC VerifySportBusinessExecutive LoungeTechnology of BusinessWomen at the HelmFuture of BusinessInnovationTechnologyScience & HealthArtificial IntelligenceAI v the MindCultureFilm & TVMusicArt & DesignStyleBooksEntertainment NewsTravelDestinationsAfricaAntarcticaAsiaAustralia and PacificCaribbean & BermudaCentral AmericaEuropeMiddle EastNorth AmericaSouth AmericaWorld's TableCulture & ExperiencesAdventuresThe SpeciaListEarthNatural WondersWeather & ScienceClimate SolutionsSustainable BusinessGreen LivingVideoLiveLive NewsLive Sport Home News Sport Business Innovation Culture Travel Earth Video Live Audio Weather Newsletters Gas leak: Roads could be closed for two days 3 July 2024 Share Google Road closures are in place at Cleat Hill, Kimbolton Road, Glenrose Avenue and Wagstaffe Close A drilling company caused a gas leak in a residential area after hitting a pocket of natural gas.Bedfordshire Fire and Rescue have been at the scene in Cleat Hill, Bedford, since 15:00 BST on Tuesday and warned nearby road closures could remain in place until Thursday.Nicholls Boreholes and Ground Source said they had been drilling a borehole for a heat pump when they \"encountered a pocket of naturally occurring gas at approximately 100 meters below ground level\". It added: \"The borehole has been temporarily capped to control the flow of gas whilst we work with the emergency services to permanently close the borehole. Bedfordshire Police put a cordon in place and assisted with road closures. Follow Beds, Herts and Bucks news on Facebook , Instagram and X . Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830 More on this story Homes evacuated after builder dug into gas pipe Homes evacuated and roads closed due to gas leak Homes evacuated over gas leak fire Related internet links Bedfordshire Fire and Rescue Service Bedfordshire Police Bedford Bedfordshire and Luton Fire and Rescue Service",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC ... - economica.ma",
    "Link": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2Vjb25vbWljYS5tYS9uZXdzL3VwZGF0ZWQtZHJpbGxpbmctZW5naW5lZXJpbmctYW5kLXRlY2huaWNhbC1zZXJ2aWNlcy1tYXJrZXQtc2l6ZS1hbmFseXNpcy1qZXJlaC1vaWxmaWVsZC1zZXJ2aWNlcy1ncm91cC16cGVjLXJ1dG9uZy8zNzAzNS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:02:37 GMT",
    "Categories": [
      "Market Trends",
      "Exploration"
    ],
    "Content": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong - Economica Skip to content Tuesday, July 16th, 2024 Home Contactez Nous Politique de confidentialite News [Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong Ron Curren 0 Comments 3 July 2024 Press Release, July, 2024 (Orbis Research) - The 2024 Global Drilling Engineering and Technical Services Market report focuses on comprehensive industry insights and intelligence alongside prevailing and anticipated market trends from 2024 to 2031. It also conducts an exhaustive examination encompassing pricing, current geographical regions, technology, and supply and demand dynamics, potentially impacting the growth trajectory of the trade market. Commencing with an introduction to market fundamentals such as definitions, classifications, applications, and an industry chain overview, the study proceeds to delineate product specifications, business strategies, and policies, followed by illustrations of cost structures, manufacturing processes, and the like. Subsequently, it scrutinizes market conditions across major global regions, encompassing factors like product costs, profitability, potential, manufacturing efficiency, asset utilization, supply and demand equilibrium, and industry growth rates, among others. Concluding with a project-based SWOT analysis, investment feasibility assessment, and investment return analysis, the report offers comprehensive recommendations. Request a sample report @ https://www.orbisresearch.com/contacts/request-sample/7279388 The primary objective of the Global Drilling Engineering and Technical Services Industry Study is to facilitate sustainable growth for clients by furnishing them with a thorough analysis enabling comprehension of the market's economic potential. Through a five forces analysis of the global Drilling Engineering and Technical Services market, insights into competitive dynamics are provided. This analysis assesses the bargaining power of consumers and suppliers, the threat of new entrants and substitute products, and the intensity of rivalry within the market, aiding market participants in comprehending the competitive landscape and making informed business decisions. The prognosis of the Drilling Engineering and Technical Services report is outlined as follows: Initiating with a market overview, it proceeds to examine industry advancement proposals. The Worldwide Industry 2020 study, a comprehensive and professional endeavor, disseminates market research data pertinent to both new entrants and established players, analyzing strategic planning of sector-involved entities. Additionally, it identifies SWOT analyses, revenue breakdowns, and company overviews of major market players. Trading activity projections over the next five years might depict an upward trajectory, offering insights into the future landscape for various players engaged in goods or services promotion, while considering the market's profit dynamics. Furthermore, the report conducts an evaluation and detailed interpretation potentially enticing consumers to acquire a significant share of the global industry. Drilling Engineering and Technical Services market Segmentation by Type: Offshore Drilling Onshore Drilling Drilling Engineering and Technical Services market Segmentation by Application: Oil Natural Gas Other Direct Purchase the report @ https://www.orbisresearch.com/contact/purchase-single-user/7279388 Effectively segmented into top manufacturers, geographical regions, product categories, and applications, the global Drilling Engineering and Technical Services market analysis provides in-depth insights for each category, accompanied by size forecasts for the global market and each class. Moreover, it offers a comprehensive examination of numerous industry segments, including opportunities and positioning of top players. Investors can discern actual demand for specific sectors through category-wise analyses. Numerous prominent market contenders vie within the global Drilling Engineering and Technical Services market. To attain a competitive edge, these entities employ strategies such as product innovation, strategic partnerships, acquisitions, and investments in research and development. Furthermore, they dedicate significant efforts to expanding their customer base, solidifying market positions, and delivering tailored solutions to meet individual customer needs. Key Players in the Drilling Engineering and Technical Services market: Jereh Oilfield Services Group ZPEC Rutong Sinopec CNOOC Anton Oilfield Services Group Schlumberger Haliburton Baker Hughes Renzhi Petrolor Sinogeo The objective of this report is to furnish readers with a comprehensive understanding of the global Drilling Engineering and Technical Services market, encompassing key market players, growth projections, market trends, opportunities, threats, and competitive analyses. Offering insightful assessments and valuable data, this report serves to inform business strategies, financial decisions, and market entry or expansion plans. Do You Have Any Query Or Specific Requirement? Ask to Our Industry Expert @ https://www.orbisresearch.com/contacts/enquiry-before-buying/7279388 Aids of the Global Economy Study Drilling Engineering and Technical Services: * This study offers a comprehensive examination of current trends and future predictions, elucidating factors influencing and hindering market expansion. An in-depth industry analysis based on product type and application aids in understanding globally favored products, followed by an assessment of supplier and buyer potency. Focusing on key product orders and monitoring top rivals within the market framework completes a thorough market analysis. * The study includes financial analyses, market-winning strategies, new developments, and product offerings for major vendors in the global market. It can be instrumental for vendors, affiliated business partners, and system integrators in identifying critical investment regions and formulating strategies. About Us Orbis Research (orbisresearch.com) is a single point aid for all your market research requirements. We have a vast database of reports from leading publishers and authors across the globe. We specialize in delivering customized reports as per the requirements of our clients. We have complete information about our publishers and hence are sure about the accuracy of the industries and verticals of their specialization. This helps our clients to map their needs and we produce the perfect required market research study for our clients. Hector Costello Senior Manager - Client Engagements 4144N Central Expressway, Suite 600, Dallas, Previous Post [Trends ] Agricultural Product Processing Market Growth Drivers | COFCO, Beidahuang, Shounong Food Group Next Post Offshore Drilling Engineering Services Market Latest Trends &Innovations | Transocean, Petroleos De Venezuela, COSL About the author Ron Curren Search Search Articles recents Offshore Oil and Gas Communications Market Business Insights, Key Trend Analysis | ABB Ltd., GE(Baker Hughes), CommScope Inc. Residential Router Market 2024 Trends | TP-Link, D-Link, Tenda Hybrid Photonic Integrated Circuit Market 2024 Key Insights | Infinera Corporation, NeoPhotonics Corporation, Huawei Global Programmable Application Specific Integrated Circuit (ASIC) Market Analysis and Revenue Prediction | Texas Instruments, Infineon Technologies, STMicroelectronics Vessel Tracking Systems Market 2024 [SWOT] Analysis | Big Ocean Data, ORBCOMM, SAAB Group Commentaires recents No comments to show. Archives July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 August 2023 July 2023 March 2023 February 2023 December 2022 November 2022 October 2022 September 2022 May 2022 April 2022 March 2022 February 2022 Categories Agriculture Eco International News Non classe Urbanisme Worldwide",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy51cHN0cmVhbW9ubGluZS5jb20vcmlncy1hbmQtdmVzc2Vscy9taWRkbGUtZWFzdC1wbGF5ZXItYmFncy1tdWx0aW1pbGxpb24tZG9sbGFyLXJpZy1kZWFscy10by1leHBhbmQtZHJpbGxpbmctZmxlZXQtdG8tMTQ4LWJ5LTIwMjYvMi0xLTE2NzEyNTLSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 07:45:01 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 | Upstream Rigs and Vessels Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 Island rigs will be constructed by China's Honghua GroupAdnoc Drilling chief executive Abdulrahman Abdulla Al Seiari.Photo: ADNOC DRILLING Nishant Ugal Middle East and South Asia EditorNew Delhi ADNOCAdnoc DrillingUnited Arab EmiratesMiddle EastHonghua Published 3 July 2024, 07:22Updated 3 July 2024, 07:22",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices - World Pipelines",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy53b3JsZHBpcGVsaW5lcy5jb20vc3BlY2lhbC1yZXBvcnRzLzAyMDcyMDI0L3J5c3RhZC1lbmVyZ3ktYnVsbGlzaC1tYXJrZXQtZnVuZGFtZW50YWxzLWFyZS10aGUtbWFpbi1jb250cmlidXRpbmctZmFjdG9yLXRvLWhpZ2hlci1nbG9iYWwtb2lsLXByaWNlcy_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:38:00 GMT",
    "Categories": [
      "Market Trends"
    ],
    "Content": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices | World Pipelines For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Skip to main content Advertisement Home Special reports 02 Jul 24 Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices Advertisement Here is Rystad Energy's oil macro update from Global Market Analysis Director Claudio Galimberti: \"Strong market fundamentals are pushing oil prices higher this week, on track for four consecutive weeks of increases. Lower crude exports from OPEC and Russia, just as refinery runs ramp up for the summer peak, are helping contribute to a tighter-than-expected market, and prices are reacting accordingly. Increasingly likely interest rates cuts by the Fed in coming months and still high geopolitical risk premium are adding to the upward pressure.\" Better-than-expected market fundamentals and expectations of forthcoming interest rate cuts by the US Federal Reserve are helping keep oil prices on a bullish trajectory this week.Rystad Energy modelling suggests most of the price increases have been driven by bullish fundamentals, specifically on the refining and crude side, while macroeconomic factors and ongoing concerns regarding the escalation of conflicts in the Middle East and Ukraine have played a secondary, albeit non-negligible, role.Brent prices increased by more than 6% in June, and July is starting on a similar path.Looking at the fundamentals, we have significantly lowered our forecast for US oil production from August onwards.These adjustments reflect a downturn in Permian oil output due to ongoing low activity and consolidation through mergers and acquisitions.Most changes are concentrated on the Texas side, while New Mexico has shown resilience, although April data reflects a decline in monthly figures, averaging a fall of approximately 80 000 bpd. Overall, the downward adjustment from August 2024 through December 2025 averages about 200 000 bpd.These adjustments are bullish for Brent prices and support a narrowing of the WTI-Brent spread.It should help provide some relief for OPEC+, given the production cuts they have implemented and the planned unwinding of the voluntary reductions starting in October, for the following 12 months.Recent reports suggest OPEC+ crude exports declined in June versus May, but the latest official data showed steady exports from the Middle East and declining exports from Russia in May.If crude exports from OPEC - after accounting for changes in crude burns and refinery runs - are confirmed to have declined by somewhere between 3% and 4% in June, then that may point to greater compliance by OPEC members. However, that is still speculative.Russia's seaborne crude flows in the week to 23 June appear to have dropped by 0.66 million bpd, to the lowest in more than three months.The combined effect of lower crude exports from OPEC and Russia, right at the time when global refinery runs are expected to further rump up - from 83.1 million bpd in June to 84.4 in August - would explain the tighter crude market and the surge in Brent prices over the past three weeks.On macroeconomics, the latest data from the Bureau of Economic Analysis (BEA) showed that US inflation, measured by the personal consumption expenditures (CPE) index, eased further to 2.6% year on year in May, matching expectations. The core PCE, excluding food and fuel prices, also decreased to 2.6%, the lowest since March 2021.These figures are pivotal for the Federal Reserve's upcoming rate-setting decision on 31 July, with markets anticipating at least two quarter-point rate cuts this year, potentially starting in September. Despite the encouraging inflation data, a September cut remains uncertain as the pace of decline remains slow, which may be perceived as too gradual. On the political front, the US Presidential debate on Thursday night has dominated the airwaves.Early policy indications suggest either candidate would favour protectionist measures and large budget deficits if elected.This isn't good news for inflation, as both stances are inflationary.Energy-specific messaging was hard to identify in the debate, but it's safe to assume that a Trump administration would be pro-deregulation while Biden would continue to push policies aimed at advancing the green transition. In Europe, French President Emmanuel Macron's decision to call snap elections for the National Assembly backfired on Sunday as the National Rally party won by a significant margin in the first round of voting. Macron took a huge risk, but with the second round of voting this coming weekend, the exact fallout is still unclear.The second round of voting on 7 July will be pivotal for France's political stability and its leadership within the EU and the transatlantic community during this critical period. Read the latest issue of World Pipelines magazine for pipeline news, project stories, industry insight and technical articles. World Pipelines' June 2024 issue The June 2024 issue of World Pipelines includes a keynote section on hydrogen pipeline transport, in which Contributing Editor Gordon Cope offers a broad look at the global hydrogen pipeline market, and Atmos International discusses modelling pure hydrogen pipelines. Also in the issue: technical articles on subsea survey, pigging tool performance, HDD operations for the Trans Mountain Expansion project, and more. Read the article online at: https://www.worldpipelines.com/special-reports/02072024/rystad-energy-bullish-market-fundamentals-are-the-main-contributing-factor-to-higher-global-oil-prices/ You might also like The ADCC pipeline entered commercial service on July 1, 2024, and is capable of providing approximately 1.7 billion cubic feet per day of natural gas. Embed Embed article link: (copy the HTML code below): Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices xClose This content is available to registered readers of our magazine only. Please sign in or register for free. Benefits include Access to locked videos & articles Downloadable white papers Full website access Register for free >> Get started now for absolutely FREE, no credit card required. Already a member? Sign in here xClose Do you have the right tools to harness your data effectively? Join us on 17 July for a live webinar and Q&A session with dataPARC entitled 'Beyond ProcessBook & PI Vision: Exploring Today's Industrial Analytics Tools'. Register for FREE",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited",
    "Link": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmx1ZXByaW50Lm5nL2RhbmdvdGUtcmVmaW5lcnktY3J1ZGUtb2lsLXN1cHBseS1vcHRpb25zL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:23:30 GMT",
    "Categories": [
      "Production Updates",
      "Supply and Demand"
    ],
    "Content": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited Skip to content The international corporations drilling oil in Nigeria are the country's greatest enemies. They have never hidden their condescension for Nigeria even as they are allowed to operate the industry on their own terms. In fact, the IOCs are partially responsible for Nigeria's total dependence on imported refined petroleum products.The international oil companies (IOCs) are compelled to operate refineries in most of the countries they drill oil. In Nigeria they defiantly snubbed the federal government's directives that they should establish refineries. Their excuse was that no refinery could succeed in Nigeria because the federal government stands around to fix unacceptable pump prices for refined petroleum products.Aliko Dangote, president of the Dangote Group, and some development banks in the international money market came together to prove that the treacherous oil firms exploiting crude oil in Nigeria were telling transparent lies when they refused to establish refineries in Nigeria on the grounds that the pump prices of refined petroleum products were controlled by the federal government. The international money market advanced loans close to $9 billion to Dangote for the establishment of what is now acknowledged as one of the world's largest refineries.No one would advance such a colossal sum as a loan for a venture known to have no means of repaying the loan. The fact that the international development banks were willing to fund Dangote Refinery is a clear indication that the venture was viable and could not be bugged down by government regulation of the pump prices of refined petroleum products.The lies of the IOCs were exposed by the success in sourcing for funds to build a giant refinery in Nigeria.The mischievous oil firms were disgraced as their lies were exposed. They gnashed their teeth and proceeded to wait for Dangote and the Nigerian people down the road.The refinery they were determined to truncate came on stream in January 2024 and in apparent frustration they drew up fresh plans to sabotage the business of the refinery and keep Nigeria as a perpetual importer of refined petroleum products.They know that if Dangote Refinery succeeds, the refineries in Europe that were supplying refined petroleum products to Nigeria at a catastrophic cost of well over $20 billion annually could be out of businessThey decided to use the last weapon in their armoury to frustrate Dangote Refinery. They defiantly refused to sell crude oil to Dangote. Those who reluctantly offer to sell the feedstock put their price tag at $6 above what obtains in the international market.Consequently, Dangote has been compelled to import crude oil for his refinery from the United States of America (USA) when Nigeria remains the highest producer of crude oil in Africa.The treacherous international oil companies operating in Nigeria have finally held Dangote Refinery and the Nigerian people in the jugular.Diesel from Dangote Refinery is more expensive than the high sulfur diesels imported by independent petroleum marketers from Europe into Nigeria.The most painful aspect of the sabotage by the IOCs is that the regulator of the industry sees nothing wrong with collaborating with foreigners to frustrate a Nigerian venture designed to ease the merciless grip of European petroleum refiners on Nigerians.The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) apathetically issues licences to independent petroleum marketers to import diesel from Europe with a weak naira and torment Nigerian consumers with high energy cost that escalates the country's catastrophic inflationary trend.When newsmen confronted the agency on the illogicality of encouraging diesel imports when a Nigerian refinery is ready to supply, NMDPRA retorted that in a deregulated market, marketers are free to source diesel from anywhere.NMDPRA is the regulatory arm of the Nigerian National Petroleum Company Limited (NNPCL). The company is more or less an appendage of the mischievous international oil companies battling to protect the interest of European crude oil refiners patronised by NNPCL.NNPCL, as industry regulator, could order the deceitful IOCs to sell crude oil to Dangote Refinery at international market price. But it could only do so to the detriment of its own selfish interest.NNPCL would lose trillions of naira if Dangote Refinery gets crude oil from Nigeria and sells refined petroleum products locally at reduced pump prices.That would mean the end of the petrol subsidy scandal through which the company rakes in trillions of naira annually. That explains why NNPCL allows foreign exploiters to frustrate Dangote Refinery.NNPCL has unrestrained powers to supply crude oil to Dangote Refinery which at the moment is the only way to ease the asphyxiating hold of high energy cost on Nigeria's economy.If the treacherous IOCs defy NNPCL's directive to supply crude oil to Dangote Refinery at international market rate, the company could do the job by itself.NNPCL allocates 445,000 barrels of crude oil daily to Nigeria's moribund refineries. Nigeria's four refineries have not refined a barrel of crude oil in the last three years.Consequently, NNPCL exports the 445,000 barrels of crude oil daily to foreign refineries that feed Nigeria with refined petroleum products in return. If NNPCL reroutes the crude oil to Dangote Refinery, Nigeria would benefit extensively.The foreign refineries use the residue of the crude oil supplied by NNPCL for their petrochemical products and export them to Nigeria. If Dangote Refinery gets the crude oil, the residue would be used to produce resins that would be used to ease the escalating cost of producing plastic containers in the soft drink and brewery industries.Besides, NNPCL owes Dangote Refinery the sum of $1.7 billion as part of the 20 per cent equity it bought. It was expected to pay back with 300,000 barrels of crude oil daily. Its refusal to supply borders on betrayal of trust.It is rather saddening that Mele Kyari, the man who navigated NNPCL through the horrendous petrol subsidy scandal and crude oil theft, is still its group managing director. The man should do the right thing. WhatsApp Email LinkedIn Twitter Facebook Related Posts Saint Academy building collapse: Tears and lamentations not enough July 16, 2024July 16, 2024 Why Xi's works a key to decoding modern China and its global vision July 16, 2024July 16, 2024 Soyinka: The icon for whom apologies are unnecessary July 14, 2024July 14, 2024 About Jerry Uwah View all posts by Jerry Uwah →",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPC Declares State of Emergency on Crude Oil Production - News Diary",
    "Link": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vbmV3c2RpYXJ5b25saW5lLmNvbS9ubnBjLWRlY2xhcmVzLXN0YXRlLW9mLWVtZXJnZW5jeS1vbi1jcnVkZS1vaWwtcHJvZHVjdGlvbi_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:58:13 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPC Declares State of Emergency on Crude Oil Production News Diary Online Sign in HomeNewsWorldSportsAfricaSociety NewsArtVideosLIVE BLOGPoliticsBusinessAgricultureIndustryOil & GasTechnologySecurityDefenceCrime & PoliceAnti-GraftJudiciaryEagle EyeReportsEducationAnalysisExclusive ReportsPress Statements / ReleasesInterviewsProjectColumnsAdagbo OnojaAkintokunbo AdejumoAli M. AliAzu IshiekweneDan AgbeseDele AgekamehFemi AdesinaGarba ShehuHakeem Baba-AhmedIssa AremuJaye GaskiaJibrin IbrahimNasir El-RufaiReuben AbatiZainab Suleiman OkinoADVERT RATESAbout Us Sign in Welcome!Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search Tuesday, July 16, 2024 Home News World Sports Africa Society News Art Videos LIVE BLOG Politics Business Agriculture Industry Oil & Gas Technology Security Defence Crime & Police Anti-Graft Judiciary Eagle Eye Reports Education Analysis Exclusive Reports Press Statements / Releases Interviews Project Columns Adagbo Onoja Akintokunbo Adejumo Ali M. Ali Azu Ishiekwene Dan Agbese Dele Agekameh Femi Adesina Garba Shehu Hakeem Baba-Ahmed Issa Aremu Jaye Gaskia Jibrin Ibrahim Nasir El-Rufai Reuben Abati Zainab Suleiman Okino ADVERT RATES About Us Facebook Instagram Twitter Vimeo Youtube Home News World Sports Africa Society News Art Videos LIVE BLOG Politics Business Agriculture Industry Oil & Gas Technology Security Defence Crime & Police Anti-Graft Judiciary Eagle Eye Reports Education Analysis Exclusive Reports Press Statements / Releases Interviews Project Columns Adagbo Onoja Akintokunbo Adejumo Ali M. Ali Azu Ishiekwene Dan Agbese Dele Agekameh Femi Adesina Garba Shehu Hakeem Baba-Ahmed Issa Aremu Jaye Gaskia Jibrin Ibrahim Nasir El-Rufai Reuben Abati Zainab Suleiman Okino ADVERT RATES About Us Search Home Anti-corruption,Governance,Election Project NNPC Declares State of Emergency on Crude Oil Production Anti-corruption,Governance,Election ProjectBusinessOil & GasReports & CommentaryProject Facebook Twitter Pinterest WhatsApp ...Calls for Collaboration to Reduce Production Cost In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" Follow Us On WhatsApp Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. EDITOR PICKS FCT Police Command Bans, Warns Against Any Form of Protest By IMN July 15, 2024 Invite CIPSMN for Talks, House Committee Directs BPP July 15, 2024 ASUP gives ultimatum for suspension of scheme of service implementation July 15, 2024 ABOUT US Newsdiaryonline is Your Newspaper for Breaking News, Investigative Stories, Interviews and Viewpoints about Nigeria.We report Entertainment, Music, Fashion, Sports stories and provide you with the latest breaking news and videos as they emerge. Contact us: [email protected] FOLLOW US Facebook Instagram Linkedin Twitter (c) NewsDiary All Right Reserved. Designed By DeedsTech. NewsPoliticsBusinessSecurityHealthCrime & Police",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost - NNPC Ltd",
    "Link": "https://news.google.com/rss/articles/CBMijQFodHRwczovL25ucGNncm91cC5jb20vaW5zaWdodHMvbm5wYy1sdGQtZGVjbGFyZXMtc3RhdGUtb2YtZW1lcmdlbmN5LW9uLWNydWRlLW9pbC1wcm9kdWN0aW9uLWNhbGxzLWZvci1jb2xsYWJvcmF0aW9uLXRvLXJlZHVjZS1wcm9kdWN0aW9uLWNvc3TSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 15:54:36 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost Who we are Investors Sustainability Our Businesses Insights contact us JULY 2, 2024 NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost PRESS RELEASE In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners, and we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner.He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry.On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country.On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" Olufemi O. Soneye Chief Corporate Communications OfficerNNPC Ltd.Abuja. July 2 nd , 2024 GCEO, NNPC Ltd, Mallam Mele Kyari, delivers a Keynote Address at the second day of the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.GCEO, NNPC Ltd, Mallam Mele Kyari (standing 7 th from left) in a group photograph with participants at the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja. Other Posts News JULY 4, 2024 Nigeria's CNG Journey Has Commenced and is Irreversible, Says Kyari ...As NNPC Plans to Build Three L... News JULY 8, 2024 Logistics Challenges, Flooding Cause of Fuel Queues ...As NNPC, Stakeholders Vow To Restore Normalcy News JULY 5, 2024 NNPC/SPDC JV Committed to Impacting Lives Through Sustainable Development Projects ...Donates Ultra-M... Energy for Today, Energy for Tomorrow (c) 2024 NNPC Limited. Never miss out on what we're up to Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. NNPC Who we are Investors Contact Terms Of Use Privacy Policy Documents Careers SERVICES Upstream Downstream Gas & Power Non-Energy New Energy SOCIAL MEDIA X Facebook Instagram Linkedin Youtube Threads (c) 2024 NNPC Limited.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPCL declares state of emergency on crude oil production - Champion Newspapers",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY2hhbXBpb25uZXdzLmNvbS5uZy9ubnBjbC1kZWNsYXJlcy1zdGF0ZS1vZi1lbWVyZ2VuY3ktb24tY3J1ZGUtb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 00:09:15 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPCL declares state of emergency on crude oil production - Champion Newspapers LTD Champion Newspapers Limited For a better society The media gateway to the East. For inquiries: Phone: +234 81 8616 6160 Email: editor.championnews@gmail.com Likes Followers Followers NNPCL declares state of emergency on crude oil production .Calls for collaboration to reduce cost .FG determined to improve oil production, says Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC EnergyLatest News 42 Share UGO AMADI In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry. Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared. According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes. He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels. He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" However, with Nigeria's oil production lagging significantly behind OPEC oil production quota, the Minister for State Petroleum Resources (Oil), Senator Heineken Lokpobiri has expressed the Federal Government's determination to improve production in the coming months. The Minister stated this when he gave his ministerial address at the ongoing 2024 NOG week Lokpobiri emphasized Nigeria's commitment to increasing oil production, adding that while Nigeria \"is not in a rush to transition away from oil, the country is actively seeking to enhance its production capabilities\". According to him, \"We are focused on ramping up our oil production . When we came to office the president was concerned in increasing production in every way. I can confidently tell you that most of the deals like Seplat -ExxonMobil deal and other issues like Malabu deal are being resolved. He highlighted the benefits of the Petroleum Industry Act (PIA), which provides a robust legal framework that guarantees returns on investments and has significantly reshaped the oil and gas sector. \"The PIA ensures a secure and profitable investment climate, making Nigeria an attractive location for investors,\" he noted. .IPPG laments delays in concluding IOCs' divestment transactions The Independent Petroleum Producers Group (IPPG) has expressed concerns over the continuos delays in concluding ongoing divestment transactions by the international oil companies (IOCs). Chairman of IPPG, Mr. Abdulrazaq Isa, raised his members' concerns yesterday in Abuja at the ongoing Nigeria Oil and Gas (NOG) Energy Week 2024, with the theme: \"Showcasing Opportunities, Driving Investment and Meeting Energy Demand\". In his industry address at the event, Isa specifically said that the long-overdrawn delays in concluding the IOCs divestment deals were costly to the Nigerian petroleum industry and extremely detrimental to the country as a whole. He appreciated President Bola Tinubu for the transformative reforms being undertaken by his administratio, pointing out specifically that the recent presidential executive orders and directives were a welcome development for the industry. \"Also of note is His Excellency's direct intervention in untangling issues in some of the long-overdrawn IOC divestment transactions - these delays have been costly to the industry and extremely detrimental to the nation as a whole. \"We are encouraged to see swift progress on implementation and some tangible results within a relatively short period of time. \"Such progressive and impactful policies are exactly what the industry has consistently clamoured for to sustainably develop and move the industry forward\", Isa stated. Notwithstanding those laudable policies and the gradual positive turnarounds being experienced, he maintained that the industry was in dire need of extraordinary focus to mitigate the genuine concerns on its long-term sustainability. According to him, despite Nigeria's world class hydrocarbon resource base of over 37 billion barrels of proven crude oil reserves and 207 trillion cubic feet (tcf) and 600 tcf of proven and contingent gas reserves respectively, we find ourselves in a situation where our daily production has significantly dropped and lies at about 1.3 million barrels of oil and 8.5 bcf of gas today. He noted that the current oil and gas production was way below Nigeria's capacity as a nation. He added that by all globally acceptable standards, this reserves to production ratio was extremely low and a clear indicator that the industry was in a dire situation. In addition, Isa noted that \"we now run the risk of partial implementation of our national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. This trend in production, according to the IPPG chair, \"portends another frightening dimension when we consider that in the not-too-distant future, our overall installed domestic refining capacity, currently closing in on about 1.2 million barrels per day, may soon outstrip our current crude oil production level with the risk of Nigeria finding itself in a position where it is unable to meet its domestic refinery crude demand or even become a net importer of crude oil, God forbid! \"It is against this scary backdrop that IPPG is calling for urgent measures to be undertaken by all relevant stakeholders to immediately arrest this dwindling production level and under-investment by focusing on the following priority areas.\" On the first priority area, he called for immediate conclusion of all pending IOC divestment transactions. Isa posited that IPPG strongly advocates that their member companies such as Seplat, the Renaissance Consortium and Oando have the proven track record to successfully take over and manage those onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5bcf of gas per day within 24 months, and well over 500,000bpd in the long term. He maintained that IPPG believes the timely approval of these IOC divestment transactions would also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. On the second priority area, Isa stressed the urgent need to address deepwater development and production in Nigeria. He said untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, TotalEnergies, ExxonMobil and Chevron has the potential to unlock incremental production of 700,000 bpd from this terrain in the short to medium term. Isa stated, \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource base. \"Priority Area 3: The adoption of a national value-retention strategy: Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from our domestic crude oil and gas production in order to transform our country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we are able to meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability.\" On the fourth priority area, the IPPG boss called for the development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive. He stressed that Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed Liquefied Natural Gas (LNG) capacity and expanding production (FLNG). .We see energy demand rising by 23% by 2045 - OPEC Meanwhile, The Organisation of the Petroleum Exporting Countries (OPEC) says energy demand will rise by an estimated 23 per cent by 2025. OPEC says the rise will be fueled by a world economy that is expected to double in size, growing from $138 trillion dollars in 2023 to $270 trillion dollars in 2045. The OPEC Secretary-General, Haitham Al Ghais, made this known on Tuesday at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition, holding in Abuja. The conference, which holds from June 30 to July 4, has its theme as \"Showcasing Opportunities, Driving Investment, Meeting Energy Demand\". Addressing the Strategic Conference via teleconference, Al Ghais explained that it forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. \"This data tells us that the world will require all forms of energy to meet long-term energy needs. \"Oil and gas will remain the predominant fuels in the energy mix. \"In fact, oil alone will retain its share at almost 30 per cent in 2045 as world demand for oil soars to an estimated 116 million barrels per day (mb/d) by that time,\" he said. To meet this rapid and robust growth in energy consumption, he said the industry would need to boost investment levels significantly in the years to come. He said according to its research, cumulative oil-related investment requirements from 2024 until 2045 would amount to $14 trillion dollars or around $610 billion dollars on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons,\" he said. Al Ghais further emphasised that indeed, the rush to adopt \"Net-Zero\" strategies was misguided and simply not realistic. The OPEC Secretary General said that developing countries would continue to balance priorities between developing their national economies and addressing climate change. In this regard, he pledged that OPEC and its member countries would continue to advocate for a fair process for adaptation, mitigation and means of implementation, with regard to climate finance and technology. He decried the fact that there were an estimated 675 million people with no access to basic forms of energy and 2.3 billion without access to clean cooking fuels. He tasked World leaders to unite and advocate for the necessary support and resources to make a difference in addressing this important matter. \"Looking ahead, OPEC will continue to enhance dialogue and cooperation with all of its energy partners, including in Africa,\" Al Ghais said. The Secretary-General, while commending President Bola Tinubu, appreciated Nigeria's staunch commitment to OPEC and to the Declaration of Cooperation. Continue Reading .Calls for collaboration to reduce cost .FG determined to improve oil productionNNPCLoilsays Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC 42 Share FacebookTwitterWhatsAppTelegram Editor 20983 posts 0 comments Prev Post 24th Milo Basketball Nat'l Championship, held in Lagos Next Post NOG: Enact enforceable local content laws to build capacity - Nestoil Limited You might also like More from author Latest News Set to flood market with petrol, Aliko says electric cars, renewable energy not... Energy SPE-NAICE 2024 to focus on midstream, downstream development Energy NEITI tasks FG on implementation of panel's report on oil theft, vandalism as... Latest News UAE lifts Visa ban on Nigerians - FG Prev Next Comments are closed. More Stories Set to flood market with petrol, Aliko says electric cars,... Jul 16, 2024 SPE-NAICE 2024 to focus on midstream, downstream development Jul 16, 2024 NEITI tasks FG on implementation of panel's report on... Jul 16, 2024 UAE lifts Visa ban on Nigerians - FG Jul 16, 2024 Prev Next 1 of 2,847 You cannot print contents of this website. Sign in Welcome, Login to your account. Login with Facebook Google Twitter Or Forget password? Remember me Sign in Recover your password. A password will be e-mailed to you.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L09QRUMtY3J1ZGUtb2lsLXByb2R1Y3Rpb24tcmVtYWlucy1zdGVhZHktZm9yLXRoaXJkLW1vbnRoLWR1ZS10by1JcmFxLVVBRS1ub24tY29tcGxpYW5jZdIBeWh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9PUEVDLWNydWRlLW9pbC1wcm9kdWN0aW9uLXJlbWFpbnMtc3RlYWR5LWZvci10aGlyZC1tb250aC1kdWUtdG8tSXJhcS1VQUUtbm9uLWNvbXBsaWFuY2U?oc=5",
    "Published": "Tue, 02 Jul 2024 10:04:38 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News Breaking News Trump to announce vice presidential pick soon Syrian businessman Mohammad Katerji killed in Israeli drone strike near Lebanon's border Human rights groups urge new Iranian president to halt lethal force against border porters Al-Hassan succeeds Plasschaert as UNAMI head in Iraq 2024-07-02T09:48:13+00:00 Share font Enable Reading Mode A- A A+ Shafaq News/ OPEC's crude oil production held steady for the third consecutive month as Iraq and the UAE failed to fully implement the agreed-upon cuts, according to a Bloomberg survey. The Organization of the Petroleum Exporting Countries produced an average of 26.98 million barrels per day in June, marking a decrease of 80,000 barrels per day from the previous month. This slight reduction was attributed to minor cuts in production from Iraq and Nigeria. The survey indicated that Iraq and the UAE did not fully comply with the cuts agreed upon at the beginning of the year with other OPEC members. Additionally, Baghdad was unable to implement the extra production cut it had pledged to compensate for previous overproduction levels. To push crude oil prices higher, the OPEC alliance may need to enforce the committed cuts fully. However, efforts to enhance compliance have shown limited results. In June, Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day. This reduction in exports brought the country closer to its assigned quota, but its production still exceeded the quota by approximately 250,000 barrels per day, even without considering additional \"compensatory cuts.\" Related News Bloomberg: Iraq reduced its oil production by 130,000 bpd Iraq boosts oil output by 40,000 bpd in May following OPEC decision Basrah crudes surge following global oil rise Basrah crudes surge despite global oil decline Kirkuk oil production surges to over 360,000 bpd EIA reports surge in Iraqi oil exports to the US Shafaq Live Shafaq Live English English Radio facebook Shafaq news english",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Exclusive-Russia restoring oil refining capacity knocked out by drones - Yahoo News Australia",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2F1Lm5ld3MueWFob28uY29tL2V4Y2x1c2l2ZS1ydXNzaWEtcmVzdG9yaW5nLW9pbC1yZWZpbmluZy0xMjAwMTM2NzcuaHRtbD9zZXpuYW1fcT0wJm5vX2NvbW1lcmNlPTEmdXRtX3NvdXJjZT13d3cuc2V6bmFtLmN6JnV0bV9tZWRpdW09c2VrY2Utei1pbnRlcm5ldHXSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 01:50:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": "Exclusive-Russia restoring oil refining capacity knocked out by drones Advertisement Close this content Read full article Reuters 15 April 2024 at 4:00 pm·2-min read Link copied The logo of Taneco are seen on tanks at its refinery complex, which is part of Russia's oil producer Tatneft group of companies, in Nizhnekamskin MOSCOW (Reuters) - Russia has been able to swiftly repair some of key oil refineries hit by Ukrainian drones, reducing capacity idled by the attacks to about 10% from almost 14% at the end of March, Reuters calculations showed.Ukraine stepped up drone attacks on Russian energy infrastructure since the start of the year, hitting some major oil refineries across the world's second largest oil exporter in attacks that sent up oil prices.Russia says the drone attacks amount to terrorism. Ukraine says its drone attacks on Russia are justified because it is fighting for survival as Russia has made \"massive retaliatory\" strikes on Ukrainian energy infrastructure.There have been no reports of successful attacks on Russian large refineries since the Taneco plant was hit on April 2.Russia is repairing its refineries fast, despite difficulties in obtaining Western know-how.That includes Rosneft-owned Ryazan plant, which put back he CDU-4 and main CDU-6 primary oil refining units into operation, as well as Kuibyshev refinery repairing CDU-4 and Syzran's CDU-5 and previously idled for maintenance CDU-6.According to Reuters calculations, total Russian primary oil refining capacity, idled by drones, was reduced to 90,500 metric tons per day (660,000 barrels per day) from around 123,800 tons per day (907,000 bpd) previously.However, in total, Russia's cumulative primary oil refining capacity, put offline due to various outages and maintenances, is expected at 4.4 million tons in April, up from 4.1 million tons in March.The respite in Ukraine's strikes comes after criticism from the United States, the world's top energy consumer, where high fuel prices is high up on the agenda in the run up to presidential election on Nov. 5.Replying to Republican U.S. Senator Tom Cotton on why Joe Biden administration was discouraging Ukrainians from the attacks on Russia's \"war-making capabilities\", Defence Secretary Lloyd Austin told the Senate Armed Services committee last week that the attacks could harm global energy markets.\"Certainly, those attacks could have a knock-on effect in terms of the global energy situation, and ... but quite frankly, I think Ukraine is better served by going after tactical and operational targets that can directly influence the current fight,\" he said.(Reporting by Reuters; writing by Vladimir Soldatkin; editing by Guy Faulconbridge and David Evans) Up next Up next Up next Up next Latest stories HuffPost Trump Tells Reporter What He 'Wasn't Expecting' After Assassination AttemptThe former president also detailed a \"little problem\" he's had since the shooting. HuffPost Mary Trump Reacts To Assassination Attempt On Her Uncle\"It has been a surreal 24 hours,\" Donald Trump's niece said. HuffPost Melania Trump Gives Rare Statement After Donald Trump's Rally ShootingThe former first lady spoke out after former President Donald Trump was wounded in a shooting at a campaign event the previous evening. The Independent MTG faces calls to resign after wild statement on Trump shooting: 'Democrats are the party of pedophiles''We are in a battle between GOOD and EVIL,' Greene writes as she blames shooting on the Democrats HuffPost Kid Rock Shares Profane 8-Word Message After Trump ShootingThe right-wing singer was among several artists who commented publicly on the assassination attempt. The Independent Trump rally shooting witness says he saw rifle-toting man 'crawling up the roof' before Secret Service 'blew his head off'Trump's Saturday evening rally descended into chaos when a gunman opened fire before he was 'neutralized' by Secret Service sniper HuffPost Judge Dismisses Trump's Classified Documents IndictmentJudge Aileen Cannon ruled that the appointment of special counsel Jack Smith was unconstitutional. The Independent What we know about gunman Thomas Matthew Crooks who shot at Trump at his Pennsylvania rallyFBI investigating shooting as a potential act of domestic terrorism even as gunman's motive remains elusive The Daily Beast Secret Service in Crisis: Used Local Cops at Trump RallyIt's been the question on everyone's mind since Donald Trump narrowly escaped death in an assassination attempt Saturday night: How, exactly, was a 20-year-old rifleman able to perch himself on a rooftop just 150 yards away from the former president during a rally?It turns out, the Secret Service's over reliance on Pennsylvania cops may be partially to blame, with a report from The Washington Post revealing Sunday the agency punted the responsibility of surveying and securing some nearby structu The Hill Ocasio-Cortez rips House Democrat over anonymous quote: 'You should absolutely retire'Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday sharply criticized an anonymous \"senior Democrat\" who was quoted saying the party was \"resigned\" to another four years under former President Trump. Ocasio-Cortez, in a post on the social platform X, said Democratic members who feel that way should \"absolutely retire\" from their positions in Congress. \"If you're a... The Independent Ukraine-Russia war - live: Last Russian naval patrol ship leaves Crimea in big win for Kyiv's drone campaignKyiv has destroyed or damaged 27 Russian naval vessels since the invasion began Evening Standard OPINION - Trump shooting was an attack on democracy itself - and makes it more likely than ever he'll be re-electedThe prospect of his return to the White House makes me shudder, and I'm baffled that one of the most vibrant democracies in the world can't seem to stop him. Up went the fist, unleashing an iconic image that will stick with all of us, and reverberate loudly through polling day, a survivor, fighter, statesman capturing the moment. BuzzFeed 22 Latino Voters Are Confessing Who They're Supporting For President, And It's Truly Revealing\"As a Latina, my top political concerns are every single thing in Project 2025. It's like they looked at everything on the liberal and leftist agenda and just said, 'Let's do the opposite.'\" The Independent Ukraine-Russia war live: Two dead in Putin 'double tap' missile attack that hits railway station near KharkivUkraine's president Volodymyr Zelensky visited Ireland on the way back from the Nato summit in Washington HuffPost 4 Things You Should Know About JD Vance, Trump's Pick For Vice PresidentThe Ohio senator has taken up Trump's cause with the zeal of a convert. BuzzFeed Following The Trump Assassination Attempt, People Are Pointing Out The Double Standards Of The Republican Party\"I would like to formally extend Republicans the same courtesy they show Democrats whenever there is a shooting. So please accept: My thoughts and prayers.\" The Daily Beast Local Cop Confronted Trump Gunman Before Shooting-but Backed AwayA local police officer nearly confronted the shooter who trained his rifle on former President Donald Trump on Saturday-until the shooter aimed his gun at the officer first.According to the Associated Press, rallygoers alerted officers to a man climbing up to the roof of a building close to the rally venue. An officer eventually went to confront the shooter, later identified as 20-year-old Thomas Crooks, but he backed away after Crooks trained his gun on him, according to the AP.Crooks then quic HuffPost Trump Speaks Out After Shooting, Reveals 'Whole Different' Angle To RNC SpeechThe former president explained how his speech this week will be \"a lot different\" after he survived an assassination attempt. Deadline Tim Robbins Condemns Those Comparing Trump Assassination Attempt To 'Bob Roberts': \"Deranged Mindset\"Actor-director Tim Robbins is calling out the conspiracy theories following the assassination attempt on Donald Trump, including that it was a staged event akin to a plot point in his 1992 movie Bob Roberts. Robbins wrote on X/Twitter, \"To anyone drawing a parallel between my film Bob Roberts and the attempted assassination of Trump, let's ... South China Morning Post South China Sea clash raises stakes even higher as scepticism surrounds Manilla talksThe recent clash in the South China Sea - one of the most intense skirmishes in recent memory - revealed the fragility of peace in this volatile region. Following the incident, officials from China and the Philippines convened in Manila, striving to navigate their stark maritime disagreements over this strategic and highly-valuable global shipping route. The discussions centred on managing the precarious situation at the Second Thomas Shoal, with both sides pledging to sustain dialogue and consultation to control disputes and differences. More stories",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions - Via News Agency",
    "Link": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdmlhLm5ld3MvbWFya2V0L25hdHVyYWwtZ2FzLWZ1dHVyZXMtYmVhcmlzaC0xOC1pbi1sYXN0LTIxLXNlc3Npb25zLTMv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:57:30 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions Skip to content Headlines Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 42 mins ago Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions 2 hours ago Nikkei 225 Rises By 6% In The Last 21 Sessions 5 hours ago Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio 6 hours ago Ameresco And 4 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 6 hours ago MFS Intermediate High Income Fund, Flaherty & Crumrine, Another 5 Companies Have A High Estimated Dividend Yield 6 hours ago HomeMarketNatural Gas Futures Bearish By 18% In The Last 21 Sessions (VIANEWS) - Natural Gas (NG) has been up by 18.78% for the last 21 sessions. At 14:52 EST on Wednesday, 3 July, Natural Gas (NG) is $2.42. Volume Today's last reported volume for Natural Gas is 116783, 99.99% below its average volume of 3235533847.76. Volatility Natural Gas's last week, last month's, and last quarter's current intraday variation average was a negative 1.89%, a negative 0.47%, and a positive 3.46%, respectively. Natural Gas's highest amplitude of average volatility was 4.77% (last week), 5.08% (last month), and 3.46% (last quarter), respectively. Commodity Price Classification According to the stochastic oscillator, a useful indicator of overbought and oversold conditions, Natural Gas's commodity is considered to be overbought (>=80). Previous days news about Natural Gas (NG) Natural gas sinks to pivotal level as China's demand slumps. According to FXStreet on Monday, 1 July, \"The move comes on the back of China cutting its Liquified Natural Gas (LNG) imports after prices rose above $3.0 in June. \" Natural gas in distress with selloff adding another leg. According to FXStreet on Tuesday, 2 July, \"Over 15% in value has already evaporated since June 25th, and more downturns could be at hand as a US judge in Louisiana issued a ruling on Monday to lift the current ban on new export licenses for Liquified Natural Gas (LNG). \" More news about Natural Gas (NG). Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Related News Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity Via News Editorial Team42 mins ago 0 Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions Via News Editorial Team2 hours ago 0 Nikkei 225 Rises By 6% In The Last 21 Sessions Via News Editorial Team5 hours ago 0 Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio Via News Editorial Team6 hours ago 0",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360",
    "Link": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnR2MzYwbmlnZXJpYS5jb20vb3BlYy1nbG9iYWwtY3J1ZGUtb2lsLWRlbWFuZC13aWxsLXJpc2UtdG8tMTE2bS1icGQtaW4tMjA0NS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:19:54 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360 Nigeria The Organisation of the Petroleum Exporting Countries (OPEC) says world demand for oil is projected to rise to an estimated 116 million barrels per day (bpd) in 2045. Haitham Al Ghais, OPEC secretary-general, spoke on Tuesday in Abuja at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition. The conference is themed 'Showcasing Opportunities, Driving Investment, Meeting Energy Demand'. Addressing the conference via teleconference, Al Ghais said the world economy is expected to double in size - growing from $138 trillion in 2023 to $270 trillion in 2045. He explained that the oil cartel forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook,\" he said. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. Al Ghais said in the upcoming years, the industry will need to significantly increase investment levels in order to keep up with the rapid and robust growth in energy consumption. He said according to its research, the total oil-related investment requirements between 2024 and 2045 would be $14 trillion or about $610 billion on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility,\" Al Ghais said. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons.\" Al Ghais pledged that OPEC and its member countries would keep pushing to advocate for a fair process for adaptation, mitigation and means of implementation with regard to climate finance and technology. The secretary-general said an estimated 675 million people lack access to basic forms of energy and 2.3 billion without access to clean cooking fuels. Al Ghais, while commending President Bola Tinubu, appreciated Nigeria's unwavering commitment to OPEC and the declaration of cooperation (DoC). Share this: Opeyemi Owoseni2 weeks ago 0 13 1 minute read Share Facebook X LinkedIn Tumblr Pinterest Reddit VKontakte Skype Messenger Messenger Share via Email Print Opeyemi Owoseni Related Articles Dangote set for production as crude supply hits 6million barrels January 9, 2024 Nigeria's oil sells at about $92 a barrel, $14 higher than FG budget benchmark April 3, 2024 Access Bank Loses CEO, Others in California Helicopter Crash February 10, 2024 Reps to Probe 'Mass Retrenchment' of CBN Workers May 30, 2024 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Check Also Close Business Tinubu appoints Agara DG NDE 3 days ago Facebook X WhatsApp Telegram Close Search for",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "India’s crude oil imports from Russia at 12-month high in June - BusinessLine",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnRoZWhpbmR1YnVzaW5lc3NsaW5lLmNvbS9uZXdzL2luZGlhcy1jcnVkZS1vaWwtaW1wb3J0cy1mcm9tLXJ1c3NpYS1hdC0xMi1tb250aC1oaWdoLWluLWp1bmUvYXJ0aWNsZTY4MzU4NTY1LmVjZdIBgAFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vbmV3cy9pbmRpYXMtY3J1ZGUtb2lsLWltcG9ydHMtZnJvbS1ydXNzaWEtYXQtMTItbW9udGgtaGlnaC1pbi1qdW5lL2FydGljbGU2ODM1ODU2NS5lY2UvYW1wLw?oc=5",
    "Published": "Tue, 02 Jul 2024 08:15:37 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "India's crude oil imports from Russia at 12-month high in June - The Hindu BusinessLine India's crude oil imports from Russia at 12-month high in June Updated - July 02, 2024 at 10:19 PM. Crude oil imports from Russia up by 15 per cent month-on-month, 2 per cent year-on-year By Rishi Ranjan Kala Comments Share Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit READ LATER Remove See All India's crude oil imports from Russia rose to 1.97 million barrels per day (mbpd) during June 2024, the highest since July 2023, largely due to lower cargoes to China.According to data from energy intelligence firm Vortexa, imports from Russia were up by almost 15 per cent month-on-month and 2 per cent on an annual basis. Data shows that both public and private sector refiners continued to import in record quantities from Russia.Public refiners such as Indian Oil Corporation (IOCL), Bharat Petroleum Corporation (BPCL) and Hindustan Petroleum Corporation (HPCL) imported 1.10 mbpd crude oil, which is also a 12-month high. The cargoes last month were higher by 6 per cent M-o-M. However, imports were down by almost 11 per cent on an annual basis. During May-July 2023, public refiners imported more than 1.2 mbpd on a monthly basis from Russia.Private refiners Reliance Industries (RIL) and Rosneft-backed Nayara Energy imported a record 871,200 barrels per day (bpd) from Russia in June 2024. The cargoes were higher by 28 per cent M-o-M and 20 per cent Y-o-Y. Also read Crude oil up as market expects demand boost during US travel season Consumption of transport fuels declines in June, after May's record high End of petrodollar? We wouldn't hold our breath Vortexa's head of APAC analysis Serena Huang told businessline , \"India's imports of Russian crude at 1.97 mbpd in June 2024 is the highest since last July. China's lower appetite of Russian crude has led to more barrels heading to India.\" Import momentum India's crude imports have remained robust at 4.62 mbpd in June, Huang said. \"We expect the country's crude imports to remain robust, with downside risks from softer refining margins due to slowing global oil demand,\" she added. While Indian refiners procured more barrels from Russia, cargoes from traditional suppliers in West Asia, such as Iraq and Saudi Arabia, declined.Crude oil imports from India's second largest supplier, Iraq, fell by 20 per cent M-o-M and by 3.5 per cent Y-o-Y to roughly 754,000 bpd in June 2024. The decline was steeper in in-bound shipments from Saudi Arabia at 36 per cent M-o-M and 46 per cent Y-o-Y to around 387,000 bpd. Some trade sources said that the higher official selling price (OSP) of its flagship medium sour grade Arab Light in June could have been a reason for the lower cargoes. Crude oil shipments from the US continued to rise for the second consecutive month in June 2024. India imported roughly 331,000 bpd from the US last month, compared to around 224,000 bpd in May 2024 and 112,000 bpd in April. Trade sources said the imports were of light sweet grade due to weak market fundamentals amid refinery outages in Europe. Comments SHARE Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit Published on July 2, 2024 Related Topics CRUDE OIL imports Russia You might also likeYou might also like Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per monthAccess to comment on every storySign up/Manage to our newslettersGet notified by email for early preview to new features, discounts & offers x Looks like you are already logged in from more than 3 devices! To continue logging in, remove at least one device from the below list Log outLog Out from all devicesTerms & conditions | ${ ind + 1 } ${ device }Last active - ${ la }",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes – Cores - XM",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnhtLmNvbS9yZXNlYXJjaC9tYXJrZXRzL2FsbE5ld3MvcmV1dGVycy9zcGFpbi1tYXktY3J1ZGUtb2lsLWltcG9ydHMtcmlzZS0yMzUteXktdG8tNTktbWxuLXRvbm5lcy1jb3Jlcy01Mzg3MzEyMdIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 08:19:44 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Forex, Crypto CFDs, Commodities and Stocks - 10+ Trading Platforms - 1000+ Instruments Open an Account Here Support How can we help? Choose how you'd prefer to receive support. Live Chat Live Chat Terms By using our LiveChat, you agree that any personal data provided via LiveChat will be processed by us, as per our Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat WhatsApp How to Access Scan the QR code below to start speaking with us from your smartphone or open Whatsapp on your desktop. WhatsApp Chat Terms By using the WhatsApp chat feature, you agree that any personal data provided to XM Global Limited by you through WhatsApp will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Line How to Access Scan the QR code below with your smartphone Line Chat Terms By using the Line chat feature, you agree that any personal data provided to XM Global Limited by you through Line will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Viber How to Access Scan the QR code below with your smartphone Viber Chat Terms By using the Viber chat feature, you agree that any personal data provided to XM Global Limited by you through Viber will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Telegram How to Access Scan the QR code below with your smartphone Telegram Chat Terms By using the Telegram chat feature, you agree that any personal data provided to XM Global Limited by you through Telegram will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Help Center Reuters Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Jul 3, 2024 at 8:19 am GMT <html xmlns=\"http://www.w3.org/1999/xhtml\"><head><title>BRIEF-Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores</title></head><body>July 3 (Reuters) -Cores: SPAIN MAY CRUDE OIL IMPORTS RISE 23.5% Y/Y TO 5.9 MILLION TONNES Source text: https://tinyurl.com/mvc2mjwb (Gdansk Newsroom)</body></html> Latest News View All Reuters - 26 minutes ago Richemont says quarterly sales up 1% at constant exchange rates B R S Reuters - 28 minutes ago French and Benelux stocks-Factors to watch E L S S F N U Reuters - 32 minutes ago Kazakhstan expects to tranship more Turkmen, Uzbek gas to China in 2024 Reuters - 39 minutes ago Dollar wobbles as comments of Fed's Powell put focus on Sept rate cut A E E G N U B Reuters - 45 minutes ago Nokia Oyj <NOKIA.HE> expected to post earnings of 6 cents a share - Earnings Preview N Disclaimer: The XM Group entities provide execution-only service and access to our Online Trading Facility, permitting a person to view and/or use the content available on or via the website, is not intended to change or expand on this, nor does it change or expand on this. Such access and use are always subject to: (i) Terms and Conditions; (ii) Risk Warnings; and (iii) Full Disclaimer. Such content is therefore provided as no more than general information. Particularly, please be aware that the contents of our Online Trading Facility are neither a solicitation, nor an offer to enter any transactions on the financial markets. Trading on any financial market involves a significant level of risk to your capital.All material published on our Online Trading Facility is intended for educational/informational purposes only, and does not contain - nor should it be considered as containing - financial, investment tax or trading advice and recommendations; or a record of our trading prices; or an offer of, or solicitation for, a transaction in any financial instruments; or unsolicited financial promotions to you.Any third-party content, as well as content prepared by XM, such as: opinions, news, research, analyses, prices and other information or links to third-party sites contained on this website are provided on an \"as-is\" basis, as general market commentary, and do not constitute investment advice. To the extent that any content is construed as investment research, you must note and accept that the content was not intended to and has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such, it would be considered as marketing communication under the relevant laws and regulations. Please ensure that you have read and understood our Notification on Non-Independent Investment. Research and Risk Warning concerning the foregoing information, which can be accessed here. We respect your privacy We use cookies to ensure the best possible browsing experience. Some are needed for essential features like login sessions, while others help us provide you with content and marketing more closely tailored to your needs. Accepting all cookies enables us to enhance your experience further. Please note, some of these may be third-party cookies. You can modify your cookie preferences by clicking the button below. For more information, please see our Cookie Policy. MODIFY PREFERENCES ACCEPT ALL Your cookie settings What are Cookies? Why are cookies useful? Change Settings What are Cookies? Cookies are small data files. When you visit a website, the website sends the cookie to your computer. Your computer stores it in a file located inside your web browser. Cookies do not transfer viruses or malware to your computer. Because the data in a cookie does not change when it travels back and forth, it has no way to affect how your computer runs, but they act more like logs (i.e. they record user activity and remember stateful information) and they get updated every time you visit a website. We may obtain information about you by accessing cookies, sent by our website. Different types of cookies keep track of different activities. For example, session cookies are used only when a person is actively navigating a website. Once you leave the website, the session cookie disappears. ENABLE ALL COOKIES AND CLOSE Why are cookies useful? We use functional cookies to analyse how visitors use our website, as well as track and improve our website's performance and function. This allows us to provide a high-quality customer experience by quickly identifying and fixing any issues that may arise. For example, we might use cookies to keep track of which website pages are most popular and which method of linking between website pages is most effective. The latter also helps us to track if you were referred to us by another website and improve our future advertising campaigns. Another use of cookies is to store your log in sessions, meaning that when you log in to the Members Area to deposit funds, a \"session cookie\" is set so that the website remembers that you have already logged in. If the website did not set this cookie, you will be asked for your login and password on each new page as you progress through the funding process. In addition, functional cookies, for example, are used to allow us to remember your preferences and identify you as a user, ensure your information is secure and operate more reliably and efficiently. For example, cookies save you the trouble of typing in your username every time you access our trading platform, and recall your preferences, such as which language you wish to see when you log in. Here is an overview of some of the functions our cookies provide us with: Verifying your identity and detecting the country you are currently visiting from Checking browser type and device Tracking which site the user was referred from Allowing third parties to customize content accordingly This website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses analytical cookies placed on your computer, to help the website analyze a user's use of the website. The information generated by the cookie about your use of the website (including your IP address) may be transmitted to and stored by Google on their servers. Google may use this information to evaluate your use of the website, to compile reports on website activity and to provide other services related to website activity and internet usage. Google may also transfer this information to third parties, where required to do so by law, or where such third parties process the information on behalf of Google. Google will not associate your IP address with any other data held. By using this website, you give your consent to Google to process data about you in the manner and for the purposes set out above. ENABLE ALL COOKIES AND CLOSE Change Settings Please select which types of cookies you want to be stored on your device. Functional cookies These cookies are essential for the running of our website. Without these cookies our websites would not function properly. These are saved temporarily as login information and expire once the browser is closed. Analytical cookies The information provided by analytical cookies allows us to analyse patterns of visitor behaviour and we use that information to enhance the overall experience or identify areas of the website which may require maintenance. The information is anonymous (i.e. it cannot be used to identify you and does not contain personal information such as your name and email address) and it is only used for statistical purposes. Behavioral cookies are similar to analytical and remember that you have visited a website and use that information to provide you with content which is tailored to your interests. Promotional cookies These cookies are used to track visitors across websites. The intention is to display ads that are relevant and engaging for the individual user and thereby more valuable for publishers and third party advertisers. Preferences cookies Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. ENABLE ALL COOKIES AND CLOSE SAVE SETTINGS AND CLOSE We are using cookies to give you the best experience on our website. Read more or change your cookie settings. ACCEPT ALL COOKIES Risk Warning: Your capital is at risk. Leveraged products may not be suitable for everyone. Please consider our Risk Disclosure. XM Live Chat Please enter your contact information. If you already have an XM account, please state your account ID so that our support team can provide you with the best service possible. Existing Client New Client * First Name * Last Name * E-mail * Language Start chat * First Name * Last Name * E-mail * Language Start chat",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  }
]