[
  {
    "Title": "China’s oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia — report - The North Africa Post",
    "Link": "https://news.google.com/rss/articles/CBMigwFodHRwczovL25vcnRoYWZyaWNhcG9zdC5jb20vNzg3NzktY2hpbmFzLW9pbC1pbXBvcnRzLWZyb20tYWZyaWNhLXBsdW5nZS1hbWlkLXNoaWZ0LXRvLXN1cHBsaWVycy1pbi1ndWxmLWFzaWEtYW5kLXJ1c3NpYS1yZXBvcnQuaHRtbNIBAA?oc=5",
    "Published": "Tue, 16 Jul 2024 09:42:36 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report - The North Africa Post The North Africa Post HomeHeadlines Algeria Egypt Libya Mauritania Morocco Tunisia Business Emerging Markets Finance EnergyInternational Africa Americas Asia Europe Opinions Columns Editorials Letters to the Editor Op Eds Profile Interview Portrait Lifestyle Culture Eating out Technology Community Blogs Comments Videos HomeHeadlinesInternational China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report North Africa PostJuly 16, 2024 10:42 am Africa once accounted for more than a third of Chinese oil imports, but now major African oil suppliers are struggling with declining production and exports to China that has found other markets due to geopolitical considerations, infrastructure issues, and domestic political problems, according to a recent report by the Carnegie Endowment for International Peace. China used to import more than a third of its oil supplies from Africa but by 2022, that figure had dropped to about one-tenth, according to the Observatory of Economic Complexity (OEC), an online data platform. According to Carnegie's report entitled 'How Is China's Economic Transition Affecting its Relations with Africa?', between 2019 and 2023, there were dramatic increases in China's imports of oil from Malaysia (408%), the UAE (254%), Kazakhstan (214%) and Kuwait (41%). By contrast, during the same period, all eight major African oil producers, except Chad, earned much less than they did before the pandemic, according to the report. Angola has fallen down the list from being China's No. 2 source of crude oil a decade ago to the eighth place in the ranking today. The sharp declines in China's oil imports from Angola, but also South Sudan (77%), Sudan (67%) and Nigeria (61%), for example, have been due to a number of factors, observers say, including geopolitical considerations, lack of investment in equipment and new oil fields and domestic political problems. As China's oil imports from Africa decline, it is increasingly turning to the more predictable production infrastructure of the Gulf countries and Russia and other Asian countries, according to the report from the Washington-based think tank. CATEGORIES AfricaAsiaBusinessEnergyHeadlinesInternational Share This AUTHORNorth Africa Post North Africa Post's news desk is composed of journalists and editors, who are constantly working to provide new and accurate stories to NAP readers. NEWER POSTMorocco's farming sector to the test of drought OLDER POSTMorocco donates 9 high-voltage generators to Niger, confirming its African solidarity Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies 3rd Party Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. 3rd Party Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Please enable Strictly Necessary Cookies first so that we can save your preferences! Enable All Save Settings We'd like to show you notifications for the latest news and updates. AllowCancel",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil Price Update – Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulse",
    "Link": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm1hcmtldHB1bHNlLmNvbS9mdW5kYW1lbnRhbC9vaWwtcHJpY2UtdXBkYXRlLW9pbC1wcmljZXMtaG9sZC1maXJtLWFzLWNoaW5lc2UtZGVtYW5kLWNvbmNlcm5zLXJpc2UvenZhd2Rh0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 10:50:26 GMT",
    "Categories": [
      "Market Trends",
      "Supply and Demand"
    ],
    "Content": "Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulseMarketPulse Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulse Home/Commodities/Fundamental/News events/Oil/Technical analysis/TradingView/USD Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise July 15, 2024 Share Print 0 Oil prices remain stable despite a turbulent weekend and a strong US dollar. Chinese economic data, including disappointing GDP growth and declining refinery output, raises concerns about oil demand. The focus shifts from supply concerns in the US to demand worries in China. Technical analysis suggests potential for a triple bottom pattern in oil prices, with key support and resistance levels identified. Most Read: The Week Ahead - ECB Spotlight as Fed Rate Speculations Drive Market Shifts Oil prices remained resilient this morning following a turbulent weekend. An attack on US Presidential hopeful Donald Trump has seen the US Dollar start the week on the front foot but Oil prices have held firm. Data out of China this morning stoked fears around demand once more, something which market participants had hoped was in the rearview mirror. The overall fundamental picture remains largely positive but demand concerns may hamper any further gains in the short-term. Chinese Data China's GDP data released this morning was disappointing as sluggish domestic demand bites. The data prompted several investment banks to lower their GDP forecasts. GDP growth slowed to 0.7% quarter-on-quarter (q/q) seasonally adjusted (SA) in Q2, down from 1.6% q/q in Q1 and below market expectations of 0.9%, impacted by slower retail sales growth. Domestic demand and consumer confidence remain weak, with the NBS also attributing the slowdown to extreme weather events and flooding. Although industrial output growth is cooling, it exceeded market expectations, highlighting the uneven nature of China's recovery. Strong exports are supporting manufacturing activity, with shipments rising 8.6% year-on-year (y/y) in June, up from 7.6% in May. The secondary industry, which includes manufacturing and construction, grew by 5.6% y/y in Q2, down from 6.0% in Q1, while the tertiary industry, or services, increased by 4.2%, down from 5.0%. Chinese GDP Q2 YoY Source: LSEG (click to enlarge) Chinese refinery output declined for the third consecutive month due to planned maintenance and weak fuel demand, leading independent plants to reduce production. Output for the first half of the year was down 0.4% compared to the same period last year, indicating a sluggish economic recovery and reduced processing profits for refineries. Crude oil imports for the month of June dropped 11% while H1 imports were down 2.3% YoY. According to the IEA the Chinese share of global oil demand growth is declining to 40% this year from last year's 70%. This decline in China has reignited worries about demand, a notable shift from the past two weeks where supply concerns were prevalent in the US. The Week Ahead Oil inventory data is very important as the US and Europe are currently in the middle of summer. This period is typically the peak driving season in the US, leading to high demand for petroleum and other oil-related products. Due to the busy summer season in the US, there is a good chance that weekly oil inventories will decrease more than expected. This could help keep oil prices strong and prevent any significant long-term price drops. Geopolitics also remains a concern and could once more play an important role in the absence of high impact US economic data. For all market-moving economic releases and events (GMT-Time), see the MarketPulse Economic Calendar. (click to enlarge) Technical Analysis Oil prices snapped a four week winning streak to close around 2.33% lower. The weekly timeframe has price testing the 100-day MA which could prove to be a stern area of resistance. The daily timeframe is even more interesting as it appears markets could be setting up a triple bottom pattern. Such a pattern would no doubt embolden bulls eyeing further appreciation in oil prices. A daily candle close below the 85.25 handle opens up a potential selloff in Brent crude with support levels at 83.50 and 82.50 coming into focus. Immediate resistance rests at 86.21 with a break above carrying oil toward 87.90 and potentially the 90.00 psychological level. Support 85.25 83.50 (200-day MA) 83.00 81.58 Resistance 86.21 87.90 90.00 (psychological level) Brent Crude Oil Daily Chart, July 15, 2024 Source: TradingView.com (click to enlarge) Follow Zain on Twitter/X for Additional Market News and Insights @zvawda Content is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. (c) 2023 OANDA Business Information & Services Inc. BioLatest Posts Zain Vawda Market Analyst at OANDA Zain is an experienced financial markets analyst and educator with a rich tapestry of experience in the world of retail forex, economics, and market analysis. Initially starting out in a sales and business development role, his passion for economics and technical analysis propelled him towards a career as an analyst. He has spent the last 3 years in an analyst role honing his skills across various financial domains, including technical analysis, economic data interpretation, price action strategies, and analyzing the geopolitical impacts on global markets. Currently, Zain is advancing in obtaining his Capital Markets & Security Analyst (CMSA) designation through the Corporate Finance Institute (CFI), where he has completed modules in fixed income fundamentals, portfolio management fundamentals, equity market fundamentals, introduction to capital markets, and derivative fundamentals. He is also a regular guest on radio and television programs in South Africa, providing insight into global markets and the economy. Additionally, he has contributed to the development of a financial markets course approved by BankSeta (Banking Sector Education and Training Authority) at NQF level 6 in South Africa. Latest posts by Zain Vawda (see all) USD/CAD Eyes Breakout as Oil Price Slide Continues, BoC Meeting Next - 22 July 2024 Safe Havens Gain Favor Amid Geopolitical Tensions and US Election Uncertainty, Gold Above $2400/oz, DXY Slips - 22 July 2024 Weekly Market Outlook: US PCE, GDP, and Earnings Expected to Drive Volatility - 19 July 2024 Baker Hughes Oil Rig Count, Brent Crude oil prices, Brent Crude Oil Technical Analysis, Brent Oil, China's economic data, Chinese demand, Crude oil imports, EIA crude oil inventory, GDP Growth, Geopolitics, Refinery output, WTI Technical Analysis Back to Top",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil prices surge amid political uncertainty, geopolitical tensions - MENAFN.COM",
    "Link": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vbWVuYWZuLmNvbS8xMTA4NDQzNTYwL09pbC1wcmljZXMtc3VyZ2UtYW1pZC1wb2xpdGljYWwtdW5jZXJ0YWludHktZ2VvcG9saXRpY2FsLXRlbnNpb25z0gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 08:45:28 GMT",
    "Categories": [],
    "Content": "Oil prices surge amid political uncertainty, geopolitical tensions We use cookies We use cookies and other tracking technologies to improve your browsing experience on our website, to show you personalized content and targeted ads, to analyze our website traffic, and to understand where our visitors are coming from. I agreeI declineChange my preferences US Europe Arab Asia Africa | Politics Economy Oil&Energy Entertainment Sport Oil prices surge amid political uncertainty, geopolitical tensions Date 7/16/2024 4:45:28 AM Share on Facebook Tweet on Twitter (MENAFN) Oil prices saw a modest increase on Monday as geopolitical uncertainty in the United States and the Middle East outweighed pressures from a stronger dollar and subdued demand in China. brent crude futures edged up by 15 cents, or 0.2 percent, to reach USD85.18 per barrel by 0425 GMT, following a slight decline of 37 cents on Friday. Similarly, U.S. West Texas Intermediate crude rose by 20 cents to USD82.41 per barrel, marking a 0.2 percent gain.The attempted assassination of U.S. presidential candidate Donald Trump earlier in the week contributed to market uncertainty, according to Tony Sycamore, a market analyst at IG. This event has cast a shadow over the political landscape of a deeply divided country as it approaches the election period, potentially influencing market sentiment.Geopolitical risks in the Middle East also played a role in supporting oil prices, highlighting ongoing concerns about regional stability. Furthermore, the market remains bolstered by the continuing supply cuts by OPEC+ members. Iraq's oil ministry has pledged to counter any excess oil production starting from 2024, indicating a commitment to manage global supply levels amidst market fluctuations.Despite these factors, oil prices had faced downward pressure last week. Brent crude had declined by more than 1.7 percent after four consecutive weeks of gains, while U.S. West Texas Intermediate futures dropped by 1.1 percent. This decline was attributed to weak demand for oil in China, the largest importer of crude globally, where crude oil imports fell by 2.3 percent in the first half of the year to 11.05 million barrels per day. Factors contributing to this decline included disappointing fuel demand and reduced output by independent refiners amid narrow profit margins.China's economic slowdown in the second quarter, exacerbated by challenges such as a prolonged property downturn and job market instability, has raised expectations for additional stimulus measures from Beijing to bolster domestic demand. These developments are closely monitored by market participants for potential implications on global oil consumption and economic recovery trends. MENAFN16072024000045015682ID1108443560 Legal Disclaimer: MENAFN provides the information \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the provider above. Tags Label Comments No comment Category Date 7/16/2024 Most popular stories New Nature Writing Genre Brings Wild And Tricky Aspects Of Climate Cri... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Jensen Huang And Mark Zuckerberg To Explore The Future Of AI And Virtu... 'We Failed': US Secret Service Admits 'Most Significant Mistake' Leadi... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... Market Research Infrastructure-As-A-Service (Iaas) Market Trends, Size, Share, Analysis, ... Unlocking Insights: Lithium Carbonate Analysis Report... Saudi Arabia Hybrid Cloud Market To Witness 21.91% CAGR Until 2032... Saudi Arabia Lingerie Market Share, Size, Growth, Trends, Analysis And Re... United States Hybrid Cloud Market Size To Expand At A CAGR Of 21.95% Duri... Australia Glamping Market Industry Size, Share, Growth, Leading Companies... United States Home Infusion Therapy Market Trends, Scope, Demand, Opportu... More Stories 'Sexist' falsehoods target Kamala Harris after Biden drops out... UN Chief Urges Reform Of Int'l Financial System... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... Kremlin Awaits 'Concrete Action' Following Zelensky's Proposal On Negotia... UNHCR To Reduce Workforce In Lebanon Amid Budget Constraints... 4.7-Magnitude Quake Jolts Turkey... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Ananya Panday Buys Herself A Powerful New Luxury SUV... Rebounding chip shares lead US stocks higher... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... The coconut tree presidency? Harris memes break the internet... Times When Nikki Tamboli Showed Off Her SEXY Body That Took The Internet ... Newsletter Daily(English) Daily(Arabic) All() Search ******************** Home News News by Industry News by Region Americas Europe Arab World Asia Africa Press Releases Submit Your press Authors Register Submit your Articles RSS MarketData Equities Market Global Indices MENA Indices Qutoes & Charts End of Day stocks Currencies Currency Convertor Cross Rates Historical Currencies Libor Mena Stocks Stocks Search Commodoties Oil & Energy Economic Calendar Stocks Search Research Premium Research Free Research Countries Saudi Arabia UAE Bahrain Qatar Kuwait Jordan Oman Egypt Lebanon Iraq Palestine Syria Tunisia Algeria Morocco Yemen Sections Events Financial Glossary 🍪 We use cookies! Hi, this website uses essential cookies to ensure its proper operation and tracking cookies to understand how you interact with it. The latter will be set only after consent. Let me choose Accept allReject all Cookie usage 📢 I use cookies to ensure the basic functionalities of the website and to enhance your online experience. You can choose for each category to opt-in/out whenever you want. For more details relative to cookies and other sensitive data, please read the full privacy policy. Strictly necessary cookiesStrictly necessary cookies These cookies are essential for the proper functioning of my website. Without these cookies, the website would not work properly Performance and Analytics cookiesPerformance and Analytics cookies These cookies allow the website to remember the choices you have made in the past NameDomainExpirationDescription^_gagoogle.com2 yearsdescription ..._gidgoogle.com1 daydescription ... Advertisement and Targeting cookiesAdvertisement and Targeting cookies These cookies collect information about how you use the website, which pages you visited and which links you clicked on. All of the data is anonymized and cannot be used to identify you More information For any queries in relation to my policy on cookies and your choices, please contact us. Accept allReject allSave settings",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products - ukrainefrontlines.com",
    "Link": "https://news.google.com/rss/articles/CBMi0gFodHRwczovL3VrcmFpbmVmcm9udGxpbmVzLmNvbS9vcGluaW9uL2ludmVzdGlnYXRpb25zL3RvcC1wZWFjZW1ha2Vycy0yLXR1cmtleS0ybmQtaW4tc2VhLWltcG9ydHMtb2YtcnVzc2lhbi1ibG9vZHktY3J1ZGUtb2lsLWluLW1heS0yMDI0LWFuZC1hYnNvbHV0ZS13b3JsZC1jaGFtcGlvbi1pbi1zZWEtaW1wb3J0cy1vZi1ydXNzaWFuLXBldHJvbGV1bS1wcm9kdWN0cy_SAdYBaHR0cHM6Ly91a3JhaW5lZnJvbnRsaW5lcy5jb20vb3Bpbmlvbi9pbnZlc3RpZ2F0aW9ucy90b3AtcGVhY2VtYWtlcnMtMi10dXJrZXktMm5kLWluLXNlYS1pbXBvcnRzLW9mLXJ1c3NpYW4tYmxvb2R5LWNydWRlLW9pbC1pbi1tYXktMjAyNC1hbmQtYWJzb2x1dGUtd29ybGQtY2hhbXBpb24taW4tc2VhLWltcG9ydHMtb2YtcnVzc2lhbi1wZXRyb2xldW0tcHJvZHVjdHMvYW1wLw?oc=5",
    "Published": "Sun, 14 Jul 2024 08:26:22 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products ­ Twitter Facebook Linkedin Youtube Instagram Toggle navigation NEWS UKRAINEWAR ZONEWORLD ABOUT UKRAINEOCCUPIED CRIMEAVIDEO EUROMAIDAN UKRAINECRIMEA ANNEXATIONUKRAINE WARINTERVIEWOPINION INTERVIEWSANALYTICSINVESTIGATIONSDISCOVER UKRAINE ARTHISTORYTECHTRAVELMUSICMOVIECULTUREPOLITICSBUSINESSEVENTSPROJECTSABOUTPrivacy PolicyFUND USSelect LanguageУкраїнськаالعربية简体中文NederlandsEnglishFrançaisDeutschहिन्दीItalianoनेपालीPortuguêsРусскийEspañol Home OPINION INVESTIGATIONS Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products July 14, 2024 10:26 am Top \"peacemakers\": Turkey - 2nd in sea imports of Russian bloody crude oil in May 2024 and absolute world champion in sea imports of Russian petroleum products.Andrii Klymenko investigates.In May 2024, Turkey imported - according to our own monitoring - 2.5 million tons of crude oil: from Russian ports of the Baltic Sea (2.1 million tons) and the Black Sea (0.4 million tons). This accounts for 17.3% of the total crude oil exports from the ports of these two seas. In total, 19 out of 100 tankers with crude oil from the Baltic and 4 out of 29 tankers from the Black Sea arrived in Turkey. To estimate this in monetary terms, you can do the following simple arithmetic: 2.4 million tons * 7.3 = 17.52 million barrels * $79.58 = $1.4 billion USD (per month).However, that is not all - unlike India, Turkey is the absolute champion in the sea import of Russian petroleum products (in addition to crude oil - diesel fuel, etc.). In May 2024, Turkey imported - according to our own monitoring - 2.3 million tons of petroleum products from Russian ports of the Baltic Sea (0.7 million tons) and the Black Sea (1.6 million tons). This represents 37.7% of the total export of petroleum products from Russian ports in these two seas.The number of tankers with Russian petroleum products received by Turkish ports in May 2024 might shock an unprepared reader: 83 from the Black Sea and 16 from the Baltic. Out of these 99 tankers, 35 were Russian.By the way, after the start of the Great War, Turkey doubled its average monthly import figures in 2022, and then even tripled or quadrupled them. And now not only oil market specialists are asking the rhetorical question: did the use of low-quality Russian diesel fuel triple in Turkey? Or is it something else?Let's add another topic that raises many questions. For a year now, since July 2023, Turkey has been pushing for the resumption of the \"Black Sea Grain Initiative\" (the same one - with the participation of the UN, Russia, and Turkey, from which Russia demonstratively withdrew), although an alternative has been successfully operating all this time - the Ukrainian sea export corridor (without the UN, without Russia, and without Turkey).Why the Turkish president needs this, no one can understand. It remains to be assumed that:a) the Turkish leader knows something about Russia's plans to attack ships heading to the ports of Greater Odesa via the Ukrainian corridor, orb) he is fulfilling the request of Emperor Pu, who certainly does not like that ships on their way to Ukrainian ports are no longer inspected.Yes, we appreciate that Turkey has closed its straits to Russian warships. And we haven't forgotten about the Bayraktars. But...As we noted a few days ago - ALL \"peacemaker\" countries - those that exist and those that will appear - simply have business with Putin's Russia. And they are not concerned about peace. They are concerned about their banks already feeling the strain - otherwise, soon they will have to somehow wind down their business with the aggressor country. Ukraine Front Lines Share this: FacebookTwitterPinterestLinkedInStumbleuponTumblrRedditDiggEmailPrint Tags: imports od russian crude oil oil embargo russia ukraine war sanctions sanctions against russia Like this: Like Loading... WE NEED YOUR HELP! 24/7, every day, since 2014 our team based in Kyiv is bringing crucial information to the world about Ukraine. Please support truly independent wartime Pulitzer Prize-winning journalism in #Ukraine.You are welcome to fund us: Donate Now Share this: 0 Comments Leave a reply Click here to cancel the reply Your email address will not be published. Required fields are marked *Comment Name *Email *Website Save my name, email, and website in this browser for the next time I comment. Related Articles The International Criminal Court is to investigate the case regarding the situation in Ukraine Hungary calls Ukraine's decision to halt transit of Russian oil by Lukoil \"unacceptable\" A business partner of the Head of the Office of the President of Ukraine, Yermak, borrows money from Russians to buy a house in America Regarding Kamala Harris's chances Ukraine struck Crimea with dozens of ATACMS. Putin lost two Su-30 jets and a hundred soldiers Russia - Ukraine war updates as of July 22, 2024 You can back Ukraine Front Lines to remain #1 Independent Citizen Media about Ukraine. Your investment saves the Truth and lives. LATEST NEWS Russia - Ukraine war updates as of July 22, 2024 Russia - Ukraine war updates as of July 21, 2024 Ukraine has stopped the transit of Russian oil to Hungary. Official Budapest, along with Moscow, still hopes for a \"legal resolution\" Russia - Ukraine war updates as of July 20, 2024 Defender of the Ukrainian language killed - western media on the shooting of Iryna Farion Missile strike on children's playground in Mykolaiv: number of injured rises to 15 civilians Some facts about Iryna Farion, who was killed near her home in Lviv TOP STORIES The ghost of Ukrainian nuclear weapons The West vs. Russia: the tactic of a thousand concessions Russian propaganda fakes about the Kyiv's Children Hospital Okhmatdyt attack The russian statement about the destruction of the Kyiv HPP and the Kaniv reservoir is not simply about blackmail News from the sidelines of the NATO summit in Washington A business partner of the Head of the Office of the President of Ukraine, Yermak, borrows money from Russians to buy a house in America Iryna Farion: During this terrible and wild war cynical beings in Ukrainian parliament are looting the last budget funds DISCOVER UKRAINE A documentary about the fighters of the legendary third separate assault brigade appears on Netflix Constitution of political romanticism Ukraine is developing a swarm of drones capable of attacking without human intervention About Ukraine Front Lines Ukraine Front Lines is the Independent Citizen Media, which disseminates truthful news on the latest updates from Ukraine. Learn More Ukraine Front Lines CONTACT USYou can send us an email and we'll get back to you, Ukraine Front Lines teamSend Sending Log in with your credentials Sign in Remember me Lost your password? Forgot your details? Reset Password I remember my details %d",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude oil falls after weak Chinese growth - London Loves Business",
    "Link": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vbG9uZG9ubG92ZXNidXNpbmVzcy5jb20vY3J1ZGUtb2lsLWZhbGxzLWFmdGVyLXdlYWstY2hpbmVzZS1ncm93dGgv0gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 09:26:27 GMT",
    "Categories": [],
    "Content": "Crude oil falls after weak Chinese growth - London Business News | Londonlovesbusiness.com Tech Property Business London Loves Home Business News Crude oil falls after weak Chinese growth IMAGO/Westlight / Avalon Business NewsEconomic NewsFinance NewsInvestment News Crude oil falls after weak Chinese growth by Antonio Ernesto Di Giacomo Market Analyst Latam at XS.com July 16, 2024 written by Antonio Ernesto Di Giacomo Market Analyst Latam at XS.com 16 th Jul 24 10:26 am Crude oil prices fell slightly on Monday as weak Chinese data raised doubts about the growth of this significant economy. The slowdown in the world's second-largest economy has caused investors' concern, impacting global crude oil prices. West Texas Intermediate (WTI) fell from the market opening, dropping from $81.20 to $80.45 per barrel. Meanwhile, Brent crude also declined, trading at $83.80 per barrel. These drops reflect market concerns over China's economic weakness, a country that plays a crucial role in global oil demand. The world's second-largest economy recorded its weakest year-on-year growth in the second quarter. Forecasts indicated a 5.1% growth, but actual growth was 4.7%. This figure surprised analysts and generated uncertainty about China's ability to maintain its growth pace shortly. Additionally, China's crude oil imports fell by 2.3% in the first half of this year, standing at 11.05 million barrels per day. This decrease in imports is due to disappointing fuel demand, suggesting that economic activity in the country is not as robust as expected. These data indicate that China faces increasing economic headwinds, likely a bad sign for crude oil demand in this vital market. The decline in Chinese demand could have a significant impact on global oil prices, given China's weight in global energy consumption. Losses have been limited as political uncertainty in the United States and the Middle East has supported prices. Despite weak Chinese demand, other geopolitical factors have maintained stability in crude oil prices, preventing more pronounced declines. In conclusion, the weakening of Chinese economic growth has immediately impacted crude oil prices, reflecting concerns about future oil demand. Although geopolitical factors have limited declines, China's economic situation will remain a key factor to monitor in the coming months to understand the evolution of crude oil prices in the global market. More Like This: The influence of Hurricane Beryl and economic...Oil demand outlook drives Brent and WTI prices higherDrop in WTI and Brent amid geopolitical concernsRedundancies fuel further expansions in candidate... Leave a Comment Please enable JavaScript to view the comments powered by Disqus. EconomyfinanceInvestmentOil & Gas Share 0 FacebookTwitterLinkedinWhatsappTelegramEmail You may also like Markets could be set for billions in loses amid the... Major UK airline companies suffer staggering £3.37 billion loss following... Crude oil prices declines as Biden pulls out of presidential... Bitcoin's rally faces resistance amid long liquidations and Mt. Gox... More than 1,000 jobs could be lost as Tapi to... Gold gains on Biden's presidential race withdrawal and weaker dollar CLOSE AD Skip Ads by",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "EIA reports surge in Iraqi oil exports to the US - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L0VJQS1yZXBvcnRzLXN1cmdlLWluLUlyYXFpLW9pbC1leHBvcnRzLXRvLXRoZS1VU9IBUmh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9FSUEtcmVwb3J0cy1zdXJnZS1pbi1JcmFxaS1vaWwtZXhwb3J0cy10by10aGUtVVM?oc=5",
    "Published": "Sun, 14 Jul 2024 07:13:33 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "EIA reports surge in Iraqi oil exports to the US - Shafaq News Breaking News Iraqi Parliament includes the General Amnesty Bill on the agenda for next Wednesday's session Iraq's Federal Intelligence Investigation Agency arrests seven in Nineveh UN Iraq and Ministry of Water Resources launch \"Water is Life\" Campaign Iraq and Iran discuss enhanced security cooperation and border management 2024-07-14 10:59 Share font Enable Reading Mode A- A A+ Shafaq News/ Iraqi oil exports to the United States saw an increase last week, according to the US Energy Information Administration (EIA) on Sunday. The EIA reported that the average US crude oil imports from nine key countries reached 5.635 million barrels per day (bpd) last week, up by 235,000 bpd from the previous week's average of 5.400 million bpd. The report said that Iraq's oil exports to the US averaged 217,000 bpd last week, marking an increase of 22,000 bpd from the previous week's average of 195,000 bpd. Canada led the oil imports to the US last week, averaging 3.889 million bpd, followed by Mexico with 417,000 bpd. Saudi Arabia came next with 239,000 bpd, Colombia with 226,000 bpd, and Brazil with 217,000 bpd. According to the EIA data, the US imported 170,000 bpd from Nigeria, 162,000 bpd from Ecuador, and 44,000 bpd from Libya. Related News Snapshot of recent data: Iraqi oil exports to the United States halved last week Iraq's oil exports to the US in March decline amid global market shifts Iraqi oil exports to the US declined last week: EIA Iraq exported more than 6 million barrels of oil to the United States in January Iraq exported 5.5 million barrels of oil to the US during March OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance PausePlay % buffered00:00 00:00 UnmuteMute Disable captionsEnable captions Settings CaptionsDisabledQualityundefinedSpeedNormal CaptionsGo back to previous menu QualityGo back to previous menu SpeedGo back to previous menu 0.5x0.75xNormal1.25x1.5x1.75x2x4x PIPExit fullscreenEnter fullscreen Play Shafaq Live Shafaq Live English English Radio facebook",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyNC8wNy8xNC9kYW5nb3RlLXJlZmluZXJ5LXRvLXNvdXJjZS1jcnVkZS1vaWwtZnJvbS1vdGhlci1hZnJpY2FuLWNvdW50cmllcy1hZnRlci1pbXBvcnRzLWZyb20tdXMtYnJhemlsLTIv0gGLAWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDI0LzA3LzE0L2RhbmdvdGUtcmVmaW5lcnktdG8tc291cmNlLWNydWRlLW9pbC1mcm9tLW90aGVyLWFmcmljYW4tY291bnRyaWVzLWFmdGVyLWltcG9ydHMtZnJvbS11cy1icmF6aWwtMi8_YW1wPTE?oc=5",
    "Published": "Sun, 14 Jul 2024 11:03:03 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics Login Register HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: No Result View All Result Home Sectors Energy Dangote Refinery to source crude oil from other African countries after imports from US, Brazil by Cyrus Ademola 1 week ago in Energy, Sectors Aliko Dangote Share on FacebookShare on TwitterShare on Linkedin The Chairman of Dangote Refinery, Aliko Dangote, said that his company will source crude oil from other African oil-producing nations following recent imports from the United States and Brazil.Dangote made this disclosure in a statement to newsmen during a tour in his Lagos-based refinery on Saturday.According to the business mogul, the refinery is expecting feedstock acquired from the US and Brazil in the coming months. Related Stories Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 He mentioned that conversations are ongoing to secure more crude from African countries like Angola, Senegal, and Libya, all of which are oil-producing nations. \"We will start importing crude oil from African countries. When we get to those countries, we'll start negotiating with them. We'll start bringing in from there. \"We have just bought from US and Brazil. So I think by next month, we'll expand the scope to most of African countries. \"If we availability in Nigeria, we won't have to turn to these other countries,\" Dangote said.When asked about the timeline for sourcing crude from these African countries, Dangote stated that it could begin as soon as next month. News continues after this ad \"Very soon. I think by next month. You know crude, you have to book two months in advance. So, I'll say October we'll be bringing in from these African countries,\" Dangote responded. Feedstock from US, Brazil According to recent reports, Dangote refinery secured 6 million barrel crude oil from US, which is expected to reach the $19 billion facility by August.In addition, the mega refinery will also receive about 5 million barrel of crude oil from US by September, data from Bloomberg show.Accordingly, Dangote is also sourcing crude from the South American country, Brazil, in the coming months to ramp up production as it sets to commence the supply of petrol to the market this month.The leadership of Dangote has vehemently lamented the unavailability of crude in Nigeria, forcing the oil facility to seek alternatives from other countries. IOCs unable to supply local refineries Despite being a leading oil producer, Nigeria still struggles to meet its OPEC quota as well as supply local refineries in the country.Some local refineries, including Dangote, have accused International Oil Companies (IOCs) of refusal to meet their demands, alleging that these IOCs prefer to sell the crude abroad.In response, the regulatory body of oil in Nigeria, NUPRC, has insisted that the IOCs meet local demands first, before exporting to other African countries. PMS Supply expected in July Moreover, Dangote has said his refinery will supply petrol to local marketers this month.Dangote mentioned that the change in date was due to a slight delay, prompting the shift from the originally proposed June to mid-July.The CEO said the refinery will commence production of petrol between 10 and 15 of July, while supply to local marketers will commence from the third week of the same month. \"We had a bit of delay, but PMS will start coming out by 10 to 15 of July. But then we want to keep it in tank to make sure that it settles. So by third week of July, we'll be able coming out to take it into the market,\" Dangote said.The refinery is expected to significantly reduce Nigeria's dependence on imported petroleum products. Follow us for Breaking News and Market Intelligence. Tags: Aliko DangoteBrazilCrude Oil ImportDangote RefineryOPECUS Cyrus Ademola Cyrus Ademola is a political and economy analyst with over half a decade experience in journalism, research-based oped, economic reportage and political analysis. His works have been featured on different media outlets, covering from politics to business trends, to crime and security as well as the real estate sector. Related Posts Energy Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Op-Eds Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Economy Dangote Refinery: 'Non-availability of crude oil' to domestic refineries affecting fuel quality in Nigeria - Lawmakers July 22, 2024 Energy Dangote refinery to import crude oil from Libya July 22, 2024 Energy \"Let them (NNPCL) buy me out and run the refinery\" says Aliko Dangote amid monopoly allegations July 21, 2024 Digital Media Energy Expert Kelvin Emmanuel on Dangote Refinery Challenges and NNPC's Strategic Stake. July 21, 2024 Next Post How digital financial services are transforming property transactions in Nigeria Comments 2 Michael says: July 14, 2024 at 3:50 pm It is a shame on this country and government not to provide crude oil for Dangote Refinery. It is not patriotic on the side of the people in government to allow this to happen. Our local refineries ought to get crude first before exporting the excess to other countries. By this action government and NNPC and all regulators concern have proved to us that making money for themselves is more important than Nigeria economy and her citizen s welfare. There should be immediate ban on crude oil exchange or swap for refined products outside Nigeria. If there should be any, it should be given to Dangote Refinery or any of the local Refineries not foreign Refineries. Reply Abba says: July 14, 2024 at 6:49 pm So this is how we are going to continue to be clolonised indirectly.. Shame on our leaders. They prefer to please their western evil freinds in exchange for their immunity. Rather than putting their country first. Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment *Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Ad Next Stay Riding Motorbike Alone Across Laos - Beautiful Memories from LAOS - Nếm TV 40 42 00:00 00:00 / 00:00 10 Sec Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar Consultant returns N1.5 billion from NIRSAL contract to EFCC Follow us on social media: Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Download Nairametrics iOS AppDownload Nairametrics Android AppHomeMarketsSectorsEconomyBusiness NewsFinancial LiteracyDisclaimerAds Disclaimer (c) 2024 Nairametrics Welcome Back! Login to your account below Remember Me Forgotten Password? Sign Up Create New Account! Fill the forms below to register All fields are required. Log In Retrieve your password Please enter your username or email address to reset your password. Log In No Result View All Result HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Login Sign Up (c) 2024 Nairametrics Advertisement",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil prices tumble as demand worries in China - Al Bawaba",
    "Link": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmFsYmF3YWJhLmNvbS9idXNpbmVzcy9vaWwtcHJpY2VzLXR1bWJsZS1kZW1hbmQtd29ycmllcy1jaGluYS0xNTc3MzU40gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 07:50:00 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "Oil prices tumble as demand worries in China | Al Bawaba Skip to main content Home BUSINESS Oil prices tumble as demand worries in China Oil prices tumble as demand worries in China Published July 16th, 2024 - 07:50 GMT FacebookTwitterWhatsAppShare Shutterstock Oil prices decreased on Tuesday as the weak economic data in China caused worries about a slowing economy crimping demand in the world's largest crude oil importer. International benchmark Brent crude traded at $84.23 per barrel at 09.39 a.m. local time (0639GMT), a decline of 0.73% from the closing price of $84.85 per barrel in the previous trading session.The American benchmark West Texas Intermediate (WTI) traded at $80.22 per barrel at the same time, a 0.77% fall from the previous session that closed at $80.84 per barrel.The gross domestic product (GDP) of China rose by 4.7% in the second quarter of 2024, below market expectations, according to official figures on Monday.The country's economy expanded by 5.3% in the first quarter, and the market forecast was a GDP growth rate of 5.1% in the second quarter, the National Bureau of Statistics said.This comes after data last week showed softness in oil imports, according to Daniel Hynes, a commodity strategist at the Australia and New Zealand Banking Group.\"Over the first six months of the year, the world's top importer bought less crude oil compared with last year. June crude oil imports fell on both a monthly and annual basis to 46.45 million tons,\" Hynes said in an e-mailed note.Hynes also added that a stronger US dollar emerged as investors ratcheted up their bets that former US President Trump would win back the White House, which dented investor appetite. The US dollar index rose by 0.18% to 104.065 at 09.39 a.m. local time (0639GMT), compared to the previous trading session close. The higher US dollar curbs oil demand and supports price declines.Trump was targeted in an assassination attempt during a rally in Pennsylvania on Saturday, just days before he was set to accept the Republican nomination for a third term.However, increased expectations that the US Federal Reserve's (Fed) interest rate cut will start soon limited further price declines.The Fed is receiving \"more good\" inflation data, paving the way for its first interest rate cut later this year, Chair Jerome Powell said Monday.Speaking at the Economic Club of Washington, DC, Powell reiterated his comments that the US central bank is looking for \"greater confidence\" that inflation is returning to its 2% target.Powell noted the Fed does not need to wait until inflation hits its 2% long-term target to begin lowering interest rates because of the lagging effect of monetary tightening on inflation data.Market players interpreted Powell's remarks as a return to interest rate cuts may not be far off.Lower interest rates are set to reduce the cost of consumer borrowing and stoke expectations of increased economic growth and demand for oil. Tags:ChinaOilOil Prices Via SyndiGate.info LatestPopular Oil prices tumble as demand worries in China Billie Eilish set to read CBeebies bedtime story to ... New research shows how reducing screen time improves ... American Kestrel finds temporary home in Winnipeg city hall Canada's manufacturing sales see a rise by 0.4% in May Loading content ... Sign up to our newsletter for exclusive updates and enhanced content Sign up to get Al Bawaba's exclusive celeb scoops and entertainment news (c) 2000 - 2024 Al Bawaba (www.albawaba.com) ✓ Thanks for sharing! AddToAny More...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote Refinery to Import First Shipment of Brazilian Crude Oil - Naija247news",
    "Link": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vbmFpamEyNDduZXdzLmNvbS8yMDI0LzA3LzE0L2RhbmdvdGUtcmVmaW5lcnktdG8taW1wb3J0LWZpcnN0LXNoaXBtZW50LW9mLWJyYXppbGlhbi1jcnVkZS1vaWwv0gEA?oc=5",
    "Published": "Sun, 14 Jul 2024 00:48:35 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Dangote Refinery to Import First Shipment of Brazilian Crude Oil Sign in About Us Advertising Guidelines Advertising Solutions & Rates Digital Accessibility Policy Privacy Statement T&C Cookies & IBA Statement Media Kit 2024 Sign in Welcome!Log into your account your username your password Forgot your password? Digital Accessibility Policy Password recovery Recover your password your email Search PRO Menu Search Search Top Stories Companies & Markets Education Economy Monetary Policy Feeds Media Kit 2024 Top Stories Companies & Markets Education Economy Monetary Policy Feeds Media Kit 2024 Sign in Welcome! Log into your account your username your password Forgot your password? Get help Digital Accessibility Policy Password recovery Recover your password your email A password will be e-mailed to you. Oil Markets Dangote Refinery to Import First Shipment of Brazilian Crude Oil By: Godwin Okafor, The Naija247news Date: July 14, 2024 Nigeria's Dangote refinery is set to receive its first shipment of Brazilian crude oil as it moves towards full operational capacity. This marks a historic purchase for Nigeria, with the refinery importing a one-million-barrel cargo of Brazil's Tupi crude, scheduled for delivery in the latter half of next month.Thank you for reading this post, don't forget to subscribe! The Dangote refinery has been crucial in reducing Nigeria's reliance on imported fuel. Despite being Africa's largest oil producer, Nigeria has historically depended on foreign fuel imports to meet domestic needs due to insufficient refining capacity. By importing crude and refining it locally, Nigeria aims to enhance energy security, reduce import dependency, and lower fuel prices for consumers. Sourcing crude oil from diverse global suppliers will be key to the Dangote refinery's success and Nigeria's broader energy strategy. The Brazilian crude, sold by Petrobras, is one of the most cost-effective and suitable oil grades on the global market. Earlier this week, the Nigerian Upstream Petroleum Regulatory Commission (NUPRC) reached an agreement with oil producers to supply crude oil to domestic refineries at market prices, ending a supply dispute that had strained relations with international oil companies. This agreement is part of Nigeria's broader efforts to ensure a stable supply of crude for its refineries, strengthening the country's energy infrastructure and reducing over-reliance on any single source. As Nigeria continues to build its refining capabilities, the Dangote refinery stands at the forefront of this transformative journey. Previous article UPDATED: Former U.S. President Trump Escapes Assassination Attempt at Pennsylvania Rally; Suspect is Dead: Sources Next article Nigeria's Central Bank to Tackle Inflation, Foresees Lower Interest Rates Soon Godwin Okafor, The Naija247newshttps://naija247news.com Godwin Okafor is a veteran Financial Journalist, Internet Social Entrepreneur, and the visionary Founder of Naija247news Media Limited. With an extensive career spanning over 16 years in financial journalism, Godwin possesses a wealth of experience that seamlessly bridges both traditional and digital media landscapes. His journey in journalism commenced at Business Day, Nigeria, where he laid the foundation for his prolific career. In 2010, Godwin took a bold step by founding Naija247news Media, a platform that has since become a prominent player in delivering timely and accurate news. Educationally, Godwin Okafor holds a Bachelor's degree in Industrial Relations and Personnel Management from the prestigious Lagos State University, Ojo, Lagos. His commitment to continuous learning led him to the Lagos Business School, where he further honed his skills. Additionally, he is recognized as a Fellow of the University of Pennsylvania, having successfully completed the Wharton Seminar for Business Journalists. Throughout his illustrious career, Godwin has earned acclaim by winning numerous journalism awards, a testament to his dedication to excellence in reporting. Beyond his role as a Financial Journalist, Godwin Okafor wears the hat of the Chairman at Emmerich Resources Limited, the publishing entity behind Naija247news. His visionary leadership has played a pivotal role in shaping the media landscape and establishing Naija247news as a trusted source of information. Godwin Okafor's multifaceted expertise, commitment to journalistic integrity, and leadership in the realm of business journalism underscore his influential presence in both the media and entrepreneurial spheres. Share post: Facebook Twitter Pinterest WhatsApp I want in I've read and accept the Privacy Policy. Popular Nigerian Army Hands Over Rescued Chibok Girl, 330 Others To Borno Govt NYSC awards ex-corps member for 18 projects CBN's directive on dormant accounts' in order - Unegbu APC urges House of Assembly to impeach Obaseki, over threat to burn down Nigeria Resident Doctors Begin 5-day Warning Strike More like this Related Nigerian Army Hands Over Rescued Chibok Girl, 330 Others To Borno Govt Chukwu Azochukwu, The Naija247news - July 22, 2024 July 22, 2024. Azonuchechi Chukwu. The Theatre Commander, Joint Task Force,... NYSC awards ex-corps member for 18 projects Chukwu Azochukwu, The Naija247news - July 22, 2024 July 22, 2024. Azonuchechi Chukwu. Mr Wisdom Nduchika has been awarded... CBN's directive on dormant accounts' in order - Unegbu Chukwu Azochukwu, The Naija247news - July 22, 2024 July 22, 2024. Azonuchechi Chukwu. A financial expert, Mr Okechukwu Unegbu,... APC urges House of Assembly to impeach Obaseki, over threat to burn down Nigeria Peter Okafor - July 22, 2024 July 22,2024. The leadership of the Edo State chapter of... About Us Advertising Guidelines Advertising Solutions & Rates Digital Accessibility Policy Privacy Statement T&C Cookies & IBA Statement Media Kit 2024 About us Naija247news.com is an investigative news platform that tracks news on Nigerian Economy, Business, Politics, Financial and Africa and Global Economy. Naija247news was founded in October, 2010. Facebook Instagram Mail RSS Telegram TikTok Twitter Website WhatsApp Youtube Company About Us Advertising Guidelines Advertising Solutions & Rates Digital Accessibility Policy Privacy Statement T&C Cookies & IBA Statement Media Kit 2024 The latest Nigerian Army Hands Over Rescued Chibok Girl, 330 Others To Borno Govt Security News July 22, 2024 0 July 22, 2024. Azonuchechi Chukwu. The Theatre Commander, Joint Task Force,... NYSC awards ex-corps member for 18 projects Education July 22, 2024 0 July 22, 2024. Azonuchechi Chukwu. Mr Wisdom Nduchika has been awarded... CBN's directive on dormant accounts' in order - Unegbu Financials July 22, 2024 0 July 22, 2024. Azonuchechi Chukwu. A financial expert, Mr Okechukwu Unegbu,... I've read and accept the Privacy Policy. (c) 2021 tagDiv. All Rights Reserved. Made with Newspaper Theme. MORE STORIES Nigerian Army Hands Over Rescued Chibok Girl, 330 Others To Borno... Chukwu Azochukwu, The Naija247news - July 22, 2024 0 x How can I help you? This website 'Naija247news.com' would like to send push notifications Allow Close Powered by PushEngage This website 'Naija247news.com' would like to send push notifications Allow Close Powered by PushEngage Powered by PushEngage This website 'Naija247news.com' would like to send push notifications Allow Close Powered by PushEngage This website 'Naija247news.com' would like to send push notifications Allow Close Powered by PushEngage",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Oil futures: Crude prices extend losses on economic, demand concerns - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvb2lsLWZ1dHVyZXMtY3J1ZGUtcHJpY2VzLWV4dGVuZC1sb3NzZXMtb24tZWNvbm9taWMtZGVtYW5kLWNvbmNlcm5zLTI2OTU5Lmh0bWzSAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 16:47:02 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Oil futures: Crude prices extend losses on economic, demand concerns Oil futures: Crude prices extend losses on economic, demand concerns Crude Oil Refined Products 16 Jul 2024 Quantum Commodity Intelligence - Crude oil futures Tuesday were sliding lower as concerns over broader economic growth offset increasing prospects for a September US rate cut. Front-month Sep24 ICE Brent futures were trading at $83.75/b (1900 GMT), compared to Monday's settle of $84.85/b and an intraday low of $83.30/b. At the same time Aug24 NYMEX WTI was trading at $80.77/b , versus Monday's settle of $81.91/b. Markets remained subdued in the early part of the week despite Federal Reserve Chair Jerome Powell indicating that the nation's central bank does not need to see inflation at 2% before cutting rates. \"The implication of that is that if you wait until inflation gets all the way down to 2%, you've probably waited too long, because the tightening that you're doing, or the level of tightness that you have, is still having effects which will probably drive inflation below 2%,\" Powell said in Monday's comments to the Economic Club of Washington, DC. The comments came after last Thursday's lower-than-expected inflation report lifted the prospect of a long-awaited interest rate cut this September, in turn boosting economic growth and oil consumption. China Benchmarks opened the week softer after disappointing GDP figures from China, while crude oil throughput continued to slide last month as thin margins weighed on utilisation rates across the country. The Chinese National Bureau of Statistics data showed Asia's biggest oil refiner processing 58.32 million mt of crude oil in June, equating to 14.19 million bpd. \"The weak economic data in China also weighed on sentiment in the crude oil market. This comes after data last week showed softness in oil imports. Over the first six months of the year,\" said ANZ commodity strategist Daniel Hynes, adding there are also concerns that demand in the US peaked during the 4 July holiday. Elsewhere, investors continue to monitor stop-start ceasefire talks on the Gaza conflict, while Houthi militants have launched three attempted attacks on regional shipping, including an oil tanker, as the Yemen-based group expands its range to the Mediterranean. This included Houthis publishing a video of a uncrewed surface vessel (USV) hitting the crude oil tanker Chios Lion in the Red Sea on 15 July. The North Sea physical market was also in retreat this week as flagship Forties traded in Monday's MOC window at +$0.60/b to the underlying Dated Brent swap on a FOB basis, having last traded at +1/b on Wednesday. twitter linkedin send print Related Total sees higher Q2 output, slump in refinery margins Crude Oil Refined Products 16 Jul 2024 TotalEnergies sees upstream output at the higher end of its second-quarter guidance, the company said Tuesday... Total's Port Arthur refinery shut for at least a week on steam loss Crude Oil Refined Products 16 Jul 2024 TotalEnergies has been forced to close its troubled Port Arthur refinery in Texas because of a loss of steam... Iraq reaffirms support for OPEC, vows to make up for overproduction Crude Oil 15 Jul 2024 Iraq has reaffirmed its commitment to OPEC and has vowed to make up for overproduction... CHINA DATA: June crude throughput falls to six-month low Crude Oil Refined Products 15 Jul 2024 China's crude oil throughput continued to slide last month as prolonged refinery outages and thin margins weighed on plant... Spec crude net length rises on US rate cut hopes, crude stock draw Crude Oil Refined Products 15 Jul 2024 The speculative net length of Brent and WTI futures extended gains...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Waha Hub focus of area natural gas industry - Odessa American",
    "Link": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm9hb2EuY29tL2xvY2FsLW5ld3Mvd2FoYS1odWItZm9jdXMtb2YtYXJlYS1uYXR1cmFsLWdhcy1pbmR1c3RyeS_SAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 17:39:49 GMT",
    "Categories": [],
    "Content": "Waha Hub focus of area natural gas industry - Odessa American Facebook Instagram Twitter Youtube E-Edition Logout Sign In MyAccount Newsletter Signup Manage Preferences Link My Account News Sports People Opinion Submit Letter to the Editor Classifieds Obituaries Features Comics Games and Puzzles from King Features eEdition/Tutorial More Newspapers in Education Search E-Edition Logout Sign In MyAccount Newsletter Signup Manage Preferences Link My Account Buy E-edition News Archive Photo Galleries Sports Obituaries Opinion Letters Submit Letter to the Editor E-Edition Features/Tutorial Classifieds Legal Notices Real Estate Jobs Homes Autos Features Games & Puzzles Comics Marketplace Calendar Events More Ask the Expert Special Sections Calendar Digital Advertising Manage Your Account Home Local News Business Waha Hub focus of area natural gas industry Local NewsBusinessIn the Pipeline Facebook Twitter Pinterest WhatsApp A flare burns off excess natural gas near an oil and gas plant Friday, April 8, 2022 in Midland, Texas. (Odessa American/Eli Hartman) COYANOSA The Waha Hub operates in semi-obscurity out here some 60 miles southwest of Odessa in Pecos County, but it is an indispensable part of the Permian Basin's natural gas industry. The Permian Basin Petroleum, Texas Oil & Gas and Texas Pipeline associations say it has also been the scene of consternation as the price of gas has sometimes gone negative in recent years. \"While there is a physical location for the Waha Hub, it is really more a hub for trading natural gas,\" PBPA President Ben Shepperd said. \"The physical network of pipelines crisscrossing the area, which includes intersections at the Waha Hub, connect production to domestic destinations including the West Coast, the Midwest and the Texas Gulf Coast as well as international destinations. \"It is vital that each of the physical assets that make up this network is monitored and protected. While this production originates domestically, it is part of the global marketplace.\" Shepperd said PBPA members are often faced with making difficult business decisions and none are tougher than those tied to the global marketplace including spot prices for production. \"We are proud of the efforts our members make in engaging in such a complex business and the planning it takes to produce this vital commodity that benefits people the world over,\" he said. \"Because of the high levels of production in the Permian Basin and the need for additional takeaway infrastructure, prices for natural gas production traded through the Waha Hub have been depressed. \"And while we all celebrated our nation's independence over the July Fourth holiday, we were not celebrating Waha pricing as we saw prices go to nearly negative $4 for a five-day period. There does not appear to be one identifiable reason for this drop, but it could be attributed to low demand over the weekend and the impacts of Hurricane Beryl, which resulted in gas storage disruption along the Gulf Coast and power outages in certain parts of the state like Houston.\" But U.S. domestic conditions might gradually be improving. The London-based OilPrice.com news website said July 6 that American natural gas storage surplus to the 5-year average of inventories had declined for a seventh consecutive week, falling to 528 billion cubic feet at the end of June on the back of robust gas-fired power demand and production cuts. \"The average value of U.S. natural gas consumption coming from the power sector rose to 45.3 BCf per day by the end of June, a whopping 14-percent higher than the same period a year ago thanks to an exceptionally hot summer,\" OilPrice.com said. \"The launch of the Mountain Valley Pipeline on July 1 has led to a recovery in natural gas output across the Appalachian Basin with production expected to jump to 35 BCf per day from the Marcellus and Utica shale plays. \"For six consecutive weeks already, hedge funds have been holding a net long position in Henry Hub futures, currently around 35,000 contracts, putting an end to extremely bearish market positioning in January-May.\" The Waha Hub has more than a dozen takeaway pipelines including four major interstate pipelines and nine Texas intrastate pipelines, according to the U.S. Energy Information Administration. Some of those include the Trans-Pecos Pipeline, the Agua Blanca Pipeline and the Permian Highway Pipeline. TXOGA Chief Economist Dean Foreman said West Texas needs pipelines to move natural gas, a by-product of oil production, to consumer markets such as the Gulf Coast or exports to Mexico when demand seasonally decreases. \"West Texas has three natural gas storage facilities, OneOK Texas for the Felmac, Keystone and Salado fields, and New Mexico has two more for the Grama Ridge and Washington Ranch fields,\" Foreman said from Austin. \"But the industry still relies on pipeline egress to market the gas and when in-region demand drops, there historically has been excess supply in the spring of recent years.\" Foreman said natural gas spot prices turned negative at the Waha Hub on an average monthly basis in the springs of 2020, 2023 and 2024. \"These are seasonal periods when natural gas consumption eases and storage for the next winter begins,\" he said. \"It's an economic question whether the supply justifies that additional pipeline capacity be built, but this explains why West Texas has distinct characteristics as a natural gas market that differ at times from those at the Henry Hub in Louisiana.\" TPA President Thure Cannon said the Waha is an area where pipelines bring supply from the Permian Basin and other producing areas to access pipelines that take this supply to the demand centers on the West Coast, north to the Mid-Continent and east to the Texas Gulf Coast. \"Waha has evolved over time and it is continuing to grow as production increases along with the need to access markets,\" Cannon said from Austin. \"There are various pipeline headers in the area that help aggregate available supplies and deliver this supply to a market-demand-based pipeline network.\" He said several TPA member companies have assets in the area. \"As production and supply continue to grow, new market access pipelines will need to be developed,\" Cannon said. \"As far as what drives gas prices in the region, it goes back to supply and demand. \"As production grows, there is limited pipeline takeaway and local demand. In general when there is limited local demand or low demand out west, the region will see depressed prices compared with the prices on the Texas Gulf Coast. \"This usually happens in the shoulder months, March to May and October to mid-December.\" %5B%7B%22id%22%3A20%2C%22name%22%3A%22Odessa%20American%20Morning%20Headlines%22%2C%22description%22%3A%22The%20day's%20top%20stories.%22%7D%5D News, straight to your inbox!Sign up for our Odessa American Morning Headlines newsletter. Sorry, something went wrong! subscribe Congratulations! You're all set! Cannon said that has been evident in the last few weeks as high temperatures out west and 100 percent of available pipeline capacity taken helped lift gas prices. \"Periods of low demand and restricted pipeline capacity due to maintenance will usually result in heavily discounted pricing in the region,\" he said. \"It is clear that there is a great demand for a more robust pipeline network in the Waha region as well as throughout Texas so that the midstream industry can continue to deliver the vital hydrocarbons that make all our lives better.\" Like this: Like Loading... Related New pipelines bode well for natural gas marketThings are looking up for Permian Basin natural gas producers with a big new pipeline to the Gulf Coast about to go online and construction of another one about to start. Leaders of the Permian Basin Petroleum, Texas Producers & Royalty Owners and Texas Pipeline associations say the 42-inch Matterhorn...June 5, 2024In \"Business\" Pipelines key to cutting methane emissionsTexas' 417,513 miles of intrastate oil and gas pipelines are crucial are to solving the state's problem with methane emissions and flaring and the presidents of the Texas Pipeline and Texas Independent Producers & Royalty Owners associations say there is an all-out effort to add what's needed. \"An adequate pipeline...January 15, 2023In \"Local News\" More oil, gas pipelines neededMostly out of sight but not out of mind, you might think Texas' 417,513 miles of intrastate oil and gas pipelines would be more than sufficient for the foreseeable future. Not so, say representatives of the Texas Independent Producers & Royalty Owners Association, Pinnacle Midstream Inc., the American Petroleum Institute...April 8, 2022In \"In the Pipeline\" Featured Local Savings Featured Local Savings RELATED ARTICLESMORE FROM AUTHOR Sul Ross hosts cyber camp for high school students Texas man facing execution for 1998 killing of elderly woman for her money Border arrests plunge 29% in June to the lowest of Biden's presidency as asylum halt takes hold Based in Odessa, Texas, the Odessa American was founded in 1940. Odessa American 700 N. Grant Ave., Suite 800 Odessa, TX 79761-4590 (432) 337-4661 Facebook Instagram Twitter Youtube (c) 2024 Odessa American | AIM Media Network | %d Choose your subscription to the Odessa American. Already a subscriber? Log in here",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "ADCC natural gas pipeline in Texas enters commercial service - Daily Energy Insider",
    "Link": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZGFpbHllbmVyZ3lpbnNpZGVyLmNvbS9uZXdzLzQ0NTAyLWFkY2MtbmF0dXJhbC1nYXMtcGlwZWxpbmUtaW4tdGV4YXMtZW50ZXJzLWNvbW1lcmNpYWwtc2VydmljZS_SAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 11:32:24 GMT",
    "Categories": [],
    "Content": "ADCC natural gas pipeline in Texas enters commercial service - Daily Energy Insider Home >> ADCC natural gas pipeline in Texas enters commercial service « Arizona regulators laud largest utilities for successfully meeting higher electricity demands NREL researchers say offshore wind turbines offer path for clean hydrogen production >> ADCC natural gas pipeline in Texas enters commercial service Published on July 16, 2024 by Dave Kovaleski Shares Share Post Pin Share Share Mail Share (c) Shutterstock On July 1, the ADCC Pipeline in Texas entered commercial service. The 40-mile pipeline transports natural gas from Whistler Pipeline's Agua Dulce Header to Cheniere's Corpus Christi Liquefaction facility in Texas. The pipeline is capable of providing approximately 1.7 billion cubic feet per day (Bcf/d) of natural gas transportation capacity to the Cheniere Corpus Christi Liquefaction facility from markets on Whistler Pipeline's Agua Dulce Header in South Texas. The receipt points in Agua Dulce provide Cheniere direct access to Permian and Eagle Ford volumes in addition to volumes sourced along the Gulf Coast. The ADCC Pipeline further enhances the natural gas infrastructure in Texas and creates an additional demand point for Permian gas. Further, the infrastructure supports U.S. LNG exports to global markets. The ADCC Pipeline is a joint venture owned 70 percent by Whistler Pipeline LLC, which is a joint venture between WhiteWater, MPLX LP, and Enbridge - and 30 percent by a wholly-owned subsidiary of Cheniere Energy. WhiteWater is an Austin, Texas-based infrastructure company and operator of the Whistler Pipeline. The Whistler Pipeline is an approximately 450-mile, 42-inch intrastate pipeline that transports natural gas from the Waha Header in the Permian Basin to Agua Dulce, Texas, providing direct access to South Texas and export markets. An approximately 50-mile 36-inch lateral provides connectivity to the Midland Basin. « Arizona regulators laud largest utilities for successfully meeting higher electricity demands NREL researchers say offshore wind turbines offer path for clean hydrogen production >> Connect with Us Podcast Have an idea for our new podcast? Share It with Us Sponsored Content: Fortress Information Security's CEO, Alex Santos, on the latest in electric utility cybersecurity Oil markets in the time of conflict with API's Dean Foreman Sponsored Podcast: Fortress A2V with Tobias Whitney Ransomware and US Energy Companies The Digital Divide: Electric utilities to the rescue? RECEIVE WEEKLY NEWSLETTER Please leave this field empty First Name * Last Name * Email Address * Organization Check your inbox or spam folder now to confirm your subscription. Please review our Privacy Policy before submitting. Most Read Last 7 Days ADCC natural gas pipeline in Texas enters commercial service ESG Clean Energy develops a breakthrough carbon capture system Duke Energy Florida reaches rate case agreement with consumer, business groups Indiana Michigan Power seeks more clean-energy generation resources in Michigan GSA, Defense Department seeking contractors to provide clean energy NEADA co-releases report showing most Americans have no utility shut-off protections NREL researchers say offshore wind turbines offer path for clean hydrogen production New tariffs would stifle U.S. solar progress, says ACORE analysis Federally proposed bill promotes Energy Dept.'s use of AI in energy, national security, science FirstEnergy gains $1.2B in proceeds as sale of transmission subsidiary gets finalized Latest Policy News Energy adequacy key component in grid planning, NERC report says Rhode Island Energy requests lower winter rates from state regulators Congress members urge DOT to finalize gas pipeline leak detection rule Minnesota regulators greenlight final site permit for Xcel's massive solar project Wyoming Congress members urge DOI to rescind plan that would hurt coal leasing news archive 2024 2024 Jul Jun May Apr Mar Feb Jan 2023 2023 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2022 2022 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2021 2021 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2020 2020 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2019 2019 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2018 2018 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2017 2017 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2016 2016 Dec Nov Oct Sep Aug Jul Jun May Apr Home News Source Electric Oil and Natural Gas Renewable Nuclear Policy Federal State Infrastructure Reports About Daily Energy Insider Editorial Team Corrections Policy Macallan Communications Contact Please ensure Javascript is enabled for purposes of website accessibility",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vcnVzc2lhbi1waXBlbGluZS1nYXMtZXhwb3J0cy10by1ldS1pbmNyZWFzZS0yNC15L3ktaW4tamFuLWp1bmUtZ2FzLWdyb3VwLXNheXMtMTEyMTc10gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 10:24:52 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says MOSCOW, July 16 (Reuters) - Russian natural gas exports via pipelines to the European Union countries have jumped by 24% in the first half of the year from the same period in 2023, according to a July report published by the Gas Exporting Countries Forum (GECF). It did not provide the volumes. Russia is a part of the GECF, sometimes dubbed the \"gas OPEC\", which accounts for more than two thirds of global natural gas reserves. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt GECF said pipeline gas imports by the EU from Russia and Azerbaijan have been higher in each month of 2024, compared with the corresponding months in 2023. Russian pipeline gas exports plummeted to Europe to a post-Soviet lows last year after Moscow's relations with the West reached its rock bottom since the 1962 Cuban Missile Crisis over the conflict in Ukraine. Russia supplied a total of about 63.8 billion cubic metres (bcm) of gas to Europe by various pipelines in 2022, according to Reuters calculations. The volume decreased further, by 55.6%, to 28.3 bcm last year. At their peak in 2018-19, annual flows to the region reached between 175 bcm and 180 bcm. According to Reuters calculations, Russian energy giant Gazprom's GAZP.MM average daily natural gas supplies to Europe jumped by almost 23% in June from a year earlier to 81.8 million cubic metres, rebounding from last year's post-Soviet lows, although they fell 8.6% from May. Russian pipeline gas supplies have been closely watched in recent months as Moscow's five-year gas transit deal with Ukraine expires after Dec. 31. While Russia has signalled it was willing to continue with the transit, Ukraine has said it would not renew the agreement with Moscow. (Reporting by Vladimir Soldatkin; Editing by Arun Koyyur) Related Articles Jul 22, 2024 1:45:pm EUROPE GAS-Prices inch down on comfortable stocks, Freeport LNG Jul 22, 2024 4:05:am Azerbaijan upbeat on Russian gas transit to EU via Ukraine Jul 19, 2024 12:30:pm Azerbaijan says will raise gas exports to Europe to 13 bcm in 2024 BDOW!",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Williams project clears legal hurdle for Louisiana natural gas pipeline crossings - 10/12 Industry Report",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LjEwMTJpbmR1c3RyeXJlcG9ydC5jb20vbGVnYWwvd2lsbGlhbXMtcHJvamVjdC1jbGVhcnMtbGVnYWwtaHVyZGxlLWZvci1sb3Vpc2lhbmEtbmF0dXJhbC1nYXMtcGlwZWxpbmUtY3Jvc3NpbmdzL9IBAA?oc=5",
    "Published": "Mon, 15 Jul 2024 20:04:26 GMT",
    "Categories": [],
    "Content": "Williams project clears legal hurdle for Louisiana natural gas pipeline crossings Facebook Linkedin Home Petrochemical Oil & Gas Faces of Industry Workforce Industry Focus Operations & Maintenance Safety Environmental Transport Construction & Design Newsletter 10/12 Industry Weekly Sign up for our free newsletter Store Search Get the newsletter Advertise Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. 10/12 Industry Report Home Petrochemical Oil & Gas Faces of Industry Workforce Industry Focus Operations & Maintenance Safety Environmental Transport Construction & Design Newsletter 10/12 Industry Weekly Sign up for our free newsletter Store Home Legal Williams project clears legal hurdle for Louisiana natural gas pipeline crossings Tuesday, July 16, 2024 Facebook Linkedin Email Print (iStock) A second Louisiana court has sided with Williams in its dispute with Energy Transfer LP over natural gas pipeline crossings, clearing another obstacle for the Louisiana Energy Gateway (LEG) system that would supply LNG export terminals, reports Natural Gas Intelligence . The 42nd Judicial District Court in DeSoto Parish ruled that Energy Transfer could not block Williams from constructing LEG pipeline crossings under the ETC Texas Pipeline in DeSoto and Sabine parishes in northwestern Louisiana. Williams as well as DT Midstream Inc. (DTM) and Momentum Midstream LLC have accused Energy Transfer of upending industry practices for pipeline crossings. The pipeline operators have said it is an attempt by Energy Transfer to prevent competitors from transporting natural gas from the Haynesville Shale. Energy Transfer has in turn defended its land use rights. Read more. (c) 10/12 Industry Report. All rights reserved. MORE STORIES Environmental Shell backs off increased use of 'advanced recycling' despite successful Louisiana... 10/12 Industry Report Staff",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "US natural gas pipeline ADCC begins commercial operations - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vdXMtbmF0dXJhbC1nYXMtcGlwZWxpbmUtYWRjYy1zdGFydHMtY29tbWVyY2lhbC1vcGVyYXRpb25zLTExMjEzNdIBAA?oc=5",
    "Published": "Mon, 15 Jul 2024 05:40:19 GMT",
    "Categories": [],
    "Content": "US natural gas pipeline ADCC begins commercial operations US natural gas pipeline ADCC begins commercial operations July 12 (Reuters) - Infrastructure firm WhiteWater said on Friday the ADCC pipeline in South Texas started commercial service on July 1, amid surging U.S. liquefied natural gas exports to global markets. The 40-mile pipeline has a capacity to transport about 1.7 billion cubic feet per day (bcfd) of natural gas to the Cheniere Corpus Christi Liquefaction facility from Whistler Pipeline's Agua Dulce Header in South Texas. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt ADCC is owned 70% by Whistler Pipeline - a joint venture of WhiteWater and Enbridge - and 30% by a subsidiary of Cheniere. The U.S. is forecast to export a record 12.2 bcfd of natural gas this year. It became the world's biggest LNG supplier in 2023 and has stayed ahead of recent leaders Australia and Qatar. WhiteWater said the pipeline provides Cheniere direct access to Permian and Eagle Ford volumes in addition to volumes sourced along the Gulf Coast. (Reporting by Tanay Dhumal in Bengaluru; Editing by Shilpi Majumdar and Sriraj Kalluvila) Related Articles Jul 22, 2024 2:41:pm Freeport LNG in Texas resumes exports as gas processing ramps up Jul 22, 2024 1:45:pm EUROPE GAS-Prices inch down on comfortable stocks, Freeport LNG Jul 22, 2024 11:36:am Portugal's Galp second-quarter profit jumps 16%, beats expectations BDOW!",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "New North Hamada Pipeline Boosts Libyan Oil Production - Energy Capital & Power",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZW5lcmd5Y2FwaXRhbHBvd2VyLmNvbS9uZXctbm9ydGgtaGFtYWRhLXBpcGVsaW5lLWJvb3N0cy1saWJ5YW4tb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 08:55:58 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "New North Hamada Pipeline Boosts Libyan Oil Production This website stores cookies on your computer. These cookies are used to improve your website experience and provide more personalized services to you, both on this website and through other media. To find out more about the cookies we use, see our Privacy Policy. We won't track your information when you visit our site. But in order to comply with your preferences, we'll have to use just one tiny cookie so that you're not asked to make this choice again. Accept Decline Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences Terms of Use Privacy Policy {title} New North Hamada Pipeline Boosts Libyan Oil Production Connect with us: Facebook Twitter Youtube Linkedin Instagram July 15, 2024 A new pipeline from the North Hamada oil field in Libya, developed by the Libyan National Oil Corporation (NOC)'s subsidiary, Nafusa Oil Operations, has commenced operations. On July 8, the field's production began flowing to the Mellitah oil port through the 250 km Al-Feel - Mellitah oil pipeline. In May 2024, state-owned Mellitah Oil and Gas and Nafusa Oil Operations signed an agreement for the transport, handling, and shipment of crude oil via the Al-Feel - Mellitah pipeline and completed a new shipping line. Production from the field will gradually increase, reaching 8,000 barrels per day by mid-July and 10,000 barrels per day by next August. Over the past few months, NOC has been revitalizing and rehabilitating several production sites with the goal of achieving a production rate of 2 million barrels per day by 2030. Share This Article Industry Insights TotalEnergies Divests Interest in Nigerian Joint Venture Read More >> Senegal to Implement Regulatory Framework for Electric Vehicles Read More >> Ivory Coast's $20B Infrastructure Plan to Spur Economic Growth Read More >> Anne Laure Klein Anne-Laure Klein works as a field editor for Energy Capital & Power. She graduated in Political Science with a Master's degree in International Relations and geopolitics. Before joining ECP, she worked as a Senior Account manager for International Tech and Energy companies. She is from French, Syrian and Italian descent, and fluently speaks English, French, Spanish and Italian. On a personal level, she is a seasoned traveler and has visited more than 110 countries. Trending News Articles What to Expect From First Oil in the MSGBC Region First oil from Senegal's Sangomar Field could drive an exploration resurgence in the region, along with new gas-to-power and refining projects. Read More >> News Articles From Africa to Europe: Securing Investment for Gas Export Infrastructure Supplying African gas to Europe calls for increased investments in associated export infrastructure - a focal point of the upcoming Invest in African Energy forum in Paris. Read More >> News Articles Angola Oil & Gas Summit Returns to Luanda in October, Unveiling Unprecedented Investment Opportunities in Africa's Energy Hub With substantial oil and gas reserves, an improved operating environment and a burgeoning energy industry, Angola is an attractive destination for international investors seeking opportunities in the African market. Read More >> Proud member of Supported by Sign up for latest news and event info Facebook Youtube Linkedin Instagram Events MSGBC Oil, Gas & Power Libya Energy & Economic Summit Global Black Impact Summit Services ECP Event Services ECP Creative & Marketing Custom Publishing About What is ECP? Partners What People Say News reports Careers Contact Privacy Policy · Terms of Use error: Content is protected !! Manage consent",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Katy Daily Natural Gas Price Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXNpbnRlbC5jb20vZGF0YS1zbmFwc2hvdC9kYWlseS1ncGkvRVRYS0FUWS_SAQA?oc=5",
    "Published": "Mon, 15 Jul 2024 18:47:00 GMT",
    "Categories": [],
    "Content": "Katy Daily Natural Gas Price Snapshot Daily Prices Updated Jul 22, 2024 7/22/24 ANR SE -0.1 ANR SW 0.075 Algonquin Citygate 0.02 Algonquin Citygate (non-G) 0.035 Alliance 0.105 Appalachia Regional Avg. -0.015 Atmos Zone 3 -0.09 CIG -0.06 California Regional Avg. -0.165 Cheyenne Hub -0.055 Cheyenne Hub - Other -0.065 Chicago - NIPSCO -0.03 Chicago - Nicor Gas -0.03 Chicago - Peoples 0.03 Chicago Citygate -0.025 Columbia Gas -0.085 Columbia Gulf Mainline -0.12 Columbia Gulf onshore -0.105 Consumers Energy -0.01 Cove Point -0.03 Dawn -0.02 Defiance -0.02 E. TX Regional Avg. -0.1 Eastern Gas South -0.045 El Paso - Keystone Pool -0.54 El Paso - Plains Pool -0.61 El Paso - Waha Pool -0.505 El Paso Anadarko 0.01 El Paso Bondad -0.11 El Paso Permian -0.585 El Paso S. Mainline/N. Baja -0.205 El Paso San Juan -0.1 Emerson 0.02 Empress 0.025 Enable East -0.05 Florida Gas Zone 2 -0.07 Florida Gas Zone 3 -0.105 Gulf South Pool 16 -0.03 Henry Hub -0.115 Houston Ship Channel -0.255 Iroquois, Waddington 0.02 Joliet 0.105 KRGT Del Pool -0.16 KRGT Rec Pool 0.12 Katy -0.11 Lebanon 0.015 Malin 0.215 Michigan Consolidated -0.04 Midcontinent Regional Avg. -0.02 Midwest Regional Avg. -0.015 Moss Bluff -0.04 N. LA Regional Avg. -0.07 NGPL Amarillo Mainline -0.065 NGPL Midcontinent -0.005 NGPL S. TX -0.145 NGPL TexOk -0.06 NOVA/AECO C 0.04 National Avg. -0.105 Niagara 0.01 Northeast Regional Avg. -0.02 Northern Border Ventura -0.04 Northern Natural Demarc -0.015 Northern Natural Ventura -0.02 Northwest S. of Green River -0.025 Northwest Sumas 0.03 Northwest Wyoming Pool 0.075 OGT -0.03 Oneok WesTex 0.125 Opal 0.115 PG&E Citygate -0.02 PNGTS -0.245 PNGTS Non-Border -0.245 Panhandle Eastern -0.065 Parkway/Union -0.035 Pine Prairie -0.09 REX Cheyenne Compression Pool -0.02 REX Zone 3 Delivered -0.055 REX into MGT - Edgar -0.095 REX into NGPL - Moultrie -0.04 Rocky Mtns. Regional Avg. -0.03 Rover-ANR -0.015 Ruby - Receipts 0.09 S. LA Regional Avg. -0.115 S. TX Regional Avg. -0.14 SoCal Border - Ehrenberg -0.22 SoCal Border - Kern River Station -0.18 SoCal Border - Needles -0.295 SoCal Border - Topock -0.285 SoCal Border Avg. -0.25 SoCal Citygate -0.23 Southeast Regional Avg. -0.12 Southern Border, PG&E -0.24 Southern Natural -0.165 Southern Pines -0.05 Southern Star -0.045 Stanfield 0.065 Tenn Zone 1 100L -0.185 Tenn Zone 1 St. 87 -0.185 Tenn Zone 4 200L 0.03 Tenn Zone 6 200L 0.05 Tenn Zone 6 200L South 0.05 Tennessee Line 500 -0.225 Tennessee Line 800 -0.1 Tennessee Zn 4 313 Pool 0.04 Tennessee Zn 4 Marcellus -0.055 Tennessee Zone 0 South -0.14 Texas Eastern E. LA -0.17 Texas Eastern E. TX -0.185 Texas Eastern M-2, 30 Receipt -0.035 Texas Eastern M-3, Delivery -0.01 Texas Eastern S. TX -0.1 Texas Eastern W. LA -0.085 Texas Gas Zone 1 -0.13 Transco Zone 1 -0.165 Transco Zone 2 -0.11 Transco Zone 3 St. 65 -0.11 Transco Zone 3 non-St. 65 -0.075 Transco Zone 4 -0.135 Transco Zone 5 -0.12 Transco Zone 5 North -0.115 Transco Zone 5 South -0.13 Transco Zone 6 NY 0.01 Transco Zone 6 non-NY 0.005 Transco-Leidy Line 0.02 Transwestern -0.585 Transwestern - W. TX -0.585 Transwestern San Juan -0.1 Tres Palacios -0.05 Trunkline Zone 1A -0.005 Ventura -0.03 W. TX/SE NM Regional Avg. -0.515 Waha -0.58 Westcoast Station 2 0.03 White River Hub -0.095 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Katy Daily Natural Gas Price Snapshot Select Data Type Daily Prices Bidweek Prices Forward Basis Prices Forward Fixed Prices LNG Arbitrage Spreads LNG Netback Prices LNG Vessel Rate Curves Mexico Prices - MXP Mexico Prices - $U.S. MidDay Prices Shale Prices Weekly Prices Location Katy Pointcode ETXKATY Region East Texas Avg. Price x.xxx D/D Change x.xxx Range x.xxx Volume x.xxx Deals x.xxx Select Location Agua Dulce Algonquin Citygate Algonquin Citygate (non-G) Algonquin Receipts Alliance Alliance (APC) - ATP ANR ML7 ANR SE ANR SW Appalachia Regional Avg. Atmos Zone 3 Bobcat Storage California Regional Avg. Carthage Cheyenne Hub Cheyenne Hub - Other Chicago - Nicor Gas Chicago - NIPSCO Chicago - North Shore Chicago - Peoples Chicago Citygate CIG CIG DJ Basin Columbia Gas Columbia Gulf Mainline Columbia Gulf onshore Consumers Energy Cove Point Dawn Defiance Dracut E Hereford/Pittsburg E. TX Regional Avg. Eastern Gas North Eastern Gas South Egan Hub El Paso - Keystone Pool El Paso - Plains Pool El Paso - Waha Pool El Paso Anadarko El Paso Bondad El Paso Permian El Paso S. Mainline/N. Baja El Paso San Juan Emerson Empress Enable East Enable South FGT Citygate Florida Gas Zone 1 Florida Gas Zone 2 Florida Gas Zone 3 Golden Triangle Storage Gulf South Pool 16 Henry Hub Houston Ship Channel Iroquois Zone 1 Iroquois Zone 2 Iroquois, Waddington Joliet Katy Kingsgate KRGT Del Pool KRGT Rec Pool Lebanon Malin Maritimes & Northeast Michigan Consolidated Midcontinent Regional Avg. Midwest Regional Avg. Millennium East Pool Moss Bluff MountainWest N. LA Regional Avg. National Avg. NGPL Amarillo Mainline NGPL Gulf Coast Mainline NGPL Iowa-Illinois NGPL MidAmerican NGPL Midcontinent NGPL S. TX NGPL TexOk Niagara Northeast Regional Avg. Northern Border Ventura Northern Natural Demarc Northern Natural Gas 1-7 Northern Natural Ventura Northwest S. of Green River Northwest Sumas Northwest Wyoming Pool NOVA/AECO C OGT Oneok WesTex Opal Panhandle Eastern Parkway/Union Perryville PG&E Citygate Pine Prairie PNGTS PNGTS Non-Border REX Cheyenne Compression Pool REX into ANR - Shelby REX into MGT - Edgar REX into NGPL - Moultrie REX into PEPL - Putnam REX into Trunk - Douglas REX Zone 3 Delivered Rocky Mtns. Regional Avg. Rover-ANR Rover-Panhandle Ruby - Receipts S. LA Regional Avg. S. TX Regional Avg. SoCal Border - Blythe SoCal Border - Ehrenberg SoCal Border - Kern River Station SoCal Border - Kramer SoCal Border - Needles SoCal Border - Topock SoCal Border - Wheeler Ridge SoCal Border Avg. SoCal Citygate Southeast Regional Avg. Southern Border, PG&E Southern Natural Southern Pines Southern Star Stanfield Tenn Zone 1 100L Tenn Zone 1 non-St. 87 Tenn Zone 1 St. 87 Tenn Zone 4 200L Tenn Zone 5 200L Tenn Zone 5 200L East Tenn Zone 5 200L West Tenn Zone 6 200L Tenn Zone 6 200L North Tenn Zone 6 200L South Tennessee Line 500 Tennessee Line 800 Tennessee Zn 4 313 Pool Tennessee Zn 4 Marcellus Tennessee Zone 0 North Tennessee Zone 0 South Texas Eastern E. LA Texas Eastern E. TX Texas Eastern M-1, 30 Texas Eastern M-2, 30 Receipt Texas Eastern M-3, Delivery Texas Eastern S. TX Texas Eastern W. LA Texas Eastern, M1, 24 Texas Gas Zone 1 Tolar Hub Transco Zone 1 Transco Zone 2 Transco Zone 3 non-St. 65 Transco Zone 3 St. 65 Transco Zone 4 Transco Zone 5 Transco Zone 5 North Transco Zone 5 South Transco Zone 6 non-NY Transco Zone 6 NY Transco-Leidy Line Transwestern Transwestern - Central Transwestern - W. TX Transwestern San Juan Tres Palacios Trunkline E. LA Trunkline W. LA Trunkline Zone 1A Ventura W. TX/SE NM Regional Avg. Waha Westcoast Station 2 White River Hub Want Historical Data? Check out NGI's Historical Data Download Tool. NGI offers Daily , Weekly , Bidweek , Forwards , Mexico , and MidDay Price History Data at over 200 hubs/locations back as far as 1988. Includes transactions at the Katy Hub in the Katy, TX, area. Connecting pipeline systems include Atmos, DCP Guadalupe, Duke Energy, Gulf South Pipeline Co. LLC, Houston Pipe Line Co., Kinder Morgan Texas Pipeline LLC, Kinder Morgan Tejas, Monument Pipeline LP, Natural Gas Pipeline Co. of America, Oasis Pipeline, Tennessee Gas Pipeline Co. LLC, Transcontinental Gas Pipe Line Co. and Trunkline Gas Co. LLC. Market News Natural Gas Futures Sustain Upward Climb Amid LNG Momentum, Looming Heat; Cash Prices Rally Daily Gas Price Index Natural Gas Prices 2 hours ago Natural gas futures on Monday advanced for a third consecutive session as export activity improved and forecasts advertised stronger cooling demand over the dog days of summer in August. Natural Gas Futures Rallying as LNG Rebound Encourages Bulls; Cash Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices 5 hours ago With U.S. LNG exports notching new post-Hurricane Beryl highs, natural gas futures were trading sharply higher through midday trading Monday. Natural Gas Futures Gain Ground as Freeport LNG Flows Set to Top 1 Bcf/d Daily Gas Price Index LNG Natural Gas Prices 11 hours ago Natural gas futures bounced higher in early trading Monday, supported by the continued recovery of a key Texas LNG terminal damaged by former Hurricane Beryl. Weekly Natural Gas Spot Prices Soften Alongside Slumping Futures Market Weekly Gas Price Index Natural Gas Prices July 19, 2024 Weekly natural gas cash prices drifted lower despite sizzling summer temperatures across much of the Lower 48 and maintenance work in the Permian Basin that temporarily lowered production below the century mark. Natural Gas Futures Flat Amid Demand Doubts, IT Disruptions and Weakening Cash Prices Daily Gas Price Index Natural Gas Prices July 19, 2024 With production strong and supplies in storage stout, a mixed demand outlook was not enough to further propel natural gas futures. Global information technology outages also created upheaval as trading commenced on Friday.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Adnoc Gas awards $550mn EPC contracts for UAE gas pipe project - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vYWRub2MtZ2FzLWF3YXJkcy01NTBtbi1lcGMtY29udHJhY3RzLWZvci11YWUtZ2FzLXBpcGUtcHJvamVjdC0xMTIxNDnSAQA?oc=5",
    "Published": "Mon, 15 Jul 2024 08:00:37 GMT",
    "Categories": [],
    "Content": "Adnoc Gas awards $550mn EPC contracts for UAE gas pipe project To continue reading, please sign in or subscribe Sign In Please sign in to access the full article. EMAIL PASS Sign In Forgot your password? Related Articles Jul 10, 2024 10:55:am BP, Mitsui, Shell, Total to buy 10% stake each in Adnoc's Ruwais LNG project Jul 5, 2024 12:45:pm ADNOC's Ruwais LNG to earmark 40% stake to Shell, Total, BP, Mitsui, sources say Jul 5, 2024 5:00:am ADNOC weighs possible bid for Australian gas company Santos, sources say",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline - Nairametrics",
    "Link": "https://news.google.com/rss/articles/CBMihAFodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyNC8wNy8wMi9kYW5nb3RlLXJlZmluZXJ5LWJlZ2lucy1nYXNvaWwtZXhwb3J0cy10by13ZXN0LWFmcmljYW4tY291bnRyaWVzLWFzLWltcG9ydHMtZnJvbS1ldXJvcGUtZGVjbGluZS_SAYoBaHR0cHM6Ly9uYWlyYW1ldHJpY3MuY29tLzIwMjQvMDcvMDIvZGFuZ290ZS1yZWZpbmVyeS1iZWdpbnMtZ2Fzb2lsLWV4cG9ydHMtdG8td2VzdC1hZnJpY2FuLWNvdW50cmllcy1hcy1pbXBvcnRzLWZyb20tZXVyb3BlLWRlY2xpbmUvP2FtcD0x?oc=5",
    "Published": "Mon, 15 Jul 2024 10:06:49 GMT",
    "Categories": [
      "Commodities",
      "Trade and Export"
    ],
    "Content": "Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline - Nairametrics Login Register HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: No Result View All Result Home Sectors Energy Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline by Aghogho Udi 3 weeks ago in Energy, Sectors Share on FacebookShare on TwitterShare on Linkedin Nigeria's new Dangote oil refinery is ramping up gasoil exports to West Africa, capturing market share from European refiners, according to traders and shipping data. According to Reuters, the $20 billion refinery is currently producing a lower grade of gasoil than anticipated as it awaits the restart of units necessary for producing cleaner fuels. Consequently, the refinery is seeking buyers in neighbouring markets. Related Stories Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 In May, gasoil exports from the refinery reached nearly 100,000 barrels per day (bpd), almost doubling April's levels, data from analytics firm Kpler indicated. Most of these exports were directed to other West African countries, with one shipment sent to Spain. However, preliminary data for June shows a significant drop in gasoil volumes, although overall oil product exports, including fuel oil, naphtha, and jet fuel, remained relatively high at 225,000 bpd. Decline in European exports to West Africa \"The refinery has shifted the balance in West Africa,\" impacting European markets, a European distillates trading source told Reuters. Kpler data revealed that EU and UK gasoil exports to West Africa fell to a four-year low of 29,000 bpd in May, while Russian exports to the region dropped to an eight-month low of 87,000 bpd in the same month. Dangote has been selling some high-sulphur gasoil in the Nigerian market, but a dispute has arisen with local fuel retailers over who is responsible for selling the dirtier fuel. News continues after this ad The Petroleum Industry Bill passed in 2021, mandated a sulphur content of 50 parts per million (ppm) to align with the sub-regional ECOWAS standards adopted in 2020. However, the regulator permitted the sale of gasoil with sulphur content above 200 ppm locally from the beginning of the year until June, allowing local refineries and importers more time to comply with the new standard. As European countries, including major hubs like Belgium and the Netherlands, tighten regulations on high-sulphur gasoil exports, cargoes from the Dangote refinery have found markets in regions with more lenient motor fuel standards. More Insights Earlier in May, the Chairman of the Dangote refinery, Aliko Dangote had stated that when fully completed, the refinery will supply product to West and Central African countries as its capacity is too big for Nigeria alone. This decline in gasoil exports from Europe to West Africa confirms earlier reports by Reuters which stated that the refinery has the potential to reduce the $17 billion in oil imports into the continent and even lead to the closure of some European refineries. In 2023, West Africa became the largest regional recipient of Europe's gasoline exports, receiving roughly one-third of the continent's average exports, which totalled 1.33 million barrels per day (bpd). Follow us for Breaking News and Market Intelligence. Tags: Dangote RefineryEuropean refineriesGasoilPetroleum Industry BillWest Africa Aghogho Udi My name is Aghogho Udi, a writer, journalist, and researcher, deeply intrigued by the political economy of Nigeria and the broader African context. My focus lies in shedding light on the intricate connections between macroeconomics and politics, offering valuable insights that foster comprehension of Africa's prevailing economic landscape and the world in general. Related Posts Energy Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Op-Eds Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Economy Dangote Refinery: 'Non-availability of crude oil' to domestic refineries affecting fuel quality in Nigeria - Lawmakers July 22, 2024 Energy Dangote refinery to import crude oil from Libya July 22, 2024 Energy \"Let them (NNPCL) buy me out and run the refinery\" says Aliko Dangote amid monopoly allegations July 21, 2024 Digital Media Energy Expert Kelvin Emmanuel on Dangote Refinery Challenges and NNPC's Strategic Stake. July 21, 2024 Next Post ID4D: World Bank restructures $430 million project to guarantee financing as Nigeria misses deadline Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment *Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Ad Next Stay Riding Motorbike Alone Across Laos - Beautiful Memories from LAOS - Nếm TV 40 42 00:00 00:00 / 00:00 10 Sec Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar Consultant returns N1.5 billion from NIRSAL contract to EFCC Follow us on social media: Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Download Nairametrics iOS AppDownload Nairametrics Android AppHomeMarketsSectorsEconomyBusiness NewsFinancial LiteracyDisclaimerAds Disclaimer (c) 2024 Nairametrics Welcome Back! Login to your account below Remember Me Forgotten Password? Sign Up Create New Account! Fill the forms below to register All fields are required. Log In Retrieve your password Please enter your username or email address to reset your password. Log In No Result View All Result HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Login Sign Up (c) 2024 Nairametrics Advertisement",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "ICE Low Sulphur Gasoil markets hit series of OI records - FX News Group",
    "Link": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZnhuZXdzZ3JvdXAuY29tL2ZvcmV4LW5ld3MvZXhjaGFuZ2VzL2ljZS1sb3ctc3VscGh1ci1nYXNvaWwtbWFya2V0cy1oaXQtc2VyaWVzLW9mLW9pLXJlY29yZHMv0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 12:08:12 GMT",
    "Categories": [
      "Market Trends",
      "Commodities"
    ],
    "Content": "ICE Low Sulphur Gasoil markets hit series of OI records - FX News Group Breaking News AMF and Banque de France call for coordinated move to T+1 settlement TipRanks partners with DXtrade to offer in-platform Stock Research SquaredFinancial hires ADSS alum Francis Lee as Head of Asia XTX Markets' Alex Gerko loses quant trader payouts tax case at former firm GSA Capital ATFX Executive Talks: Hormoz Faryar, Managing Director of Institutional Sales, ATFX MENA Exchanges News/ ICE News ICE Low Sulphur Gasoil markets hit series of OI records Maria Nikolova 0 Comments July 15, 2024 Intercontinental Exchange, Inc. (NYSE:ICE) today announced that its Low Sulphur Gasoil markets hit a series of open interest records through June 2024, reaching a high of 1.2 million across futures and options on July 1, 2024, equivalent to 120 million metric tons. ICE Low Sulphur Gasoil sits at the center of middle distillates trading as the global benchmark for refined oil products. Gasoil futures and options open interest is up over 40% year-over-year (y/y), with trading volumes up 30% y/y. Gasoil options activity has been performing particularly well, hitting record open interest of 234,570 contracts on July 3, while Gasoil options traded at record levels in Q2 2024 with 287,421 options traded. During Q2 2024, a record of approximately 16.2 million oil options contracts traded at ICE, including a record 13.5 million Brent options contracts. Customers can benefit from margin offsets as high as 98% when clearing ICE Gasoil alongside other oil positions at ICE. ICE Gasoil is a physically deliverable futures contract for what is now ultra-low sulphur diesel. An average of over 100,000 tons has entered the delivery process each month since the start of 2024. ICE Low Sulphur Gasoil forms part of ICE's global crude and refined product complex which includes Brent crude, the price barometer for three quarters of the world's internationally traded crude oil, alongside ICE Midland WTI (HOU), ICE WTI (Cushing), ICE Dubai (Platts), ICE Murban, as well as NY Harbor RBOB Gasoline and Heating Oil. These benchmarks are supported by over 800 related oil products, giving participants the ability to manage the price points of products at the point of consumption or production around the world. Open interest in ICE's global oil complex is up over 20% at 14 million contracts. Maria Nikolova Maria has been engaged in journalism for more than 17 years, providing Forex industry coverage for the past 10 years. Before joining FNG she was Managing Editor at FinanceFeeds. Prior to that, she worked at LeapRate. Maria has a Philosophy degree from the St. Kliment Ochridski university in Sofia. She has specialized in Cognitive Science in Vienna. Her interests include psychology, AI, and linguistics. Related Posts Exchanges News / AMF and Banque de France call for coordinated move to T+1 settlement ICE News / ICE to launch clearing service for U.S. Treasury securities and repurchasing agreements Exchanges News / LSE confirms tech issue with news publication ‹ Nasdaq approves LMAX as new Core Exchange for its suite of Crypto Indexes › TASE upgrades and expands foreign currency clearing services Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Δ We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking \"Accept\", you consent to the use of ALL the cookies. Cookie settingsACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the ... Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Business Wire",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDI0MDcwMTEyODEwMC9lbi9BZXRob24tQ29tcGxldGVzLUFjcXVpc2l0aW9uLW9mLVRlbGx1cmlhbi1VcHN0cmVhbS1hbmQtTWlkc3RyZWFtLUFzc2V0c9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:00 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets | Business Wire July 01, 2024 08:00 AM Eastern Daylight Time DALLAS--(BUSINESS WIRE)--Aethon Energy Management LLC (Aethon) today announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375,000 net acres with gathering and treating capacity of over 3 Bcf/d. Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for two metric tons per annum (mtpa) of liquified natural gas (LNG) from the Driftwood LNG project. \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for two mtpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\" \"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston. \"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of U.S. LNG as the global transition fuel and in providing energy security to America's partners around the world.\" Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel. About Aethon Energy Management Aethon Energy Management is a private investment firm and registered investment adviser that manages closed-end funds focused on acquiring, operating, and developing onshore energy resources across North America. Headquartered in Dallas, TX, Aethon has deployed more than $9 billion over a 34-year track record while generating attractive returns for its fund investors across multiple commodity price cycles. Aethon's vertically integrated strategy provides capital efficient growth, combined with disciplined risk management to support cash flow assurance. Today, Aethon is a leading, low-emission operator and one of the largest private natural gas producers and suppliers to LNG facilities in the U.S., including more than 1,700 miles of midstream infrastructure. Please visit www.AethonEnergy.com for more information. Contacts Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com Release Summary Aethon Energy announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream and midstream Haynesville assets. #Hashtags #Haynesville #LNG #NaturalGas #OilandGas Social Media Profiles Aethon Energy's LinkedIn Profile Contacts Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com Search Advanced News Search Advanced News Search Log In Sign Up",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Bedford gas leak after drilling company hits natural gas pocket - BBC.com",
    "Link": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jeHcybnc0M3A0cm_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:47:08 GMT",
    "Categories": [
      "Company News",
      "Exploration"
    ],
    "Content": "Bedford gas leak after drilling company hits natural gas pocket Skip to content HomeNewsIsrael-Gaza WarWar in UkraineUS & CanadaUKUK PoliticsEnglandN. IrelandN. Ireland PoliticsScotlandScotland PoliticsWalesWales PoliticsAfricaAsiaChinaIndiaAustraliaEuropeLatin AmericaMiddle EastIn PicturesBBC VerifySportBusinessExecutive LoungeTechnology of BusinessWomen at the HelmFuture of BusinessInnovationTechnologyScience & HealthArtificial IntelligenceAI v the MindCultureFilm & TVMusicArt & DesignStyleBooksEntertainment NewsTravelDestinationsAfricaAntarcticaAsiaAustralia and PacificCaribbean & BermudaCentral AmericaEuropeMiddle EastNorth AmericaSouth AmericaWorld's TableCulture & ExperiencesAdventuresThe SpeciaListEarthNatural WondersWeather & ScienceClimate SolutionsSustainable BusinessGreen LivingVideoLiveLive NewsLive Sport Home News Sport Business Innovation Culture Travel Earth Video Live Audio Weather Newsletters Gas leak: Roads could be closed for two days 3 July 2024 Share Google Road closures are in place at Cleat Hill, Kimbolton Road, Glenrose Avenue and Wagstaffe Close A drilling company caused a gas leak in a residential area after hitting a pocket of natural gas.Bedfordshire Fire and Rescue have been at the scene in Cleat Hill, Bedford, since 15:00 BST on Tuesday and warned nearby road closures could remain in place until Thursday.Nicholls Boreholes and Ground Source said they had been drilling a borehole for a heat pump when they \"encountered a pocket of naturally occurring gas at approximately 100 meters below ground level\". It added: \"The borehole has been temporarily capped to control the flow of gas whilst we work with the emergency services to permanently close the borehole. Bedfordshire Police put a cordon in place and assisted with road closures. Follow Beds, Herts and Bucks news on Facebook , Instagram and X . Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830 More on this story Homes evacuated after builder dug into gas pipe Homes evacuated and roads closed due to gas leak Homes evacuated over gas leak fire Related internet links Bedfordshire Fire and Rescue Service Bedfordshire Police Bedford Bedfordshire and Luton Fire and Rescue Service",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Aethon completes acquisition of Tellurian upstream and midstream assets - World Pipelines",
    "Link": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LndvcmxkcGlwZWxpbmVzLmNvbS9idXNpbmVzcy1uZXdzLzAzMDcyMDI0L2FldGhvbi1jb21wbGV0ZXMtYWNxdWlzaXRpb24tb2YtdGVsbHVyaWFuLXVwc3RyZWFtLWFuZC1taWRzdHJlYW0tYXNzZXRzL9IBggFodHRwczovL3d3dy53b3JsZHBpcGVsaW5lcy5jb20vYnVzaW5lc3MtbmV3cy8wMzA3MjAyNC9hZXRob24tY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLXRlbGx1cmlhbi11cHN0cmVhbS1hbmQtbWlkc3RyZWFtLWFzc2V0cy9hbXAv?oc=5",
    "Published": "Wed, 03 Jul 2024 08:25:02 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "Aethon completes acquisition of Tellurian upstream and midstream assets | World Pipelines For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Skip to main content Advertisement Home Business news 03 Jul 24 Aethon completes acquisition of Tellurian upstream and midstream assets Advertisement Aethon Energy Management LLC (Aethon) has announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375 000 net acres with gathering and treating capacity of over 3 billion ft 3 /d.Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for 2 metric tpa of LNG from the Driftwood LNG project. \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for 2 metric tpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\"\"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston.\"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of US LNG as the global transition fuel and in providing energy security to America's partners around the world.\"Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel. Read the article online at: https://www.worldpipelines.com/business-news/03072024/aethon-completes-acquisition-of-tellurian-upstream-and-midstream-assets/ You might also like The ADCC pipeline entered commercial service on July 1, 2024, and is capable of providing approximately 1.7 billion cubic feet per day of natural gas. Embed Embed article link: (copy the HTML code below): Aethon completes acquisition of Tellurian upstream and midstream assets xClose This content is available to registered readers of our magazine only. Please sign in or register for free. Benefits include Access to locked videos & articles Downloadable white papers Full website access Register for free >> Get started now for absolutely FREE, no credit card required. Already a member? Sign in here xClose Do you have the right tools to harness your data effectively? Join us on 17 July for a live webinar and Q&A session with dataPARC entitled 'Beyond ProcessBook & PI Vision: Exploring Today's Industrial Analytics Tools'. Register for FREE",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC ... - economica.ma",
    "Link": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2Vjb25vbWljYS5tYS9uZXdzL3VwZGF0ZWQtZHJpbGxpbmctZW5naW5lZXJpbmctYW5kLXRlY2huaWNhbC1zZXJ2aWNlcy1tYXJrZXQtc2l6ZS1hbmFseXNpcy1qZXJlaC1vaWxmaWVsZC1zZXJ2aWNlcy1ncm91cC16cGVjLXJ1dG9uZy8zNzAzNS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:02:37 GMT",
    "Categories": [
      "Market Trends",
      "Exploration"
    ],
    "Content": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong - Economica Skip to content Tuesday, July 16th, 2024 Home Contactez Nous Politique de confidentialite News [Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong Ron Curren 0 Comments 3 July 2024 Press Release, July, 2024 (Orbis Research) - The 2024 Global Drilling Engineering and Technical Services Market report focuses on comprehensive industry insights and intelligence alongside prevailing and anticipated market trends from 2024 to 2031. It also conducts an exhaustive examination encompassing pricing, current geographical regions, technology, and supply and demand dynamics, potentially impacting the growth trajectory of the trade market. Commencing with an introduction to market fundamentals such as definitions, classifications, applications, and an industry chain overview, the study proceeds to delineate product specifications, business strategies, and policies, followed by illustrations of cost structures, manufacturing processes, and the like. Subsequently, it scrutinizes market conditions across major global regions, encompassing factors like product costs, profitability, potential, manufacturing efficiency, asset utilization, supply and demand equilibrium, and industry growth rates, among others. Concluding with a project-based SWOT analysis, investment feasibility assessment, and investment return analysis, the report offers comprehensive recommendations. Request a sample report @ https://www.orbisresearch.com/contacts/request-sample/7279388 The primary objective of the Global Drilling Engineering and Technical Services Industry Study is to facilitate sustainable growth for clients by furnishing them with a thorough analysis enabling comprehension of the market's economic potential. Through a five forces analysis of the global Drilling Engineering and Technical Services market, insights into competitive dynamics are provided. This analysis assesses the bargaining power of consumers and suppliers, the threat of new entrants and substitute products, and the intensity of rivalry within the market, aiding market participants in comprehending the competitive landscape and making informed business decisions. The prognosis of the Drilling Engineering and Technical Services report is outlined as follows: Initiating with a market overview, it proceeds to examine industry advancement proposals. The Worldwide Industry 2020 study, a comprehensive and professional endeavor, disseminates market research data pertinent to both new entrants and established players, analyzing strategic planning of sector-involved entities. Additionally, it identifies SWOT analyses, revenue breakdowns, and company overviews of major market players. Trading activity projections over the next five years might depict an upward trajectory, offering insights into the future landscape for various players engaged in goods or services promotion, while considering the market's profit dynamics. Furthermore, the report conducts an evaluation and detailed interpretation potentially enticing consumers to acquire a significant share of the global industry. Drilling Engineering and Technical Services market Segmentation by Type: Offshore Drilling Onshore Drilling Drilling Engineering and Technical Services market Segmentation by Application: Oil Natural Gas Other Direct Purchase the report @ https://www.orbisresearch.com/contact/purchase-single-user/7279388 Effectively segmented into top manufacturers, geographical regions, product categories, and applications, the global Drilling Engineering and Technical Services market analysis provides in-depth insights for each category, accompanied by size forecasts for the global market and each class. Moreover, it offers a comprehensive examination of numerous industry segments, including opportunities and positioning of top players. Investors can discern actual demand for specific sectors through category-wise analyses. Numerous prominent market contenders vie within the global Drilling Engineering and Technical Services market. To attain a competitive edge, these entities employ strategies such as product innovation, strategic partnerships, acquisitions, and investments in research and development. Furthermore, they dedicate significant efforts to expanding their customer base, solidifying market positions, and delivering tailored solutions to meet individual customer needs. Key Players in the Drilling Engineering and Technical Services market: Jereh Oilfield Services Group ZPEC Rutong Sinopec CNOOC Anton Oilfield Services Group Schlumberger Haliburton Baker Hughes Renzhi Petrolor Sinogeo The objective of this report is to furnish readers with a comprehensive understanding of the global Drilling Engineering and Technical Services market, encompassing key market players, growth projections, market trends, opportunities, threats, and competitive analyses. Offering insightful assessments and valuable data, this report serves to inform business strategies, financial decisions, and market entry or expansion plans. Do You Have Any Query Or Specific Requirement? Ask to Our Industry Expert @ https://www.orbisresearch.com/contacts/enquiry-before-buying/7279388 Aids of the Global Economy Study Drilling Engineering and Technical Services: * This study offers a comprehensive examination of current trends and future predictions, elucidating factors influencing and hindering market expansion. An in-depth industry analysis based on product type and application aids in understanding globally favored products, followed by an assessment of supplier and buyer potency. Focusing on key product orders and monitoring top rivals within the market framework completes a thorough market analysis. * The study includes financial analyses, market-winning strategies, new developments, and product offerings for major vendors in the global market. It can be instrumental for vendors, affiliated business partners, and system integrators in identifying critical investment regions and formulating strategies. About Us Orbis Research (orbisresearch.com) is a single point aid for all your market research requirements. We have a vast database of reports from leading publishers and authors across the globe. We specialize in delivering customized reports as per the requirements of our clients. We have complete information about our publishers and hence are sure about the accuracy of the industries and verticals of their specialization. This helps our clients to map their needs and we produce the perfect required market research study for our clients. Hector Costello Senior Manager - Client Engagements 4144N Central Expressway, Suite 600, Dallas, Previous Post [Trends ] Agricultural Product Processing Market Growth Drivers | COFCO, Beidahuang, Shounong Food Group Next Post Offshore Drilling Engineering Services Market Latest Trends &Innovations | Transocean, Petroleos De Venezuela, COSL About the author Ron Curren Search Search Articles recents Offshore Oil and Gas Communications Market Business Insights, Key Trend Analysis | ABB Ltd., GE(Baker Hughes), CommScope Inc. Residential Router Market 2024 Trends | TP-Link, D-Link, Tenda Hybrid Photonic Integrated Circuit Market 2024 Key Insights | Infinera Corporation, NeoPhotonics Corporation, Huawei Global Programmable Application Specific Integrated Circuit (ASIC) Market Analysis and Revenue Prediction | Texas Instruments, Infineon Technologies, STMicroelectronics Vessel Tracking Systems Market 2024 [SWOT] Analysis | Big Ocean Data, ORBCOMM, SAAB Group Commentaires recents No comments to show. Archives July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 August 2023 July 2023 March 2023 February 2023 December 2022 November 2022 October 2022 September 2022 May 2022 April 2022 March 2022 February 2022 Categories Agriculture Eco International News Non classe Urbanisme Worldwide",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvYWRub2MtZXhwYW5kcy16YWt1bS1vZmZzaG9yZS1kcmlsbGluZy1mbGVldC1vdXRwdXQtYm9vc3QtZnJvbS0yMDI2LTI2NTEwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 11:41:44 GMT",
    "Categories": [
      "Production Updates",
      "Exploration"
    ],
    "Content": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 Adnoc expands Zakum offshore drilling fleet, output boost from 2026 Crude Oil 3 Jul 2024 The UAE's energy giant Adnoc is set to boost production from the giant offshore Zakum field with a further ramp up... Please Register or Sign in to view this content. Quantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon and ammonia markets. Quantum Oil service subscribers have access to: Daily price assessments Market news and price commentary Fundamental trade data Quantum Energy Daily - market report sent to your email Get in touch with us for subscription information on all Quantum platforms, or help with the service. Related Adnoc lifts Murban exports, Ruwais refinery processes more Upper Zakum Crude Oil Refined Products 1 Apr 2024 UAE oil company Adnoc has boosted volumes of the medium sour Upper Zakum crude supplied into its giant Ruwais refining complex... Adnoc L&S awarded contract for new Lower Zakum island Crude Oil 8 Jun 2023 The recently listed Adnoc Logistics and Services has been awarded its first major contract... Adnoc awards $412m drilling contract for Upper Zakum expansion Crude Oil 14 Apr 2023 The UAE's energy powerhouse Adnoc has awarded a contract to its subsidiary, Adnoc Drilling, to provide...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1kcmlmdC1sb3dlci1hZnRlci1saWdodC1laWEtc3RvcmFnZS1wcmludC1jYXNoLXdlYWtlci1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:42:55 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week. Expand Here's the latest: August Nymex natural gas futures down 2.2 cents to $2.413/MMBtu as of 2:24 p.m. ET U.S. Energy Information Administration (EIA) reports a seasonally light build of 32 Bcf for the week ending June 28 Related Tags natural gas prices Natural gas futures lng demand Sabine Pass LNG Hurricane Corpus Christi LNG Midday natural gas storage Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record. Expand At A Glance: Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure Related Tags Hurricance NYMEX matterhorn express pipeline natural gas prices Natural gas futures California Plaquemines LNG Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiiwFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL3NlbGxpbmctY29udGludWVzLWZvci1uYXR1cmFsLWdhcy1mdXR1cmVzLWNhbGlmb3JuaWEtY2FzaC1kb3duLXNoYXJwbHktZGVzcGl0ZS1oZWF0LW1pZGRheS1tYXJrZXQtc25hcHNob3Qv0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 18:55:40 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track to decline for a sixth straight session through midday trading Tuesday, undercut by cooler weather forecasts and weaker cash prices. Expand Here's the latest: August Nymex natural gas futures down 3.9 cents to $2.439/MMBtu as of 2:22 p.m. ET Back of the curve higher after a federal court in Louisiana ordered the U.S. Department of Energy (DOE) to lift LNG permit pause Related Tags NYMEX natural gas prices PG&E citygate Natural gas futures SoCal Border Avg. Biden LNG Pause Sabine Pass LNG Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "US natural gas prices fall - Markets - Business Recorder",
    "Link": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vd3d3LmJyZWNvcmRlci5jb20vbmV3cy80MDMxMTE1N9IBAA?oc=5",
    "Published": "Thu, 04 Jul 2024 00:47:12 GMT",
    "Categories": [
      "Market Trends"
    ],
    "Content": "US natural gas prices fall - Markets - Business Recorder Markets Print 2024-07-04 US natural gas prices fall Reuters Published July 4, 2024 Facebook Twitter Whatsapp Comments Follow us NEW YORK: US natural gas futures held near a seven-week low on Wednesday as the market waits for direction from what should be a bullish federal report expected to show last week's storage build was smaller than usual for an eighth week in a row. That lack of price movement came despite a bullish heat wave expected to linger over much of the country through at least mid-July and a bearish rise in output so far in July versus June and the tremendous oversupply of gas still in storage. The heat wave should prompt power generators to continue burning lots of gas to produce electricity to keep air conditioners humming. Traders said recent storage builds have been smaller than usual because several producers cut output earlier in the year after futures prices dropped to 3-1/2-year lows in February and March. Higher prices in recent weeks, however, prompted some producers, including EQT and Chesapeake Energy, to return to the well pad. Analysts forecast US utilities added 32 billion cubic feet (bcf) of gas into storage during the week ended June 28. That compares with an increase of 76 bcf in the same week last year and a five-year (2019-2023) average rise of 69 bcf for this time of year. If correct, that will leave about 19% more gas in storage than normal at this time of year. Front-month gas futures for August delivery on the New York Mercantile Exchange rose 0.8 cents, or 0.3%, to $2.443 per million British thermal units (mmBtu) at 8:45 a.m. EDT (1245 GMT). On Tuesday, the contract closed at its lowest since May 15 for a second day in a row. Recent declines in the front-month caused futures for September, which usually trade at a discount to August, to jump to a record premium of around 2.9 cents per mmBtu over the August contract. In the spot market, next-day gas prices at the Waha hub in West Texas plunged from a negative 52 cents per mmBtu for Tuesday to negative $2.06 for Wednesday as pipeline constraints trapped gas in the Permian Shale. It was the fourth time in seven days that Waha prices fell into negative territory during the current heat wave and the 21st time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 or 2022, and once in 2023. Financial firm LSEG said gas output in the Lower 48 US states rose to an average of 101.8 billion cubic feet per day (bcfd) so far in July. US natural gas Comments Comments are closed. Print Move to achieve $60bn export target: Talks begin on import tariff rationalisation US natural gas prices fall 5G spectrum auction: 11 entities submit EOIs for consultancy Cement dealers go on countrywide strike against taxes PSP of Discos cited as reason: World Bank reluctant to finance 'APMS' Monitoring, recovery of WHT: FBR advised to give field teams access to softwares of banks Oil prices fall on lingering Chinese demand concernsGovt has no mandate to impose ban on PTI: Khaqan PTI reacts strongly to govt's move FPCCI urges govt to review agreements with IPPs Reserved seats verdict: Nawaz files review petition in SC Significant discovery of hydrocarbons in Attock Read more stories Next Story ForexWorldCommodity Currency Rate USD PKR Interbank Selling / Jul 15 278.20 USD PKR Interbank Buying / Jul 15 278 USD to Japanese Yen / Jul 16 158.74 USD to Swiss Franc / Jul 16 0.90 Pound Sterling to USD / Jul 16 1.30 Euro to USD / Jul 16 1.09 Stock Volume S&P 500 / Jul 15 5,631.22 Nasdaq / Jul 15 18,472.57 FTSE 100 / Jul 15 8,182.96 Dow Jones / Jul 15 40,211.72 Germany DAX 30 / Jul 15 18,590.89 France CAC40 / Jul 15 7,632.71 India Sensex / Jul 16 80,865.30 Tokyo Nikkei / Jul 16 41,321.74 Item Value Karachi Cotton PKR/37.32 KG / Jul 15 18,535 Gold 10 Grams PKR / Jul 15 213,480 Petrol/Litre / Jul 16 275.60 Crude Oil USD/Barrel / Jul 16 81.56 Gold Spot USD/Ounce / Jul 16 2,431.24 Diesel/Litre / Jul 16 283.63 GainersLosersLeaders Stock Price 786 Invest Ltd / Jul 16 786 Investments Limited(786) 5 ▼ 0.00 (0.00%) AL-Abbas Sugar / Jul 16 Al-Abbas Sugar Mills Limited(AABS) 585 ▼ 0.00 (0.00%) Agro Allianz / Jul 16 Agro Allianz Limited(AAL) 16 ▼ 0.00 (0.00%) AL-Abid Silk / Jul 16 Al-Abid Silk Mills Limited(AASM) 3.49 ▼ 0.00 (0.00%) Ali Asghar / Jul 16 Ali Asghar Textile Mills Limited(AATM) 2.07 ▼ 0.00 (0.00%) Allied Bank / Jul 16 Allied Bank Limited(ABL) 87.10 ▼ 0.00 (0.00%) Abbott Lab. / Jul 16 Abbott Laboratories (Pakistan) Limited(ABOT) 499.34 ▼ 0.00 (0.00%) Abson Ind. / Jul 16 Abson Industries Limited(ABSON) 2.50 ▼ 0.00 (0.00%) Alfalah ETF. / Jul 16 Alfalah Consumer Index ETF.(ACIETF) 9.84 ▼ 0.00 (0.00%) Stock Price 786 Invest Ltd / Jul 16 786 Investments Limited(786) 5 ▲ 0.00 (0.00%) AL-Abbas Sugar / Jul 16 Al-Abbas Sugar Mills Limited(AABS) 585 ▲ 0.00 (0.00%) Agro Allianz / Jul 16 Agro Allianz Limited(AAL) 16 ▲ 0.00 (0.00%) AL-Abid Silk / Jul 16 Al-Abid Silk Mills Limited(AASM) 3.49 ▲ 0.00 (0.00%) Ali Asghar / Jul 16 Ali Asghar Textile Mills Limited(AATM) 2.07 ▲ 0.00 (0.00%) Allied Bank / Jul 16 Allied Bank Limited(ABL) 87.10 ▲ 0.00 (0.00%) Abbott Lab. / Jul 16 Abbott Laboratories (Pakistan) Limited(ABOT) 499.34 ▲ 0.00 (0.00%) Abson Ind. / Jul 16 Abson Industries Limited(ABSON) 2.50 ▲ 0.00 (0.00%) Alfalah ETF. / Jul 16 Alfalah Consumer Index ETF.(ACIETF) 9.84 ▲ 0.00 (0.00%) Stock Volume P.I.A.C.(A) / Jul 16 Pakistan International Airlines Corp(PIAA) 47,200,500 ▲ 0.00 Cnergyico PK / Jul 16 Cnergyico PK Limited(CNERGY) 29,719,327 ▲ 0.00 Pak Petroleum / Jul 16 Pakistan Petroleum Limited(PPL) 21,170,581 ▲ 0.00 Pak Refinery / Jul 16 Pakistan Refinery Limited(PRL) 16,965,134 ▲ 0.00 The Searle Co. / Jul 16 The Searle Company Limited(SEARL) 15,793,227 ▲ 0.00 P.T.C.L. / Jul 16 Pakistan Telecommunication Company Ltd(PTC) 15,054,641 ▲ 0.00 K-Electric Ltd. / Jul 16 K-Electric Limited(KEL) 14,145,556 ▲ 0.00 WorldCall Telecom / Jul 16 Worldcall Telecom Limited(WTL) 13,158,668 ▲ 0.00 Telecard Limited / Jul 16 Telecard Limited(TELE) 12,358,668 ▲ 0.00 Markets → Most Popular Today Yesterday Past 3 Days NJLI Sarmaya Growth Fund Rates Complaints about different projects: ADB decides to dispatch mission Govt decides to ban Pakistan Tehreek-e-Insaf Budget 2024-25: income tax calculator for FY25 Rupee registers marginal gain against US dollar Market cheers IMF bailout, KSE-100 gains over 1,200 points Pakistani, Chinese cos reach preliminary agreement to introduce solar e-bikes Challenge of lower growth: IMF bailout insufficient The illogical vilification of investors NJLI Sarmaya Growth Fund Rates PTI activist Sanam Javed rearrested after brief release, lawyer says Cement dealers announce strike against WHT Gold price per tola jumps Rs2,200 in Pakistan Trump survives assassination attempt at campaign rally after major security lapse Budget 2024-25: income tax calculator for FY25 FBR amends ST Act to harmonise it with IT law SLA on 37-month EFF: $7bn new loan deal reached with IMF FBR fails to achieve Rs9.4trn collection target NJLI Sarmaya Growth Fund Rates Gold price per tola jumps Rs2,200 in Pakistan Budget 2024-25: income tax calculator for FY25 IMF, Pakistan reach staff-level agreement on $7bn Extended Fund Facility FBR fails to achieve Rs9.4trn collection target Complaints about different projects: ADB decides to dispatch mission PTI activist Sanam Javed rearrested after brief release, lawyer says Excessive valuation of immovable properties: FTO's directive to FBR Govt decides to ban Pakistan Tehreek-e-Insaf",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high. Expand Here's the latest: August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48 The August contract started to trade below $2.500/MMBtu before 11 a.m. ET before bouncing on either side of the closely watched level into midday. \"Critical support sits at $2.50,\" EBW Analytics Group analyst Eli Rubin said. Forecasting from DTN shed 6.5 cooling degree days (CDD) from its Lower 48 forecasts over the next three weeks since Friday, equating to 10.4 Bcf lower demand, Rubin said. Maxar's Weather Desk also pointed to cooler temperatures. However, NatGasWeather painted a more mixed picture with weekend updates both shedding and adding modest amounts of CDD in the American and European weather models. Both forecasts continued to point to the hottest first half of July of the past 50 years, however, both models have tended to overestimate summer's heat \"and the expectation is they are doing so again this summer,\" NatGasWeather said. Wood Mackenzie estimated Lower 48 gas production fell to 100.0 Bcf/d on Monday, but analysts expected that number to be revised higher in later cycles because of volatility at the start of the month. Freeport LNG terminal's Train 2 was down about 15 hours from Saturday to Sunday, but flows have bounced back on Monday Cheniere Energy Inc.'s Sabine Pass liquefied natural gas export facility may have completed a round of maintenance U.S. LNG feed gas demand climbed to about 12.9 Bcf/d for Monday, highest since last Sunday, according to NGI's U.S. LNG Export Tracker Freeport staff told Texas officials that the facility's Train 2 tripped because of compressor issues. Feed gas flows fell to about 1.6 Bcf/d Saturday and 1.3 Bcf/d Sunday, NGI data show. On Monday, service regained its earlier June pace with nominations at around 1.9 Bcf/d. Kpler has a ship in berth loading and more scheduled through the week. Meanwhile, an uptick in feed gas flows to Sabine Pass over the weekend hints at the terminal wrapping up its traditional June maintenance. Flows to Sabine Pass over the weekend topped out above 4.3 Bcf on Sunday and were scheduled to be around 4.2 Bcf on Monday, NGI data show. \"The terminal could likely run a bit higher, with optimal summer flows near 4.4 Bcf/d,\" Criterion Research Inc.'s James Bevan, vice president of Research, said on online energy platform Enelyst. Elsewhere, flows to Cheniere's Corpus Christi and Sempra Infrastructure's Cameron LNG terminals were stable at about 2.3 Bcf/d and 1.9 Bcf/d, respectively, NGI data show. NGI modeling 29 Bcf injection into Lower 48 storage for week ending June 28 A print in-line with NGI's estimate for this week's U.S. Energy Information Administration (EIA) report would further eat into the Lower 48's lofty storage surplus. Last week's report showed working gas in underground storage stood at 528 Bcf, or a nearly 21% surplus to the five-year average. All but eight of the last 10 weekly injections have lagged the five-year average, narrowing the surplus from 37% in mid-April. For the week ending June 28, the five-year average is an injection of 69 Bcf, while the year-earlier period saw an 76 Bcf increase. Henry Hub spot prices lower at $2.205, down 18.5 cents, NGI's MidDay Price Alert data show Southeast weaker on cooler forecasts, West Texas prices stay negative Waha rose 8.5 cents to negative $2.035 on Monday, according to NGI's MidDay Price Alert. Transco Zone 5 in the Southeast shed 25.5 cents to average $2.560, as forecasts for the region turned cooler. Weather model runs on Monday pulled Southeast forecasts for the next 10 days below normal while the 11- to 15-day outlook is only now marginally above normal, Bevan said. The cooler look resulted in a demand loss of around 9 Bcf for the region, stacking onto losses from Thursday and Friday, Bevan said. Also likely impacting prices in the Southeast is supply from the Mountain Valley Pipeline LLC (MVP), which officially began firm transport service on Monday. The new pipeline is scheduled to deliver its highest volume yet to the Transcontinental Gas Pipe Line Co. (aka Transco) on Monday at around 0.97 Bcf/d, or nearly half its capacity, according to Wood Mackenzie flow data. Transco's Station 160 in North Carolina, which is south of the mainline's interconnect with MVP, showed southbound flows into the Southeast rose above 2 Bcf/d Monday, setting a new high for 2024, Bevan said. Related Tags natural gas prices Mountain Valley Pipeline Natural gas futures Mvp Sabine Pass Midday Transco Zone 5 Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices - World Pipelines",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy53b3JsZHBpcGVsaW5lcy5jb20vc3BlY2lhbC1yZXBvcnRzLzAyMDcyMDI0L3J5c3RhZC1lbmVyZ3ktYnVsbGlzaC1tYXJrZXQtZnVuZGFtZW50YWxzLWFyZS10aGUtbWFpbi1jb250cmlidXRpbmctZmFjdG9yLXRvLWhpZ2hlci1nbG9iYWwtb2lsLXByaWNlcy_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:38:00 GMT",
    "Categories": [
      "Market Trends"
    ],
    "Content": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices | World Pipelines For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Skip to main content Advertisement Home Special reports 02 Jul 24 Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices Advertisement Here is Rystad Energy's oil macro update from Global Market Analysis Director Claudio Galimberti: \"Strong market fundamentals are pushing oil prices higher this week, on track for four consecutive weeks of increases. Lower crude exports from OPEC and Russia, just as refinery runs ramp up for the summer peak, are helping contribute to a tighter-than-expected market, and prices are reacting accordingly. Increasingly likely interest rates cuts by the Fed in coming months and still high geopolitical risk premium are adding to the upward pressure.\" Better-than-expected market fundamentals and expectations of forthcoming interest rate cuts by the US Federal Reserve are helping keep oil prices on a bullish trajectory this week.Rystad Energy modelling suggests most of the price increases have been driven by bullish fundamentals, specifically on the refining and crude side, while macroeconomic factors and ongoing concerns regarding the escalation of conflicts in the Middle East and Ukraine have played a secondary, albeit non-negligible, role.Brent prices increased by more than 6% in June, and July is starting on a similar path.Looking at the fundamentals, we have significantly lowered our forecast for US oil production from August onwards.These adjustments reflect a downturn in Permian oil output due to ongoing low activity and consolidation through mergers and acquisitions.Most changes are concentrated on the Texas side, while New Mexico has shown resilience, although April data reflects a decline in monthly figures, averaging a fall of approximately 80 000 bpd. Overall, the downward adjustment from August 2024 through December 2025 averages about 200 000 bpd.These adjustments are bullish for Brent prices and support a narrowing of the WTI-Brent spread.It should help provide some relief for OPEC+, given the production cuts they have implemented and the planned unwinding of the voluntary reductions starting in October, for the following 12 months.Recent reports suggest OPEC+ crude exports declined in June versus May, but the latest official data showed steady exports from the Middle East and declining exports from Russia in May.If crude exports from OPEC - after accounting for changes in crude burns and refinery runs - are confirmed to have declined by somewhere between 3% and 4% in June, then that may point to greater compliance by OPEC members. However, that is still speculative.Russia's seaborne crude flows in the week to 23 June appear to have dropped by 0.66 million bpd, to the lowest in more than three months.The combined effect of lower crude exports from OPEC and Russia, right at the time when global refinery runs are expected to further rump up - from 83.1 million bpd in June to 84.4 in August - would explain the tighter crude market and the surge in Brent prices over the past three weeks.On macroeconomics, the latest data from the Bureau of Economic Analysis (BEA) showed that US inflation, measured by the personal consumption expenditures (CPE) index, eased further to 2.6% year on year in May, matching expectations. The core PCE, excluding food and fuel prices, also decreased to 2.6%, the lowest since March 2021.These figures are pivotal for the Federal Reserve's upcoming rate-setting decision on 31 July, with markets anticipating at least two quarter-point rate cuts this year, potentially starting in September. Despite the encouraging inflation data, a September cut remains uncertain as the pace of decline remains slow, which may be perceived as too gradual. On the political front, the US Presidential debate on Thursday night has dominated the airwaves.Early policy indications suggest either candidate would favour protectionist measures and large budget deficits if elected.This isn't good news for inflation, as both stances are inflationary.Energy-specific messaging was hard to identify in the debate, but it's safe to assume that a Trump administration would be pro-deregulation while Biden would continue to push policies aimed at advancing the green transition. In Europe, French President Emmanuel Macron's decision to call snap elections for the National Assembly backfired on Sunday as the National Rally party won by a significant margin in the first round of voting. Macron took a huge risk, but with the second round of voting this coming weekend, the exact fallout is still unclear.The second round of voting on 7 July will be pivotal for France's political stability and its leadership within the EU and the transatlantic community during this critical period. Read the latest issue of World Pipelines magazine for pipeline news, project stories, industry insight and technical articles. World Pipelines' June 2024 issue The June 2024 issue of World Pipelines includes a keynote section on hydrogen pipeline transport, in which Contributing Editor Gordon Cope offers a broad look at the global hydrogen pipeline market, and Atmos International discusses modelling pure hydrogen pipelines. Also in the issue: technical articles on subsea survey, pigging tool performance, HDD operations for the Trans Mountain Expansion project, and more. Read the article online at: https://www.worldpipelines.com/special-reports/02072024/rystad-energy-bullish-market-fundamentals-are-the-main-contributing-factor-to-higher-global-oil-prices/ You might also like The ADCC pipeline entered commercial service on July 1, 2024, and is capable of providing approximately 1.7 billion cubic feet per day of natural gas. Embed Embed article link: (copy the HTML code below): Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices xClose This content is available to registered readers of our magazine only. Please sign in or register for free. Benefits include Access to locked videos & articles Downloadable white papers Full website access Register for free >> Get started now for absolutely FREE, no credit card required. Already a member? Sign in here xClose Do you have the right tools to harness your data effectively? Join us on 17 July for a live webinar and Q&A session with dataPARC entitled 'Beyond ProcessBook & PI Vision: Exploring Today's Industrial Analytics Tools'. Register for FREE",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Asia's first half crude oil imports slip, undermining bullish forecasts - Reuters",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5yZXV0ZXJzLmNvbS9tYXJrZXRzL2NvbW1vZGl0aWVzL2FzaWFzLWZpcnN0LWhhbGYtY3J1ZGUtb2lsLWltcG9ydHMtc2xpcC11bmRlcm1pbmluZy1idWxsaXNoLWZvcmVjYXN0cy1ydXNzZWxsLTIwMjQtMDctMDEv0gEA?oc=5",
    "Published": "Mon, 01 Jul 2024 11:59:00 GMT",
    "Categories": [
      "Market Trends",
      "Trade and Export"
    ],
    "Content": "Google NewsOpening https://www.reuters.com/markets/commodities/asias-first-half-crude-oil-imports-slip-undermining-bullish-forecasts-russell-2024-07-01/",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "US natural gas prices ease - Markets - Business Recorder",
    "Link": "https://news.google.com/rss/articles/CBMiK2h0dHBzOi8vd3d3LmJyZWNvcmRlci5jb20vbmV3cy9hbXAvNDAzMTA5MDfSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 02:35:34 GMT",
    "Categories": [
      "Market Trends"
    ],
    "Content": "US natural gas prices ease - Markets - Business Recorder Business Recorder Jul 16, 2024 PRINT EDITION ► BR MARKETS ► Dollar to PKR ► x Home Latest BR Research Markets Business & Finance World Editorials Opinion MENA Technology Life & Style Sports Perspectives Pakistan Supplements Print US natural gas prices ease Reuters 03 Jul, 2024 Facebook Twitter Whatsapp NEW YORK: US natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row.In other news, a federal judge dealt US President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave.In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again.That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023.In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest US National Hurricane Center (NHC) outlook. Facebook Twitter Whatsapp Read Comments",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited",
    "Link": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmx1ZXByaW50Lm5nL2RhbmdvdGUtcmVmaW5lcnktY3J1ZGUtb2lsLXN1cHBseS1vcHRpb25zL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:23:30 GMT",
    "Categories": [
      "Production Updates",
      "Supply and Demand"
    ],
    "Content": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited Skip to content The international corporations drilling oil in Nigeria are the country's greatest enemies. They have never hidden their condescension for Nigeria even as they are allowed to operate the industry on their own terms. In fact, the IOCs are partially responsible for Nigeria's total dependence on imported refined petroleum products.The international oil companies (IOCs) are compelled to operate refineries in most of the countries they drill oil. In Nigeria they defiantly snubbed the federal government's directives that they should establish refineries. Their excuse was that no refinery could succeed in Nigeria because the federal government stands around to fix unacceptable pump prices for refined petroleum products.Aliko Dangote, president of the Dangote Group, and some development banks in the international money market came together to prove that the treacherous oil firms exploiting crude oil in Nigeria were telling transparent lies when they refused to establish refineries in Nigeria on the grounds that the pump prices of refined petroleum products were controlled by the federal government. The international money market advanced loans close to $9 billion to Dangote for the establishment of what is now acknowledged as one of the world's largest refineries.No one would advance such a colossal sum as a loan for a venture known to have no means of repaying the loan. The fact that the international development banks were willing to fund Dangote Refinery is a clear indication that the venture was viable and could not be bugged down by government regulation of the pump prices of refined petroleum products.The lies of the IOCs were exposed by the success in sourcing for funds to build a giant refinery in Nigeria.The mischievous oil firms were disgraced as their lies were exposed. They gnashed their teeth and proceeded to wait for Dangote and the Nigerian people down the road.The refinery they were determined to truncate came on stream in January 2024 and in apparent frustration they drew up fresh plans to sabotage the business of the refinery and keep Nigeria as a perpetual importer of refined petroleum products.They know that if Dangote Refinery succeeds, the refineries in Europe that were supplying refined petroleum products to Nigeria at a catastrophic cost of well over $20 billion annually could be out of businessThey decided to use the last weapon in their armoury to frustrate Dangote Refinery. They defiantly refused to sell crude oil to Dangote. Those who reluctantly offer to sell the feedstock put their price tag at $6 above what obtains in the international market.Consequently, Dangote has been compelled to import crude oil for his refinery from the United States of America (USA) when Nigeria remains the highest producer of crude oil in Africa.The treacherous international oil companies operating in Nigeria have finally held Dangote Refinery and the Nigerian people in the jugular.Diesel from Dangote Refinery is more expensive than the high sulfur diesels imported by independent petroleum marketers from Europe into Nigeria.The most painful aspect of the sabotage by the IOCs is that the regulator of the industry sees nothing wrong with collaborating with foreigners to frustrate a Nigerian venture designed to ease the merciless grip of European petroleum refiners on Nigerians.The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) apathetically issues licences to independent petroleum marketers to import diesel from Europe with a weak naira and torment Nigerian consumers with high energy cost that escalates the country's catastrophic inflationary trend.When newsmen confronted the agency on the illogicality of encouraging diesel imports when a Nigerian refinery is ready to supply, NMDPRA retorted that in a deregulated market, marketers are free to source diesel from anywhere.NMDPRA is the regulatory arm of the Nigerian National Petroleum Company Limited (NNPCL). The company is more or less an appendage of the mischievous international oil companies battling to protect the interest of European crude oil refiners patronised by NNPCL.NNPCL, as industry regulator, could order the deceitful IOCs to sell crude oil to Dangote Refinery at international market price. But it could only do so to the detriment of its own selfish interest.NNPCL would lose trillions of naira if Dangote Refinery gets crude oil from Nigeria and sells refined petroleum products locally at reduced pump prices.That would mean the end of the petrol subsidy scandal through which the company rakes in trillions of naira annually. That explains why NNPCL allows foreign exploiters to frustrate Dangote Refinery.NNPCL has unrestrained powers to supply crude oil to Dangote Refinery which at the moment is the only way to ease the asphyxiating hold of high energy cost on Nigeria's economy.If the treacherous IOCs defy NNPCL's directive to supply crude oil to Dangote Refinery at international market rate, the company could do the job by itself.NNPCL allocates 445,000 barrels of crude oil daily to Nigeria's moribund refineries. Nigeria's four refineries have not refined a barrel of crude oil in the last three years.Consequently, NNPCL exports the 445,000 barrels of crude oil daily to foreign refineries that feed Nigeria with refined petroleum products in return. If NNPCL reroutes the crude oil to Dangote Refinery, Nigeria would benefit extensively.The foreign refineries use the residue of the crude oil supplied by NNPCL for their petrochemical products and export them to Nigeria. If Dangote Refinery gets the crude oil, the residue would be used to produce resins that would be used to ease the escalating cost of producing plastic containers in the soft drink and brewery industries.Besides, NNPCL owes Dangote Refinery the sum of $1.7 billion as part of the 20 per cent equity it bought. It was expected to pay back with 300,000 barrels of crude oil daily. Its refusal to supply borders on betrayal of trust.It is rather saddening that Mele Kyari, the man who navigated NNPCL through the horrendous petrol subsidy scandal and crude oil theft, is still its group managing director. The man should do the right thing. WhatsApp Email LinkedIn Twitter Facebook Related Posts Saint Academy building collapse: Tears and lamentations not enough July 16, 2024July 16, 2024 Why Xi's works a key to decoding modern China and its global vision July 16, 2024July 16, 2024 Soyinka: The icon for whom apologies are unnecessary July 14, 2024July 14, 2024 About Jerry Uwah View all posts by Jerry Uwah →",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "US natgas prices ease to 6-week low on rising output, lower LNG feedgas - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vdXMtbmF0Z2FzLXByaWNlcy1kcm9wLXRvLTYtd2Vlay1sb3ctb24tcmlzaW5nLW91dHB1dC1sb3dlci1sbmctZmVlZGdhcy0xMTE5NDDSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 14:51:41 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "US natgas prices ease to 6-week low on rising output, lower LNG feedgas US natgas prices ease to 6-week low on rising output, lower LNG feedgas July 2 (Reuters) - U.S. natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt In other news, a federal judge dealt U.S. President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave. In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again. That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023. In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest U.S. National Hurricane Center (NHC) outlook. After marching across the Yucatan, the NHC projected Beryl will weaken into a tropical storm by the time it enters the Bay of Campeche in the Gulf of Mexico, where Mexico produces much of its oil, on Saturday before approaching the Texas-Mexico border on Sunday. SUPPLY AND DEMAND Financial firm LSEG said gas output in the Lower 48 U.S. states rose to an average of 101.5 billion cubic feet per day (bcfd) so far in July. That was up from an average of 100.1 bcfd in June and a 17-month low of 99.5 bcfd in May as many producers reduced drilling activities after prices fell to 3-1/2-year lows in February and March. U.S. output hit a monthly record high of 105.5 bcfd in December 2023. Meteorologists projected weather across the Lower 48 states would remain hotter than normal through at least July 17. With hotter weather expected next week, LSEG forecast average gas demand in the Lower 48, including exports, will rise from 98.5 bcfd this week to 104.5 bcfd next week. Those forecasts were lower than LSEG's outlook on Monday. Gas flows to the seven big U.S. LNG export plants fell to 12.2 bcfd so far in July, down from 12.8 bcfd in June and a monthly record high of 14.7 bcfd in December 2023. That decline was due mostly to an expected drop in feedgas at Cheniere Energy's 4.5-bcfd Sabine Pass in Louisiana to a one-week low of 3.7 bcfd on Tuesday, down from 4.1 bcfd on Monday and an average of 4.0 bcfd over the prior seven days. (Reporting by Scott DiSavino; editing by Barbara Lewis) Related Articles Jul 16, 2024 5:45:am US natgas prices drop 7% to 10-week low on Texas Freeport LNG outage Jul 16, 2024 4:45:am Australia's Vintage delays Odin-2 well completion due to heavy rainfall Jul 16, 2024 3:30:am CNOOC achieves exploration breakthrough in Bohai Bay",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMib2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbWV4aWNvLW5hdHVyYWwtZ2FzLXByb2R1Y3Rpb24tc2Vlcy11cHRpY2staW4tbWF5LWJ1dC1zdGlsbC1vZmYteWVhci1hZ28tbGV2ZWxzL9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:09:56 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Mexico's natural gas production ticked upward to 3.85 Bcf/d in May from a three-year low of 3.76 Bcf/d in April, but was down 11% year/year, government data show. State oil company Petróleos Mexicanos (Pemex) produced 3.65 Bcf/d, or 95% of total gas output last month, with private sector operators accounting for the remainder, according to upstream regulator Comisión Nacional de Hidrocarburos (CNH). The top five gas producing fields, all operated by Pemex, were Quesqui (570 MMcf/d), Ixachi (507 MMcf/d), Akal (355 MMcf/d), Maloob (138 MMcf/d) and Onel (133 MMcf/d). Associated gas tied to oil production averaged 1.99 Bcf/d, versus 1.86 Bcf/d for non-associated gas. The International Energy Agency is forecasting a major decline in oil supply from Mexico between 2024 and 2030 due to underinvestment in exploration and production (E&P). President-elect Claudia Sheinbaum has signaled her intent to continue the energy policies of her predecessor Andres Manuel López Obrador, who has sought to solidify Pemex's dominant role in E&P. Sheinbaum on Thursday (June 27) named economist Luz Elena González Escobar to be the country's next energy secretary. González Escobar said she would pursue \"an energy policy that will continue to guarantee national sovereignty and will at the same time advance the energy transition.\" López Obrador and Sheinbaum also both officially oppose hydraulic fracturing (fracking) in Mexico, despite the country's substantial prospective resources of unconventional natural gas. In a June 20 speech, CNH Chairman Agustín Díaz Lastra - a López Obrador appointee - said that exploration work should continue so that unconventional prospective resources could be reclassified as reserves. This would allow unconventional projects to be developed more quickly if fracking is authorized, Díaz indicated. Upon taking office in 2018, López Obrador canceled bid rounds that would have made onshore unconventional gas blocks available for exploration. Meanwhile, gas imports from the United States have accounted for 6.37 Bcf/d, or 72% of Mexico's total gas supply this year through June 19, up 536 MMcf/d from the same period last year, Wood Mackenzie data show. The country's overall gas demand over the same span was down 120 MMcf/d to 8.52 Bcf/d, with only the power sector showing a year/year increase in consumption. Domestic production has accounted for 2.38 Bcf/d, or 27% of Mexican gas supply this year, according to the consultancy. Pemex has consumed 1.56 Bcf/d for its own operations, including enhanced oil recovery and refining. Pemex, for its part, reported a third straight sequential decline in dry gas production from its processing centers to 1.8 Bcf/d in May. Mexico natural gas prices closely track those of the United States due to Mexico's reliance on U.S. imports. Mexico's IPGN monthly natural gas price index averaged $1.922/MMBtu in May 2024, down from $3.159 in May 2023. After slumping below $2.00for much of 2024 so far, Lower 48 natural gas prices have strengthened some with summer underway. NGI's daily Henry Hub spot price averaged $2.390 on Friday. Related Tags Mexico Exploration And Production natural gas Andrew Baker Andrew joined NGI in 2018 to support coverage of Mexico's newly liberalized oil and gas sector, and his role has since expanded to include the rest of North America. Before joining NGI, Andrew covered Latin America's hydrocarbon and electric power industries from 2014 to 2018 for Business News Americas in Santiago, Chile. He speaks fluent Spanish, and holds a B.A. in journalism and mass communications from the University of Minnesota. X AbakerNGI Email andrew.baker@naturalgasintel.com Macquarie Joining Engie to Expand Natural Gas Supplies for Mexico's Power-Hungry Yucatán Mexico Gas Price Index Mexico July 15, 2024 Macquarie Asset Management is joining Engie SA in a project to double the transport capacity on the existing 250 MMcf/d Energía Mayakan natural gas pipeline serving Mexico's Yucatán Peninsula, the companies said. Storm Season Hitting Demand in Texas, Mexico as Natural Gas Prices Slump - Spotlight Mexico Gas Price Index Mexico Natural Gas Prices July 11, 2024 The Atlantic storm season has come on strong early this year and with great force, leading to reduced demand for natural gas on both sides of the U.S.-Mexico border. Morena Landslide Could Allow Major Energy Reforms Before Mexico's AMLO Leaves Office Mexico Gas Price Index Mexico July 10, 2024 Mexico's outgoing president Andres Manuel López Obrador could still push through a regulatory overhaul of the energy sector before his successor Claudia Sheinbaum is sworn in this October, according to the Baker Institute for Public Policy's David Gantz. Eni Notches Another Mexico Upstream Discovery as Natural Gas Prices Forecast to Rise Mexico Gas Price Index E&P Natural Gas Prices July 09, 2024 Italy's Eni SpA, one of Mexico's leading private sector producers, has found more oil and associated natural gas in shallow waters offshore Mexico. Billionaire Slim's Grupo Carso to Develop Lakach Deepwater Natural Gas Field with Pemex Mexico Gas Price Index E&P Mexico July 08, 2024 Mexico's Grupo Carso, SAB de CV, a conglomerate owned by billionaire Carlos Slim, signed a services contract with state oil company Petróleos Mexicanos (Pemex) to help develop the Lakach deepwater natural gas field off Mexico's southeastern coast. Mexico Importing Record Levels of U.S. Natural Gas, but Resolving Trade Disputes Said Crucial Mexico Gas Price Index Mexico Regulatory July 03, 2024 Mexico is importing around 7 Bcf/d of natural gas from the United States this summer, but unresolved issues related to a trade treaty binding the two economies could complicate this relationship.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vZWd5cHRzLWdhcy1vdXRwdXQtYXQtNS43LWJsbi1jdWJpYy1mZWV0LXBlci1kYXktcGV0cm9sZXVtLW1pbmlzdHJ5LXNwb2tlc3BlcnNvbi1zYXlzLTExMTkzNtIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:48:14 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says CAIRO, July 1 (Reuters) - Egypt's gas production is currently at 5.7 billion cubic feet per day, the state news agency MENA quoted the spokesperson of the petroleum ministry as saying on Monday. The spokesperson also said that it was agreed that 21 liquefied natural gas cargos are to arrive in Egypt during the summer, in addition to shipments of mazut fuel. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt The first gas shipment arrived on Monday, and it is currently being discharged for supply into the national gas grid, the ministry spokesperson said. \"With the third week of July...the national gas grid's supply will be sufficient,\" he added. In June, Egypt fully awarded 20 cargoes of LNG in its biggest purchase of the seaborne fuel, aimed to cover heavy summer demand from July through September. Supplies of the natural gas that helps Egypt generate electricity have been dwindling at a time when an expanding population and urban development have been pushing up electricity demand. When temperatures rise, air conditioning use drives up power consumption. Egypt needs to import around $1.18 billion worth of natural gas and mazut fuel oil to end persistent power cuts exacerbated by consecutive heatwaves, Prime Minister Mostafa Madbouly said last month. (Reporting by Jaidaa Taha and Muhammad Al GebalyEditing by Chris Reese and Leslie Adler) Related Articles Jul 16, 2024 5:45:am US natgas prices drop 7% to 10-week low on Texas Freeport LNG outage Jul 16, 2024 4:45:am Australia's Vintage delays Odin-2 well completion due to heavy rainfall Jul 16, 2024 3:30:am CNOOC achieves exploration breakthrough in Bohai Bay",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPC Declares State of Emergency on Crude Oil Production - News Diary",
    "Link": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vbmV3c2RpYXJ5b25saW5lLmNvbS9ubnBjLWRlY2xhcmVzLXN0YXRlLW9mLWVtZXJnZW5jeS1vbi1jcnVkZS1vaWwtcHJvZHVjdGlvbi_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:58:13 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPC Declares State of Emergency on Crude Oil Production News Diary Online Sign in HomeNewsWorldSportsAfricaSociety NewsArtVideosLIVE BLOGPoliticsBusinessAgricultureIndustryOil & GasTechnologySecurityDefenceCrime & PoliceAnti-GraftJudiciaryEagle EyeReportsEducationAnalysisExclusive ReportsPress Statements / ReleasesInterviewsProjectColumnsAdagbo OnojaAkintokunbo AdejumoAli M. AliAzu IshiekweneDan AgbeseDele AgekamehFemi AdesinaGarba ShehuHakeem Baba-AhmedIssa AremuJaye GaskiaJibrin IbrahimNasir El-RufaiReuben AbatiZainab Suleiman OkinoADVERT RATESAbout Us Sign in Welcome!Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search Tuesday, July 16, 2024 Home News World Sports Africa Society News Art Videos LIVE BLOG Politics Business Agriculture Industry Oil & Gas Technology Security Defence Crime & Police Anti-Graft Judiciary Eagle Eye Reports Education Analysis Exclusive Reports Press Statements / Releases Interviews Project Columns Adagbo Onoja Akintokunbo Adejumo Ali M. Ali Azu Ishiekwene Dan Agbese Dele Agekameh Femi Adesina Garba Shehu Hakeem Baba-Ahmed Issa Aremu Jaye Gaskia Jibrin Ibrahim Nasir El-Rufai Reuben Abati Zainab Suleiman Okino ADVERT RATES About Us Facebook Instagram Twitter Vimeo Youtube Home News World Sports Africa Society News Art Videos LIVE BLOG Politics Business Agriculture Industry Oil & Gas Technology Security Defence Crime & Police Anti-Graft Judiciary Eagle Eye Reports Education Analysis Exclusive Reports Press Statements / Releases Interviews Project Columns Adagbo Onoja Akintokunbo Adejumo Ali M. Ali Azu Ishiekwene Dan Agbese Dele Agekameh Femi Adesina Garba Shehu Hakeem Baba-Ahmed Issa Aremu Jaye Gaskia Jibrin Ibrahim Nasir El-Rufai Reuben Abati Zainab Suleiman Okino ADVERT RATES About Us Search Home Anti-corruption,Governance,Election Project NNPC Declares State of Emergency on Crude Oil Production Anti-corruption,Governance,Election ProjectBusinessOil & GasReports & CommentaryProject Facebook Twitter Pinterest WhatsApp ...Calls for Collaboration to Reduce Production Cost In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" Follow Us On WhatsApp Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. EDITOR PICKS FCT Police Command Bans, Warns Against Any Form of Protest By IMN July 15, 2024 Invite CIPSMN for Talks, House Committee Directs BPP July 15, 2024 ASUP gives ultimatum for suspension of scheme of service implementation July 15, 2024 ABOUT US Newsdiaryonline is Your Newspaper for Breaking News, Investigative Stories, Interviews and Viewpoints about Nigeria.We report Entertainment, Music, Fashion, Sports stories and provide you with the latest breaking news and videos as they emerge. Contact us: [email protected] FOLLOW US Facebook Instagram Linkedin Twitter (c) NewsDiary All Right Reserved. Designed By DeedsTech. NewsPoliticsBusinessSecurityHealthCrime & Police",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost - NNPC Ltd",
    "Link": "https://news.google.com/rss/articles/CBMijQFodHRwczovL25ucGNncm91cC5jb20vaW5zaWdodHMvbm5wYy1sdGQtZGVjbGFyZXMtc3RhdGUtb2YtZW1lcmdlbmN5LW9uLWNydWRlLW9pbC1wcm9kdWN0aW9uLWNhbGxzLWZvci1jb2xsYWJvcmF0aW9uLXRvLXJlZHVjZS1wcm9kdWN0aW9uLWNvc3TSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 15:54:36 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost Who we are Investors Sustainability Our Businesses Insights contact us JULY 2, 2024 NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost PRESS RELEASE In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners, and we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner.He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry.On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country.On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" Olufemi O. Soneye Chief Corporate Communications OfficerNNPC Ltd.Abuja. July 2 nd , 2024 GCEO, NNPC Ltd, Mallam Mele Kyari, delivers a Keynote Address at the second day of the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.GCEO, NNPC Ltd, Mallam Mele Kyari (standing 7 th from left) in a group photograph with participants at the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja. Other Posts News JULY 4, 2024 Nigeria's CNG Journey Has Commenced and is Irreversible, Says Kyari ...As NNPC Plans to Build Three L... News JULY 8, 2024 Logistics Challenges, Flooding Cause of Fuel Queues ...As NNPC, Stakeholders Vow To Restore Normalcy News JULY 5, 2024 NNPC/SPDC JV Committed to Impacting Lives Through Sustainable Development Projects ...Donates Ultra-M... Energy for Today, Energy for Tomorrow (c) 2024 NNPC Limited. Never miss out on what we're up to Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. NNPC Who we are Investors Contact Terms Of Use Privacy Policy Documents Careers SERVICES Upstream Downstream Gas & Power Non-Energy New Energy SOCIAL MEDIA X Facebook Instagram Linkedin Youtube Threads (c) 2024 NNPC Limited.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper",
    "Link": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vdGhld2hpc3RsZXIubmcvcXVpY2stcmVzb2x1dGlvbi1vZi1pb2NzLWRpdmVzdG1lbnQtd2lsbC1ib29zdC1jcnVkZS1vaWwtcHJvZHVjdGlvbi1pbmRlcGVuZGVudC1wcm9kdWNlcnMtdGVsbHMtZmcv0gF-aHR0cHM6Ly90aGV3aGlzdGxlci5uZy9xdWljay1yZXNvbHV0aW9uLW9mLWlvY3MtZGl2ZXN0bWVudC13aWxsLWJvb3N0LWNydWRlLW9pbC1wcm9kdWN0aW9uLWluZGVwZW5kZW50LXByb2R1Y2Vycy10ZWxscy1mZy9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 12:13:48 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG Oil & Gas By Kasarahchi ANIAGOLU On Jul 2, 2024 File Photo : Crude Oil The Chairman, Independent Petroleum Producers Group (IPPG) Abdulrazaq Isa on Tuesday called for speedy resolution of divestment involving International Oil Companies so as to unlock crude oil productions to about 2.5 million barrels per day. Isa made the call at the Nigerian Oil and Gas (NOG) Energy Week 2024 in Abuja with the theme, \"Showcasing opportunities, driving investment and meeting energy demand.\" Advertisement He told the participants at the event that the approval of IOCs divestment will also restore global investor confidence in Nigeria at a time of huge competition for investments in the energy sector. The IPPG Chairman stated further that despite huge hydrocarbon resource base, with over 37 billion barrels of proven crude oil reserves and 207 tcf and 600 tcf of proven gas reserves, the country is currently in a situation where the daily production has significantly dropped to about 1.3 million barrels of crude oil per day and 8.5 billion standard cubic feet of gas per day respectively. This, he noted, is far below the nation's capacity, noting that Nigeria now runs the risk of partial implementation of its national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. He said, \"IPPG strongly advocates that our member companies - Seplat, the Renaissance Consortium and Oando - have the proven track record to successfully take over and manage these onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5 billion SCF of gas per day within 24 months and well over 500,000 barrels of oil per day in the long term. Advertisement \"IPPG believes the timely approval of these IOC divestment transactions will also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. \"The urgent need to address deepwater development and production by untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, Total Energies, ExxonMobil and Chevron, has the potential to unlock incremental production of 700,000 barrels per day from this terrain in the short to medium term. RELATED Economy Nigeria's Push To Attract Investments May Be Frustrated By CBN's Cash Repatriation Restriction- Analyst Jun 14, 2024 Oil & Gas Host Communities: Blocking Of IOCs Divestment Will Stifle Investments Into Nigeria's Oil & Gas Sector- NUPRC... Jun 6, 2024 \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource bases.\" Isa also the hairman and Co-Founder of Waltersmith Group of Companies called for the adoption of a national value-retention strategy, stating that Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from its domestic crude oil and gas production. He noted that this would transform the country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. Advertisement \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we can meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability. \"The development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive as Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed LNG capacity and expanding production (FLNG). \"In addition, we must expand domestic gas utilization (Gas-to-Power; Gas-Based Industries) by investing heavily to address the gas infrastructure deficit facing us today. The International Oil Companies will lead the charge on export gas while IPPG members will drive the domestic gas agenda led by NNPCL,\" he added. Isa noted that the priorities would provide the most realistic and sustainable pathway towards meeting the national long-term production aspiration of four million barrels of oil per day and 13 billion cubic feet of gas per day. IOCIPPG Share Prev Post LP Guber Candidate Akpata Campaign In Disarray As Edo Obidient Movement Switches Support For APC Next Post Ex-Senate President Wabara Bombs Obasanjo, Says I Turned Down N250m Bribe To Support Third Term Agenda Leave a comment Advertisement Sign in Home News Nigeria World News Politics Business Economy Oil & Gas Company Consumer Money & Markets Entertainment Celebrities Fashion & Style Movies Music Sports Football Athletics Tennis Other Sports Technology Hardware Mobile Software SPECIAL PUBLICATION Opinion & Interviews Lifestyle Health & Fitness Travel Fashion & Style Relationships Special Reports Welcome, Login to your account. Forget password? Remember me Sign in Recover your password. A password will be e-mailed to you.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "NNPCL declares state of emergency on crude oil production - Champion Newspapers",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY2hhbXBpb25uZXdzLmNvbS5uZy9ubnBjbC1kZWNsYXJlcy1zdGF0ZS1vZi1lbWVyZ2VuY3ktb24tY3J1ZGUtb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 00:09:15 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "NNPCL declares state of emergency on crude oil production - Champion Newspapers LTD Champion Newspapers Limited For a better society The media gateway to the East. For inquiries: Phone: +234 81 8616 6160 Email: editor.championnews@gmail.com Likes Followers Followers NNPCL declares state of emergency on crude oil production .Calls for collaboration to reduce cost .FG determined to improve oil production, says Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC EnergyLatest News 42 Share UGO AMADI In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry. Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared. According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes. He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels. He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" However, with Nigeria's oil production lagging significantly behind OPEC oil production quota, the Minister for State Petroleum Resources (Oil), Senator Heineken Lokpobiri has expressed the Federal Government's determination to improve production in the coming months. The Minister stated this when he gave his ministerial address at the ongoing 2024 NOG week Lokpobiri emphasized Nigeria's commitment to increasing oil production, adding that while Nigeria \"is not in a rush to transition away from oil, the country is actively seeking to enhance its production capabilities\". According to him, \"We are focused on ramping up our oil production . When we came to office the president was concerned in increasing production in every way. I can confidently tell you that most of the deals like Seplat -ExxonMobil deal and other issues like Malabu deal are being resolved. He highlighted the benefits of the Petroleum Industry Act (PIA), which provides a robust legal framework that guarantees returns on investments and has significantly reshaped the oil and gas sector. \"The PIA ensures a secure and profitable investment climate, making Nigeria an attractive location for investors,\" he noted. .IPPG laments delays in concluding IOCs' divestment transactions The Independent Petroleum Producers Group (IPPG) has expressed concerns over the continuos delays in concluding ongoing divestment transactions by the international oil companies (IOCs). Chairman of IPPG, Mr. Abdulrazaq Isa, raised his members' concerns yesterday in Abuja at the ongoing Nigeria Oil and Gas (NOG) Energy Week 2024, with the theme: \"Showcasing Opportunities, Driving Investment and Meeting Energy Demand\". In his industry address at the event, Isa specifically said that the long-overdrawn delays in concluding the IOCs divestment deals were costly to the Nigerian petroleum industry and extremely detrimental to the country as a whole. He appreciated President Bola Tinubu for the transformative reforms being undertaken by his administratio, pointing out specifically that the recent presidential executive orders and directives were a welcome development for the industry. \"Also of note is His Excellency's direct intervention in untangling issues in some of the long-overdrawn IOC divestment transactions - these delays have been costly to the industry and extremely detrimental to the nation as a whole. \"We are encouraged to see swift progress on implementation and some tangible results within a relatively short period of time. \"Such progressive and impactful policies are exactly what the industry has consistently clamoured for to sustainably develop and move the industry forward\", Isa stated. Notwithstanding those laudable policies and the gradual positive turnarounds being experienced, he maintained that the industry was in dire need of extraordinary focus to mitigate the genuine concerns on its long-term sustainability. According to him, despite Nigeria's world class hydrocarbon resource base of over 37 billion barrels of proven crude oil reserves and 207 trillion cubic feet (tcf) and 600 tcf of proven and contingent gas reserves respectively, we find ourselves in a situation where our daily production has significantly dropped and lies at about 1.3 million barrels of oil and 8.5 bcf of gas today. He noted that the current oil and gas production was way below Nigeria's capacity as a nation. He added that by all globally acceptable standards, this reserves to production ratio was extremely low and a clear indicator that the industry was in a dire situation. In addition, Isa noted that \"we now run the risk of partial implementation of our national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. This trend in production, according to the IPPG chair, \"portends another frightening dimension when we consider that in the not-too-distant future, our overall installed domestic refining capacity, currently closing in on about 1.2 million barrels per day, may soon outstrip our current crude oil production level with the risk of Nigeria finding itself in a position where it is unable to meet its domestic refinery crude demand or even become a net importer of crude oil, God forbid! \"It is against this scary backdrop that IPPG is calling for urgent measures to be undertaken by all relevant stakeholders to immediately arrest this dwindling production level and under-investment by focusing on the following priority areas.\" On the first priority area, he called for immediate conclusion of all pending IOC divestment transactions. Isa posited that IPPG strongly advocates that their member companies such as Seplat, the Renaissance Consortium and Oando have the proven track record to successfully take over and manage those onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5bcf of gas per day within 24 months, and well over 500,000bpd in the long term. He maintained that IPPG believes the timely approval of these IOC divestment transactions would also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. On the second priority area, Isa stressed the urgent need to address deepwater development and production in Nigeria. He said untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, TotalEnergies, ExxonMobil and Chevron has the potential to unlock incremental production of 700,000 bpd from this terrain in the short to medium term. Isa stated, \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource base. \"Priority Area 3: The adoption of a national value-retention strategy: Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from our domestic crude oil and gas production in order to transform our country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we are able to meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability.\" On the fourth priority area, the IPPG boss called for the development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive. He stressed that Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed Liquefied Natural Gas (LNG) capacity and expanding production (FLNG). .We see energy demand rising by 23% by 2045 - OPEC Meanwhile, The Organisation of the Petroleum Exporting Countries (OPEC) says energy demand will rise by an estimated 23 per cent by 2025. OPEC says the rise will be fueled by a world economy that is expected to double in size, growing from $138 trillion dollars in 2023 to $270 trillion dollars in 2045. The OPEC Secretary-General, Haitham Al Ghais, made this known on Tuesday at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition, holding in Abuja. The conference, which holds from June 30 to July 4, has its theme as \"Showcasing Opportunities, Driving Investment, Meeting Energy Demand\". Addressing the Strategic Conference via teleconference, Al Ghais explained that it forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. \"This data tells us that the world will require all forms of energy to meet long-term energy needs. \"Oil and gas will remain the predominant fuels in the energy mix. \"In fact, oil alone will retain its share at almost 30 per cent in 2045 as world demand for oil soars to an estimated 116 million barrels per day (mb/d) by that time,\" he said. To meet this rapid and robust growth in energy consumption, he said the industry would need to boost investment levels significantly in the years to come. He said according to its research, cumulative oil-related investment requirements from 2024 until 2045 would amount to $14 trillion dollars or around $610 billion dollars on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons,\" he said. Al Ghais further emphasised that indeed, the rush to adopt \"Net-Zero\" strategies was misguided and simply not realistic. The OPEC Secretary General said that developing countries would continue to balance priorities between developing their national economies and addressing climate change. In this regard, he pledged that OPEC and its member countries would continue to advocate for a fair process for adaptation, mitigation and means of implementation, with regard to climate finance and technology. He decried the fact that there were an estimated 675 million people with no access to basic forms of energy and 2.3 billion without access to clean cooking fuels. He tasked World leaders to unite and advocate for the necessary support and resources to make a difference in addressing this important matter. \"Looking ahead, OPEC will continue to enhance dialogue and cooperation with all of its energy partners, including in Africa,\" Al Ghais said. The Secretary-General, while commending President Bola Tinubu, appreciated Nigeria's staunch commitment to OPEC and to the Declaration of Cooperation. Continue Reading .Calls for collaboration to reduce cost .FG determined to improve oil productionNNPCLoilsays Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC 42 Share FacebookTwitterWhatsAppTelegram Editor 20983 posts 0 comments Prev Post 24th Milo Basketball Nat'l Championship, held in Lagos Next Post NOG: Enact enforceable local content laws to build capacity - Nestoil Limited You might also like More from author Latest News Set to flood market with petrol, Aliko says electric cars, renewable energy not... Energy SPE-NAICE 2024 to focus on midstream, downstream development Energy NEITI tasks FG on implementation of panel's report on oil theft, vandalism as... Latest News UAE lifts Visa ban on Nigerians - FG Prev Next Comments are closed. More Stories Set to flood market with petrol, Aliko says electric cars,... Jul 16, 2024 SPE-NAICE 2024 to focus on midstream, downstream development Jul 16, 2024 NEITI tasks FG on implementation of panel's report on... Jul 16, 2024 UAE lifts Visa ban on Nigerians - FG Jul 16, 2024 Prev Next 1 of 2,847 You cannot print contents of this website. Sign in Welcome, Login to your account. Login with Facebook Google Twitter Or Forget password? Remember me Sign in Recover your password. A password will be e-mailed to you.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L09QRUMtY3J1ZGUtb2lsLXByb2R1Y3Rpb24tcmVtYWlucy1zdGVhZHktZm9yLXRoaXJkLW1vbnRoLWR1ZS10by1JcmFxLVVBRS1ub24tY29tcGxpYW5jZdIBeWh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9PUEVDLWNydWRlLW9pbC1wcm9kdWN0aW9uLXJlbWFpbnMtc3RlYWR5LWZvci10aGlyZC1tb250aC1kdWUtdG8tSXJhcS1VQUUtbm9uLWNvbXBsaWFuY2U?oc=5",
    "Published": "Tue, 02 Jul 2024 10:04:38 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News Breaking News Trump to announce vice presidential pick soon Syrian businessman Mohammad Katerji killed in Israeli drone strike near Lebanon's border Human rights groups urge new Iranian president to halt lethal force against border porters Al-Hassan succeeds Plasschaert as UNAMI head in Iraq 2024-07-02T09:48:13+00:00 Share font Enable Reading Mode A- A A+ Shafaq News/ OPEC's crude oil production held steady for the third consecutive month as Iraq and the UAE failed to fully implement the agreed-upon cuts, according to a Bloomberg survey. The Organization of the Petroleum Exporting Countries produced an average of 26.98 million barrels per day in June, marking a decrease of 80,000 barrels per day from the previous month. This slight reduction was attributed to minor cuts in production from Iraq and Nigeria. The survey indicated that Iraq and the UAE did not fully comply with the cuts agreed upon at the beginning of the year with other OPEC members. Additionally, Baghdad was unable to implement the extra production cut it had pledged to compensate for previous overproduction levels. To push crude oil prices higher, the OPEC alliance may need to enforce the committed cuts fully. However, efforts to enhance compliance have shown limited results. In June, Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day. This reduction in exports brought the country closer to its assigned quota, but its production still exceeded the quota by approximately 250,000 barrels per day, even without considering additional \"compensatory cuts.\" Related News Bloomberg: Iraq reduced its oil production by 130,000 bpd Iraq boosts oil output by 40,000 bpd in May following OPEC decision Basrah crudes surge following global oil rise Basrah crudes surge despite global oil decline Kirkuk oil production surges to over 360,000 bpd EIA reports surge in Iraqi oil exports to the US Shafaq Live Shafaq Live English English Radio facebook Shafaq news english",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Massive crude oil inventory draw supports case for higher Brent - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vbmV3cy9tYXNzaXZlLWNydWRlLW9pbC1pbnZlbnRvcnktZHJhdy1zdXBwb3J0cy1jYXNlLWZvci1oaWdoZXItYnJlbnQtMjAyNDA3MDIv0gFsaHR0cHM6Ly93d3cuZm9yZXhsaXZlLmNvbS9uZXdzL21hc3NpdmUtY3J1ZGUtb2lsLWludmVudG9yeS1kcmF3LXN1cHBvcnRzLWNhc2UtZm9yLWhpZ2hlci1icmVudC0yMDI0MDcwMi9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 20:52:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": "Google NewsOpening https://www.forexlive.com/news/massive-crude-oil-inventory-draw-supports-case-for-higher-brent-20240702/",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibmh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1zZWVzYXctYWZ0ZXItdW5pbnNwaXJpbmctZWlhLXByaW50LXNpZ25zLW9mLWVhc2luZy1kZW1hbmQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 22:00:03 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August Nymex natural gas futures attempted to break a six-day losing streak, but ultimately settled slightly in the negative after the U.S. Energy Information Administration (EIA) storage print failed to inspire. Expand At A Glance: Futures slideWeather weighsCash mostly tumbles Related Tags NYMEX SoCal Citygate natural gas prices Natural gas futures lng demand Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiZ2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvYXVndXN0LW5hdHVyYWwtZ2FzLWZ1dHVyZXMtc2xpZ2h0bHktaGlnaGVyLW9uLW1vZGVzdC1laWEtc3RvcmFnZS1wcmludC_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:52:41 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter The U.S. Energy Information Administration (EIA) on Wednesday reported a 32 Bcf build of natural gas in storage for the week ended June 28. The result was within the expected range, and included a bearish revision for the prior week, limiting support for Nymex futures. Expand Ahead of the 12 p.m. ET print, the August futures contract was up 2.0 cents at $2.455/MMBtu. The prompt month ticked lower to $2.452 when the EIA data was released, a day early because of the Fourth of July holiday. About 20 minutes later, the contract stood at $2.456, up 2.1 cents from Tuesday's settlement. Prior to the report, NGI modeled a 29 Bcf build. Early estimates to Reuters ranged from builds of 13 Bcf to 76 Bcf, with an average increase of 41 Bcf. The five-year average build was 69 Bcf for the week, while a year ago it was 76 Bcf. Related Tags NYMEX natural gas prices natural gas production EIA Storage Report natural gas storage Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiamh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1jcmFzaC1iZWxvdy10ZWNobmljYWwtc3VwcG9ydC1pbnRvLW92ZXJzb2xkLXRlcnJpdG9yeS_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 13:50:39 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Crash Below Technical Support into Oversold Territory Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures have tumbled below technical support levels this week, setting the market up for a potential bounce. Expand The August New York Mercantile Exchange (Nymex) contract settled at $2.478/MMBtu Monday, down 12.3 cents from the day before and off 21% from a six-month high of $3.129 on June 11. In early trading Tuesday, August futures added to their losses, down 3.6 cents to $2.442. \"The inability to hold key support at $2.50, while not necessarily indicative of severe immediate-term downside, is a glaring indicator of the lack of bullish market appetite,\" EBW Analytics Group analyst Eli Rubin said. Related Tags NYMEX natural gas prices Natural gas futures natural gas trading Cftc Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude Oil Futures Overview - CME Group",
    "Link": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9tYXJrZXRzL2VuZXJneS9jcnVkZS1vaWwvbGlnaHQtc3dlZXQtY3J1ZGUuaHRtbNIBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:28:45 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.cmegroup.com/markets/energy/crude-oil/light-sweet-crude.html",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude oil futures settle at $82.81 - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vbmV3cy9jcnVkZS1vaWwtZnV0dXJlcy1zZXR0bGUtYXQtODI4MS0yMDI0MDcwMi_SAU1odHRwczovL3d3dy5mb3JleGxpdmUuY29tL25ld3MvY3J1ZGUtb2lsLWZ1dHVyZXMtc2V0dGxlLWF0LTgyODEtMjAyNDA3MDIvYW1wLw?oc=5",
    "Published": "Tue, 02 Jul 2024 19:09:00 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.forexlive.com/news/crude-oil-futures-settle-at-8281-20240702/",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude oil futures and settle at $83.38 - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vdGVjaG5pY2FsLWFuYWx5c2lzL2NydWRlLW9pbC1mdXR1cmVzLWFuZC1zZXR0bGUtYXQtODMzOC0yMDI0MDcwMS_SAV9odHRwczovL3d3dy5mb3JleGxpdmUuY29tL3RlY2huaWNhbC1hbmFseXNpcy9jcnVkZS1vaWwtZnV0dXJlcy1hbmQtc2V0dGxlLWF0LTgzMzgtMjAyNDA3MDEvYW1wLw?oc=5",
    "Published": "Mon, 01 Jul 2024 18:45:00 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.forexlive.com/technical-analysis/crude-oil-futures-and-settle-at-8338-20240701/",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Crude oil futures gain on spot demand - Press Trust of India",
    "Link": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnB0aW5ld3MuY29tL3N0b3J5L2J1c2luZXNzL2NydWRlLW9pbC1mdXR1cmVzLWdhaW4tb24tc3BvdC1kZW1hbmQvMTYyODkxMtIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 09:35:47 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Press Trust Of India",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions - Via News Agency",
    "Link": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdmlhLm5ld3MvbWFya2V0L25hdHVyYWwtZ2FzLWZ1dHVyZXMtYmVhcmlzaC0xOC1pbi1sYXN0LTIxLXNlc3Npb25zLTMv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:57:30 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions Skip to content Headlines Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 42 mins ago Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions 2 hours ago Nikkei 225 Rises By 6% In The Last 21 Sessions 5 hours ago Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio 6 hours ago Ameresco And 4 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 6 hours ago MFS Intermediate High Income Fund, Flaherty & Crumrine, Another 5 Companies Have A High Estimated Dividend Yield 6 hours ago HomeMarketNatural Gas Futures Bearish By 18% In The Last 21 Sessions (VIANEWS) - Natural Gas (NG) has been up by 18.78% for the last 21 sessions. At 14:52 EST on Wednesday, 3 July, Natural Gas (NG) is $2.42. Volume Today's last reported volume for Natural Gas is 116783, 99.99% below its average volume of 3235533847.76. Volatility Natural Gas's last week, last month's, and last quarter's current intraday variation average was a negative 1.89%, a negative 0.47%, and a positive 3.46%, respectively. Natural Gas's highest amplitude of average volatility was 4.77% (last week), 5.08% (last month), and 3.46% (last quarter), respectively. Commodity Price Classification According to the stochastic oscillator, a useful indicator of overbought and oversold conditions, Natural Gas's commodity is considered to be overbought (>=80). Previous days news about Natural Gas (NG) Natural gas sinks to pivotal level as China's demand slumps. According to FXStreet on Monday, 1 July, \"The move comes on the back of China cutting its Liquified Natural Gas (LNG) imports after prices rose above $3.0 in June. \" Natural gas in distress with selloff adding another leg. According to FXStreet on Tuesday, 2 July, \"Over 15% in value has already evaporated since June 25th, and more downturns could be at hand as a US judge in Louisiana issued a ruling on Monday to lift the current ban on new export licenses for Liquified Natural Gas (LNG). \" More news about Natural Gas (NG). Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Related News Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity Via News Editorial Team42 mins ago 0 Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions Via News Editorial Team2 hours ago 0 Nikkei 225 Rises By 6% In The Last 21 Sessions Via News Editorial Team5 hours ago 0 Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio Via News Editorial Team6 hours ago 0",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvanVseS1iaWR3ZWVrLW5hdHVyYWwtZ2FzLXByaWNlcy1yYWxseS1hcy1zdW1tZXItZGVtYW5kLWV4cGVjdGF0aW9ucy1lc2NhbGF0ZS_SAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:44:00 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Natural gas prices advanced in July bidweek trading as forecasts called for strong early summer heat to further intensify and cover more of the Lower 48 in the month ahead, offsetting rising production volumes and stout supplies in storage. Expand NGI's July Bidweek National Avg. climbed 40.0 cents month/month to $2.215/MMBtu. That was down from $2.560 a year earlier. Trading for the latest bidweek period spanned June 24-26. Weather conditions proved mostly hot across the southern two-thirds of the Lower 48 in that span. National Weather Service (NWS) forecasts call for more of the same through the first half of July, with the heat spreading further to the northern third of the country. NWS outlooks also repeatedly have predicted above-average national temperatures for the summer overall. \"The weather backdrop is simply bullish,\" Pinebrook Energy Advisors' Andy Huenefeld, managing partner, told NGI during bidweek. Several natural gas hubs in California and the Southwest, where scorching temperatures were widespread over the final days of June and forecasted to sizzle further in coming weeks, propelled the overall increase during bidweek. Those regions also are dependent in part on gas from the Permian Basin, where maintenance work amid pipeline constraints in June limited supplies flowing west. SoCal Citygate surged $1.335 month/month to average $3.055, and SoCal Border Avg. jumped $1.235 to $2.565. In the Southwest, KRGT Del Pool spiked $1.150 to $2.740, while El Paso S. Mainline/N. Baja rose $1.400 to $2.600. Futures prices, however, struggled in late June as traders fixated on rising production and robust inventories of gas stored underground. Production consistently held around 100 Bcf/d late last month, rising from spring lows in the mid-90s Bcf/d, according to Wood Mackenzie. The firm on Monday estimated output at 100 Bcf/d. At the same time, supplies in storage remained abundant. The U.S. Energy Information Administration (EIA) reported an injection of 52 Bcf for the week ended June 21. The increase boosted inventories to 3,097 Bcf and put stocks 21% above the five-year average of 2,569 Bcf. The futures market \"is a little bit in a wait-and-see mode, wanting to actually witness the July heat develop as forecasted,\" StoneX Financial Inc.'s Thomas Saal, senior vice president of energy, told NGI. \"Because if that heat doesn't come through, we're going to be sitting on a lot of gas.\" Futures Pressure On the final day of the latest bidweek period, the July Nymex natural gas futures contract rolled off the board with a 12.8-cent loss. It settled at $2.628 on that Wednesday, down 3% from the prior week's close. It had lost ground the previous week as well. The August contract moved to the front of the curve last Thursday and fell 6.0 cents in that session and another 8.4 cents the following day. On Monday, it settled at $2.478, down 12.3 cents. \"We remain focused on rising natural gas production in mid-summer as drillers return deferred supply to the market,\" said EBW Analytics Group's Eli Rubin, senior analyst. Any \"downturn in cooling demand could send gas tumbling.\" Still, Rubin noted the forecasts point to solid demand ahead, and on the storage front, the surplus to the five-year average has narrowed over the past two months. With the latest EIA print, the surfeit declined by two percentage points. It has been cut in half since topping 40% in March. If that continues alongside scorching mid-summer conditions, he said, futures could rally. \"In the most likely scenario, record July heat may reinforce support for gas prices, whittle down storage surpluses, and allow\" the August contract \"to rebound towards $3.00 in the near-to-medium term.\" Catalysts Ahead While rising production creates a bearish undercurrent to watch closely, Rubin also noted that several new LNG facilities are in the works along the Gulf Coast that could double liquefied natural gas demand before the end of this decade. The first of them could open later this year, launching the trend. Notably, in late June, Texas Eastern Transmission LP began feeding gas to a pending Venture Global LNG Inc. export terminal through Gator Express in Louisiana. The initial test volumes to Plaquemines LNG indicated the facility was on track \"to start exporting in late 2024,\" Wood Mackenzie analyst Nadeem Ahmed said. Rubin described the testing as \"a momentous\" for Venture Global LNG. \"The speed of the near-term ramp up at Plaquemines may offer sufficient demand for natural gas to ward off oversupply later this year,\" he said. Wood Mackenzie data showed gas flows to LNG export facilities at 12.5 Bcf on Monday, up from an average of 12 Bcf/d last week. In the near term, NWS forecasts showed hotter-than-normal high temperatures from the upper 80s to 100s canvassing large swaths of the country from the Southwest to the East Coast this week. \"The first week of July marks the approximate six weeks of the year that typically bring the hottest conditions to most of the nation,\" said AccuWeather meteorologist Alex Sosnowski. \"When temperatures exceed the historical average even by a few degrees this time of the year, the heat can be dangerous.\" For the second week of July, highs from the 80s to low 90s were expected to spread over northern markets, while temperatures in the upper 80s to 100s were predicted to remain prevalent throughout southern areas. That would mark a continuation from late June. Strong heat in the final week of the month was expected to result in a seasonally light storage injection with the next EIA report on Wednesday - a day earlier than usual this week because of the Fourth of July holiday on Thursday. Preliminary injection estimates submitted to Reuters for the week ended June 28 ranged from 13 Bcf to 76 Bcf, with an average of 41 Bcf. NGI modeled a build of 29 Bcf. That compares with a five-year average increase of 69 Bcf. With those bullish factors in play, NGI's Patrick Rau, senior vice president of Research & Analysis, said Monday that futures were \"well into oversold territory now.\" However, he added, since the August contract fell below $2.50, \"there could be some follow-on selling down toward the next technical support level in the $2.40 range.\" Related Tags natural gas production weather Kevin Dobbs Kevin Dobbs joined the staff of NGI in April 2020. Prior to that, he worked as a financial reporter and editor for S&P Global Market Intelligence, covering financial companies and markets. Earlier in his career, he served as an enterprise reporter for the Des Moines Register. He has a bachelor's degree in English from South Dakota State University. X KNatgas Email kevin.dobbs@naturalgasintel.com June Natural Gas Bidweek Prices Climb on Shrinking Storage Surplus, Forecast for Hot Summer Bidweek Survey Natural Gas Prices June 03, 2024 Natural gas prices gained upside momentum in June bidweek trading as rising temperatures ignited cooling demand, pipeline maintenance eased and modest storage injections clashed with hints of increasing production. May Bidweek Natural Gas Prices Slide as Storage Containment Worries Outmuscle Incoming Heat Bidweek Survey Natural Gas Prices May 01, 2024 Natural gas prices slipped lower in May bidweek trading as the month's expected uptick in cooling demand was upstaged by hefty inventory levels and recent bumpy performances by Gulf Coast LNG terminals. April Natural Gas Bidweek Prices Trip Lower as Spring Season Deflates Demand Bidweek Survey Natural Gas Prices April 01, 2024 Natural gas prices were modestly lower in April bidweek trading as the transition from winter to spring signaled milder weather, weakening demand and an end-of-season natural gas supply swelling to the brim. March Bidweek Natural Gas Prices Drop as Weak Weather Overshadows Production Cuts Bidweek Survey Natural Gas Prices March 01, 2024 Natural gas prices retreated in March bidweek trading as signs of declining production were eclipsed by paltry weather-driven demand and lofty levels of supply in storage. March Bidweek Trading Starts on Downslope as Weather Seen Driving Wider Storage Surplus Bidweek Survey Natural Gas Prices February 26, 2024 Hamstrung by a growing surplus of natural gas in inventories and with a spring-like February running into a mild March, traders tugged natural gas prices lower for March baseload delivery, according to NGI's Bidweek Alert (BWA). February Natural Gas Bidweek Prices Mixed Amid Demand Downshift, Production Hits Bidweek Survey Natural Gas Prices February 01, 2024 Strengthening but still lower production intersected with spring-like weather during February bidweek trading. Natural gas prices varied by region as a result, with swaths of the country impacted by lower supply and posting gains, and others reporting declines amid waning heating demand.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360",
    "Link": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnR2MzYwbmlnZXJpYS5jb20vb3BlYy1nbG9iYWwtY3J1ZGUtb2lsLWRlbWFuZC13aWxsLXJpc2UtdG8tMTE2bS1icGQtaW4tMjA0NS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:19:54 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360 Nigeria The Organisation of the Petroleum Exporting Countries (OPEC) says world demand for oil is projected to rise to an estimated 116 million barrels per day (bpd) in 2045. Haitham Al Ghais, OPEC secretary-general, spoke on Tuesday in Abuja at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition. The conference is themed 'Showcasing Opportunities, Driving Investment, Meeting Energy Demand'. Addressing the conference via teleconference, Al Ghais said the world economy is expected to double in size - growing from $138 trillion in 2023 to $270 trillion in 2045. He explained that the oil cartel forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook,\" he said. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. Al Ghais said in the upcoming years, the industry will need to significantly increase investment levels in order to keep up with the rapid and robust growth in energy consumption. He said according to its research, the total oil-related investment requirements between 2024 and 2045 would be $14 trillion or about $610 billion on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility,\" Al Ghais said. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons.\" Al Ghais pledged that OPEC and its member countries would keep pushing to advocate for a fair process for adaptation, mitigation and means of implementation with regard to climate finance and technology. The secretary-general said an estimated 675 million people lack access to basic forms of energy and 2.3 billion without access to clean cooking fuels. Al Ghais, while commending President Bola Tinubu, appreciated Nigeria's unwavering commitment to OPEC and the declaration of cooperation (DoC). Share this: Opeyemi Owoseni2 weeks ago 0 13 1 minute read Share Facebook X LinkedIn Tumblr Pinterest Reddit VKontakte Skype Messenger Messenger Share via Email Print Opeyemi Owoseni Related Articles Dangote set for production as crude supply hits 6million barrels January 9, 2024 Nigeria's oil sells at about $92 a barrel, $14 higher than FG budget benchmark April 3, 2024 Access Bank Loses CEO, Others in California Helicopter Crash February 10, 2024 Reps to Probe 'Mass Retrenchment' of CBN Workers May 30, 2024 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Check Also Close Business Tinubu appoints Agara DG NDE 3 days ago Facebook X WhatsApp Telegram Close Search for",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "India's crude oil imports from Russia touch 13-month high | DH Latest News, DH NEWS, Latest News, India, NEWS ... - East Coast Daily (English)",
    "Link": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmVhc3Rjb2FzdGRhaWx5LmluLzIwMjQvMDcvMDIvaW5kaWFzLWNydWRlLW9pbC1pbXBvcnRzLWZyb20tcnVzc2lhLXRvdWNoLTEzLW1vbnRoLWhpZ2guaHRtbNIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 15:05:00 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "India's crude oil imports from Russia touch 13-month high | DH Latest News, DH NEWS, Latest News, India, NEWS , Crude Oil import, Crude oil production, crude oil imports, crude oil exports, imported crude oil, Indian basket of crude oil, Crude Oil, crude oil prices Facebook X LinkedIn Pinterest Reddit WhatsApp Telegram New Delhi: India's crude oil imports from Russia touched 13-month high in June. Data provided by intelligence firm Vortexa showed this. As per data, India imported 2.13 million barrels of crude oil per day from Russia last month, up 7.2% from the previous month. This was the highest since May 2023 when imports from Russia stood at 2.15 million barrels per day. Imports of Urals reached their all-time high 1.6 million barrels per day in June. 'India's imports of Urals have reached an all-time high, never on record did Indian refiners buy more than 1.6 million b/d. India has resumed purchases of Russian grades from the Far East such as ESPO or Sokol, however the quantities thereof are lower than they were on average in 2023,' said Viktor Katona, lead crude analyst at Kpler. Also Read: UPI transactions surge 49 per cent to 13.89 billion in June The share of US crude in India oil imports also increased by 75% sequentially to 371,000 barrels per day last month. India imported more than 370,000 b/d of oil from the US in June, the highest since January 2023. Meanwhile, import volumes from Iraq and Saudi Arabia, the other top suppliers of crude oil to India, declined by 24% and 25% on month respectively. June imports from Saudi Arabia came in at a mere 430,000 barrels per day, the lowest monthly figure since January 2014. Saudi Arabia's market share in India's crude imports reduced to 9% last month compared to 11% in May. Iraq's crude market share, too, declined to 17% in June from 21% in May. Cumulatively, the country imported 4.74 million barrels per day of crude oil in June, marginally up from 4.67 million barrels per day imported in June 2023. Among Indian refiners, Reliance Industries bought the largest volumes of Russian crude oil in June at 542,948 barrels per day followed by the state-owned Indian Oil Corp at 453,851 barrels per day. Tags Crude Oil import Crude oil production crude oil imports crude oil exports imported crude oil Indian basket of crude oil Crude Oil crude oil prices shortlink Jul 2, 2024, 08:35 pm IST Facebook X LinkedIn Pinterest Reddit WhatsApp Telegram Facebook X LinkedIn Pinterest WhatsApp Telegram Post Your Comments Facebook X Messenger Messenger WhatsApp Telegram Back to top button Close Search for Close Search for",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "India’s crude oil imports from Russia at 12-month high in June - BusinessLine",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnRoZWhpbmR1YnVzaW5lc3NsaW5lLmNvbS9uZXdzL2luZGlhcy1jcnVkZS1vaWwtaW1wb3J0cy1mcm9tLXJ1c3NpYS1hdC0xMi1tb250aC1oaWdoLWluLWp1bmUvYXJ0aWNsZTY4MzU4NTY1LmVjZdIBgAFodHRwczovL3d3dy50aGVoaW5kdWJ1c2luZXNzbGluZS5jb20vbmV3cy9pbmRpYXMtY3J1ZGUtb2lsLWltcG9ydHMtZnJvbS1ydXNzaWEtYXQtMTItbW9udGgtaGlnaC1pbi1qdW5lL2FydGljbGU2ODM1ODU2NS5lY2UvYW1wLw?oc=5",
    "Published": "Tue, 02 Jul 2024 08:15:37 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "India's crude oil imports from Russia at 12-month high in June - The Hindu BusinessLine India's crude oil imports from Russia at 12-month high in June Updated - July 02, 2024 at 10:19 PM. Crude oil imports from Russia up by 15 per cent month-on-month, 2 per cent year-on-year By Rishi Ranjan Kala Comments Share Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit READ LATER Remove See All India's crude oil imports from Russia rose to 1.97 million barrels per day (mbpd) during June 2024, the highest since July 2023, largely due to lower cargoes to China.According to data from energy intelligence firm Vortexa, imports from Russia were up by almost 15 per cent month-on-month and 2 per cent on an annual basis. Data shows that both public and private sector refiners continued to import in record quantities from Russia.Public refiners such as Indian Oil Corporation (IOCL), Bharat Petroleum Corporation (BPCL) and Hindustan Petroleum Corporation (HPCL) imported 1.10 mbpd crude oil, which is also a 12-month high. The cargoes last month were higher by 6 per cent M-o-M. However, imports were down by almost 11 per cent on an annual basis. During May-July 2023, public refiners imported more than 1.2 mbpd on a monthly basis from Russia.Private refiners Reliance Industries (RIL) and Rosneft-backed Nayara Energy imported a record 871,200 barrels per day (bpd) from Russia in June 2024. The cargoes were higher by 28 per cent M-o-M and 20 per cent Y-o-Y. Also read Crude oil up as market expects demand boost during US travel season Consumption of transport fuels declines in June, after May's record high End of petrodollar? We wouldn't hold our breath Vortexa's head of APAC analysis Serena Huang told businessline , \"India's imports of Russian crude at 1.97 mbpd in June 2024 is the highest since last July. China's lower appetite of Russian crude has led to more barrels heading to India.\" Import momentum India's crude imports have remained robust at 4.62 mbpd in June, Huang said. \"We expect the country's crude imports to remain robust, with downside risks from softer refining margins due to slowing global oil demand,\" she added. While Indian refiners procured more barrels from Russia, cargoes from traditional suppliers in West Asia, such as Iraq and Saudi Arabia, declined.Crude oil imports from India's second largest supplier, Iraq, fell by 20 per cent M-o-M and by 3.5 per cent Y-o-Y to roughly 754,000 bpd in June 2024. The decline was steeper in in-bound shipments from Saudi Arabia at 36 per cent M-o-M and 46 per cent Y-o-Y to around 387,000 bpd. Some trade sources said that the higher official selling price (OSP) of its flagship medium sour grade Arab Light in June could have been a reason for the lower cargoes. Crude oil shipments from the US continued to rise for the second consecutive month in June 2024. India imported roughly 331,000 bpd from the US last month, compared to around 224,000 bpd in May 2024 and 112,000 bpd in April. Trade sources said the imports were of light sweet grade due to weak market fundamentals amid refinery outages in Europe. Comments SHARE Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit Published on July 2, 2024 Related Topics CRUDE OIL imports Russia You might also likeYou might also like Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per monthAccess to comment on every storySign up/Manage to our newslettersGet notified by email for early preview to new features, discounts & offers x Looks like you are already logged in from more than 3 devices! To continue logging in, remove at least one device from the below list Log outLog Out from all devicesTerms & conditions | ${ ind + 1 } ${ device }Last active - ${ la }",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  },
  {
    "Title": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes – Cores - XM",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnhtLmNvbS9yZXNlYXJjaC9tYXJrZXRzL2FsbE5ld3MvcmV1dGVycy9zcGFpbi1tYXktY3J1ZGUtb2lsLWltcG9ydHMtcmlzZS0yMzUteXktdG8tNTktbWxuLXRvbm5lcy1jb3Jlcy01Mzg3MzEyMdIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 08:19:44 GMT",
    "Categories": [
      "Trade and Export"
    ],
    "Content": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Forex, Crypto CFDs, Commodities and Stocks - 10+ Trading Platforms - 1000+ Instruments Open an Account Here Support How can we help? Choose how you'd prefer to receive support. Live Chat Live Chat Terms By using our LiveChat, you agree that any personal data provided via LiveChat will be processed by us, as per our Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat WhatsApp How to Access Scan the QR code below to start speaking with us from your smartphone or open Whatsapp on your desktop. WhatsApp Chat Terms By using the WhatsApp chat feature, you agree that any personal data provided to XM Global Limited by you through WhatsApp will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Line How to Access Scan the QR code below with your smartphone Line Chat Terms By using the Line chat feature, you agree that any personal data provided to XM Global Limited by you through Line will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Viber How to Access Scan the QR code below with your smartphone Viber Chat Terms By using the Viber chat feature, you agree that any personal data provided to XM Global Limited by you through Viber will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Telegram How to Access Scan the QR code below with your smartphone Telegram Chat Terms By using the Telegram chat feature, you agree that any personal data provided to XM Global Limited by you through Telegram will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Help Center Reuters Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Jul 3, 2024 at 8:19 am GMT <html xmlns=\"http://www.w3.org/1999/xhtml\"><head><title>BRIEF-Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores</title></head><body>July 3 (Reuters) -Cores: SPAIN MAY CRUDE OIL IMPORTS RISE 23.5% Y/Y TO 5.9 MILLION TONNES Source text: https://tinyurl.com/mvc2mjwb (Gdansk Newsroom)</body></html> Latest News View All Reuters - 26 minutes ago Richemont says quarterly sales up 1% at constant exchange rates B R S Reuters - 28 minutes ago French and Benelux stocks-Factors to watch E L S S F N U Reuters - 32 minutes ago Kazakhstan expects to tranship more Turkmen, Uzbek gas to China in 2024 Reuters - 39 minutes ago Dollar wobbles as comments of Fed's Powell put focus on Sept rate cut A E E G N U B Reuters - 45 minutes ago Nokia Oyj <NOKIA.HE> expected to post earnings of 6 cents a share - Earnings Preview N Disclaimer: The XM Group entities provide execution-only service and access to our Online Trading Facility, permitting a person to view and/or use the content available on or via the website, is not intended to change or expand on this, nor does it change or expand on this. Such access and use are always subject to: (i) Terms and Conditions; (ii) Risk Warnings; and (iii) Full Disclaimer. Such content is therefore provided as no more than general information. Particularly, please be aware that the contents of our Online Trading Facility are neither a solicitation, nor an offer to enter any transactions on the financial markets. Trading on any financial market involves a significant level of risk to your capital.All material published on our Online Trading Facility is intended for educational/informational purposes only, and does not contain - nor should it be considered as containing - financial, investment tax or trading advice and recommendations; or a record of our trading prices; or an offer of, or solicitation for, a transaction in any financial instruments; or unsolicited financial promotions to you.Any third-party content, as well as content prepared by XM, such as: opinions, news, research, analyses, prices and other information or links to third-party sites contained on this website are provided on an \"as-is\" basis, as general market commentary, and do not constitute investment advice. To the extent that any content is construed as investment research, you must note and accept that the content was not intended to and has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such, it would be considered as marketing communication under the relevant laws and regulations. Please ensure that you have read and understood our Notification on Non-Independent Investment. Research and Risk Warning concerning the foregoing information, which can be accessed here. We respect your privacy We use cookies to ensure the best possible browsing experience. Some are needed for essential features like login sessions, while others help us provide you with content and marketing more closely tailored to your needs. Accepting all cookies enables us to enhance your experience further. Please note, some of these may be third-party cookies. You can modify your cookie preferences by clicking the button below. For more information, please see our Cookie Policy. MODIFY PREFERENCES ACCEPT ALL Your cookie settings What are Cookies? Why are cookies useful? Change Settings What are Cookies? Cookies are small data files. When you visit a website, the website sends the cookie to your computer. Your computer stores it in a file located inside your web browser. Cookies do not transfer viruses or malware to your computer. Because the data in a cookie does not change when it travels back and forth, it has no way to affect how your computer runs, but they act more like logs (i.e. they record user activity and remember stateful information) and they get updated every time you visit a website. We may obtain information about you by accessing cookies, sent by our website. Different types of cookies keep track of different activities. For example, session cookies are used only when a person is actively navigating a website. Once you leave the website, the session cookie disappears. ENABLE ALL COOKIES AND CLOSE Why are cookies useful? We use functional cookies to analyse how visitors use our website, as well as track and improve our website's performance and function. This allows us to provide a high-quality customer experience by quickly identifying and fixing any issues that may arise. For example, we might use cookies to keep track of which website pages are most popular and which method of linking between website pages is most effective. The latter also helps us to track if you were referred to us by another website and improve our future advertising campaigns. Another use of cookies is to store your log in sessions, meaning that when you log in to the Members Area to deposit funds, a \"session cookie\" is set so that the website remembers that you have already logged in. If the website did not set this cookie, you will be asked for your login and password on each new page as you progress through the funding process. In addition, functional cookies, for example, are used to allow us to remember your preferences and identify you as a user, ensure your information is secure and operate more reliably and efficiently. For example, cookies save you the trouble of typing in your username every time you access our trading platform, and recall your preferences, such as which language you wish to see when you log in. Here is an overview of some of the functions our cookies provide us with: Verifying your identity and detecting the country you are currently visiting from Checking browser type and device Tracking which site the user was referred from Allowing third parties to customize content accordingly This website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses analytical cookies placed on your computer, to help the website analyze a user's use of the website. The information generated by the cookie about your use of the website (including your IP address) may be transmitted to and stored by Google on their servers. Google may use this information to evaluate your use of the website, to compile reports on website activity and to provide other services related to website activity and internet usage. Google may also transfer this information to third parties, where required to do so by law, or where such third parties process the information on behalf of Google. Google will not associate your IP address with any other data held. By using this website, you give your consent to Google to process data about you in the manner and for the purposes set out above. ENABLE ALL COOKIES AND CLOSE Change Settings Please select which types of cookies you want to be stored on your device. Functional cookies These cookies are essential for the running of our website. Without these cookies our websites would not function properly. These are saved temporarily as login information and expire once the browser is closed. Analytical cookies The information provided by analytical cookies allows us to analyse patterns of visitor behaviour and we use that information to enhance the overall experience or identify areas of the website which may require maintenance. The information is anonymous (i.e. it cannot be used to identify you and does not contain personal information such as your name and email address) and it is only used for statistical purposes. Behavioral cookies are similar to analytical and remember that you have visited a website and use that information to provide you with content which is tailored to your interests. Promotional cookies These cookies are used to track visitors across websites. The intention is to display ads that are relevant and engaging for the individual user and thereby more valuable for publishers and third party advertisers. Preferences cookies Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. ENABLE ALL COOKIES AND CLOSE SAVE SETTINGS AND CLOSE We are using cookies to give you the best experience on our website. Read more or change your cookie settings. ACCEPT ALL COOKIES Risk Warning: Your capital is at risk. Leveraged products may not be suitable for everyone. Please consider our Risk Disclosure. XM Live Chat Please enter your contact information. If you already have an XM account, please state your account ID so that our support team can provide you with the best service possible. Existing Client New Client * First Name * Last Name * E-mail * Language Start chat * First Name * Last Name * E-mail * Language Start chat",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
  }
]