"Katy Daily Natural Gas Price Snapshot Daily Prices Updated Jul 22, 2024 7/22/24 ANR SE -0.1 ANR SW 0.075 Algonquin Citygate 0.02 Algonquin Citygate (non-G) 0.035 Alliance 0.105 Appalachia Regional Avg. -0.015 Atmos Zone 3 -0.09 CIG -0.06 California Regional Avg. -0.165 Cheyenne Hub -0.055 Cheyenne Hub - Other -0.065 Chicago - NIPSCO -0.03 Chicago - Nicor Gas -0.03 Chicago - Peoples 0.03 Chicago Citygate -0.025 Columbia Gas -0.085 Columbia Gulf Mainline -0.12 Columbia Gulf onshore -0.105 Consumers Energy -0.01 Cove Point -0.03 Dawn -0.02 Defiance -0.02 E. TX Regional Avg. -0.1 Eastern Gas South -0.045 El Paso - Keystone Pool -0.54 El Paso - Plains Pool -0.61 El Paso - Waha Pool -0.505 El Paso Anadarko 0.01 El Paso Bondad -0.11 El Paso Permian -0.585 El Paso S. Mainline/N. Baja -0.205 El Paso San Juan -0.1 Emerson 0.02 Empress 0.025 Enable East -0.05 Florida Gas Zone 2 -0.07 Florida Gas Zone 3 -0.105 Gulf South Pool 16 -0.03 Henry Hub -0.115 Houston Ship Channel -0.255 Iroquois, Waddington 0.02 Joliet 0.105 KRGT Del Pool -0.16 KRGT Rec Pool 0.12 Katy -0.11 Lebanon 0.015 Malin 0.215 Michigan Consolidated -0.04 Midcontinent Regional Avg. -0.02 Midwest Regional Avg. -0.015 Moss Bluff -0.04 N. LA Regional Avg. -0.07 NGPL Amarillo Mainline -0.065 NGPL Midcontinent -0.005 NGPL S. TX -0.145 NGPL TexOk -0.06 NOVA/AECO C 0.04 National Avg. -0.105 Niagara 0.01 Northeast Regional Avg. -0.02 Northern Border Ventura -0.04 Northern Natural Demarc -0.015 Northern Natural Ventura -0.02 Northwest S. of Green River -0.025 Northwest Sumas 0.03 Northwest Wyoming Pool 0.075 OGT -0.03 Oneok WesTex 0.125 Opal 0.115 PG&E Citygate -0.02 PNGTS -0.245 PNGTS Non-Border -0.245 Panhandle Eastern -0.065 Parkway/Union -0.035 Pine Prairie -0.09 REX Cheyenne Compression Pool -0.02 REX Zone 3 Delivered -0.055 REX into MGT - Edgar -0.095 REX into NGPL - Moultrie -0.04 Rocky Mtns. Regional Avg. -0.03 Rover-ANR -0.015 Ruby - Receipts 0.09 S. LA Regional Avg. -0.115 S. TX Regional Avg. -0.14 SoCal Border - Ehrenberg -0.22 SoCal Border - Kern River Station -0.18 SoCal Border - Needles -0.295 SoCal Border - Topock -0.285 SoCal Border Avg. -0.25 SoCal Citygate -0.23 Southeast Regional Avg. -0.12 Southern Border, PG&E -0.24 Southern Natural -0.165 Southern Pines -0.05 Southern Star -0.045 Stanfield 0.065 Tenn Zone 1 100L -0.185 Tenn Zone 1 St. 87 -0.185 Tenn Zone 4 200L 0.03 Tenn Zone 6 200L 0.05 Tenn Zone 6 200L South 0.05 Tennessee Line 500 -0.225 Tennessee Line 800 -0.1 Tennessee Zn 4 313 Pool 0.04 Tennessee Zn 4 Marcellus -0.055 Tennessee Zone 0 South -0.14 Texas Eastern E. LA -0.17 Texas Eastern E. TX -0.185 Texas Eastern M-2, 30 Receipt -0.035 Texas Eastern M-3, Delivery -0.01 Texas Eastern S. TX -0.1 Texas Eastern W. LA -0.085 Texas Gas Zone 1 -0.13 Transco Zone 1 -0.165 Transco Zone 2 -0.11 Transco Zone 3 St. 65 -0.11 Transco Zone 3 non-St. 65 -0.075 Transco Zone 4 -0.135 Transco Zone 5 -0.12 Transco Zone 5 North -0.115 Transco Zone 5 South -0.13 Transco Zone 6 NY 0.01 Transco Zone 6 non-NY 0.005 Transco-Leidy Line 0.02 Transwestern -0.585 Transwestern - W. TX -0.585 Transwestern San Juan -0.1 Tres Palacios -0.05 Trunkline Zone 1A -0.005 Ventura -0.03 W. TX/SE NM Regional Avg. -0.515 Waha -0.58 Westcoast Station 2 0.03 White River Hub -0.095 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Katy Daily Natural Gas Price Snapshot Select Data Type Daily Prices Bidweek Prices Forward Basis Prices Forward Fixed Prices LNG Arbitrage Spreads LNG Netback Prices LNG Vessel Rate Curves Mexico Prices - MXP Mexico Prices - $U.S. MidDay Prices Shale Prices Weekly Prices Location Katy Pointcode ETXKATY Region East Texas Avg. Price x.xxx D/D Change x.xxx Range x.xxx Volume x.xxx Deals x.xxx Select Location Agua Dulce Algonquin Citygate Algonquin Citygate (non-G) Algonquin Receipts Alliance Alliance (APC) - ATP ANR ML7 ANR SE ANR SW Appalachia Regional Avg. Atmos Zone 3 Bobcat Storage California Regional Avg. Carthage Cheyenne Hub Cheyenne Hub - Other Chicago - Nicor Gas Chicago - NIPSCO Chicago - North Shore Chicago - Peoples Chicago Citygate CIG CIG DJ Basin Columbia Gas Columbia Gulf Mainline Columbia Gulf onshore Consumers Energy Cove Point Dawn Defiance Dracut E Hereford/Pittsburg E. TX Regional Avg. Eastern Gas North Eastern Gas South Egan Hub El Paso - Keystone Pool El Paso - Plains Pool El Paso - Waha Pool El Paso Anadarko El Paso Bondad El Paso Permian El Paso S. Mainline/N. Baja El Paso San Juan Emerson Empress Enable East Enable South FGT Citygate Florida Gas Zone 1 Florida Gas Zone 2 Florida Gas Zone 3 Golden Triangle Storage Gulf South Pool 16 Henry Hub Houston Ship Channel Iroquois Zone 1 Iroquois Zone 2 Iroquois, Waddington Joliet Katy Kingsgate KRGT Del Pool KRGT Rec Pool Lebanon Malin Maritimes & Northeast Michigan Consolidated Midcontinent Regional Avg. Midwest Regional Avg. Millennium East Pool Moss Bluff MountainWest N. LA Regional Avg. National Avg. NGPL Amarillo Mainline NGPL Gulf Coast Mainline NGPL Iowa-Illinois NGPL MidAmerican NGPL Midcontinent NGPL S. TX NGPL TexOk Niagara Northeast Regional Avg. Northern Border Ventura Northern Natural Demarc Northern Natural Gas 1-7 Northern Natural Ventura Northwest S. of Green River Northwest Sumas Northwest Wyoming Pool NOVA/AECO C OGT Oneok WesTex Opal Panhandle Eastern Parkway/Union Perryville PG&E Citygate Pine Prairie PNGTS PNGTS Non-Border REX Cheyenne Compression Pool REX into ANR - Shelby REX into MGT - Edgar REX into NGPL - Moultrie REX into PEPL - Putnam REX into Trunk - Douglas REX Zone 3 Delivered Rocky Mtns. Regional Avg. Rover-ANR Rover-Panhandle Ruby - Receipts S. LA Regional Avg. S. TX Regional Avg. SoCal Border - Blythe SoCal Border - Ehrenberg SoCal Border - Kern River Station SoCal Border - Kramer SoCal Border - Needles SoCal Border - Topock SoCal Border - Wheeler Ridge SoCal Border Avg. SoCal Citygate Southeast Regional Avg. Southern Border, PG&E Southern Natural Southern Pines Southern Star Stanfield Tenn Zone 1 100L Tenn Zone 1 non-St. 87 Tenn Zone 1 St. 87 Tenn Zone 4 200L Tenn Zone 5 200L Tenn Zone 5 200L East Tenn Zone 5 200L West Tenn Zone 6 200L Tenn Zone 6 200L North Tenn Zone 6 200L South Tennessee Line 500 Tennessee Line 800 Tennessee Zn 4 313 Pool Tennessee Zn 4 Marcellus Tennessee Zone 0 North Tennessee Zone 0 South Texas Eastern E. LA Texas Eastern E. TX Texas Eastern M-1, 30 Texas Eastern M-2, 30 Receipt Texas Eastern M-3, Delivery Texas Eastern S. TX Texas Eastern W. LA Texas Eastern, M1, 24 Texas Gas Zone 1 Tolar Hub Transco Zone 1 Transco Zone 2 Transco Zone 3 non-St. 65 Transco Zone 3 St. 65 Transco Zone 4 Transco Zone 5 Transco Zone 5 North Transco Zone 5 South Transco Zone 6 non-NY Transco Zone 6 NY Transco-Leidy Line Transwestern Transwestern - Central Transwestern - W. TX Transwestern San Juan Tres Palacios Trunkline E. LA Trunkline W. LA Trunkline Zone 1A Ventura W. TX/SE NM Regional Avg. Waha Westcoast Station 2 White River Hub Want Historical Data? Check out NGI's Historical Data Download Tool. NGI offers Daily , Weekly , Bidweek , Forwards , Mexico , and MidDay Price History Data at over 200 hubs/locations back as far as 1988. Includes transactions at the Katy Hub in the Katy, TX, area. Connecting pipeline systems include Atmos, DCP Guadalupe, Duke Energy, Gulf South Pipeline Co. LLC, Houston Pipe Line Co., Kinder Morgan Texas Pipeline LLC, Kinder Morgan Tejas, Monument Pipeline LP, Natural Gas Pipeline Co. of America, Oasis Pipeline, Tennessee Gas Pipeline Co. LLC, Transcontinental Gas Pipe Line Co. and Trunkline Gas Co. LLC. Market News Natural Gas Futures Sustain Upward Climb Amid LNG Momentum, Looming Heat; Cash Prices Rally Daily Gas Price Index Natural Gas Prices 2 hours ago Natural gas futures on Monday advanced for a third consecutive session as export activity improved and forecasts advertised stronger cooling demand over the dog days of summer in August. Natural Gas Futures Rallying as LNG Rebound Encourages Bulls; Cash Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices 5 hours ago With U.S. LNG exports notching new post-Hurricane Beryl highs, natural gas futures were trading sharply higher through midday trading Monday. Natural Gas Futures Gain Ground as Freeport LNG Flows Set to Top 1 Bcf/d Daily Gas Price Index LNG Natural Gas Prices 11 hours ago Natural gas futures bounced higher in early trading Monday, supported by the continued recovery of a key Texas LNG terminal damaged by former Hurricane Beryl. Weekly Natural Gas Spot Prices Soften Alongside Slumping Futures Market Weekly Gas Price Index Natural Gas Prices July 19, 2024 Weekly natural gas cash prices drifted lower despite sizzling summer temperatures across much of the Lower 48 and maintenance work in the Permian Basin that temporarily lowered production below the century mark. Natural Gas Futures Flat Amid Demand Doubts, IT Disruptions and Weakening Cash Prices Daily Gas Price Index Natural Gas Prices July 19, 2024 With production strong and supplies in storage stout, a mixed demand outlook was not enough to further propel natural gas futures. Global information technology outages also created upheaval as trading commenced on Friday."