"Cambodia sees 22 percent increase in imports of diesel fuel, petroleum oils We use cookies We use cookies and other tracking technologies to improve your browsing experience on our website, to show you personalized content and targeted ads, to analyze our website traffic, and to understand where our visitors are coming from. I agreeI declineChange my preferences US Europe Arab Asia Africa | Politics Economy Oil&Energy Entertainment Sport Cambodia sees 22 percent increase in imports of diesel fuel, petroleum oils Date 7/16/2024 9:06:09 AM Share on Facebook Tweet on Twitter (MENAFN) In the first half of 2024, Cambodia saw a significant increase in its imports of diesel fuel and petroleum oils, as reported by the Ministry of Commerce on Tuesday. The total value of these imports reached 1.27 billion U.S. dollars during the January-June period, marking a 22 percent rise from the 1.04 billion dollars recorded in the same period last year. The report detailed that Cambodia spent approximately 757.5 million dollars on diesel fuel and 512.5 million dollars on petroleum oils during this timeframe. This represents a 16 percent increase in spending on diesel fuel and a substantial 31 percent rise in expenditure on petroleum oils compared to the previous year.Cambodia's complete reliance on imported diesel fuel and petroleum oils stems from the fact that the country's seabed oil reserves remain untapped. The Ministry of Mines and Energy has projected that the demand for oil products in Cambodia will grow significantly, predicting an increase to 4.8 million tons by 2030 from 2.8 million tons in 2020. On Tuesday, the price of regular gasoline at gas stations was 4,300 riel (approximately 1.05 U.S. dollars) per liter, while diesel was priced at 4,200 riel (around 1.02 dollars) per liter. This rise in import values and fuel costs highlights Cambodia's growing energy needs and the economic impact of its dependency on foreign oil imports.MENAFN16072024000045015839ID1108444926 Legal Disclaimer: MENAFN provides the information \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the provider above. Tags Label Comments No comment Category Date 7/16/2024 Most popular stories New Nature Writing Genre Brings Wild And Tricky Aspects Of Climate Cri... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Jensen Huang And Mark Zuckerberg To Explore The Future Of AI And Virtu... 'We Failed': US Secret Service Admits 'Most Significant Mistake' Leadi... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... Market Research Saudi Arabia Digital Twin Market Set To Grow At Over 63.50% CAGR Until 20... United States Legionella Testing Market Expanding At A CAGR Of 9.02% Duri... Reclaimed Lumber Market Trends, Size, Share, Analysis, 2024-2032 | IMARC ... Asia Pacific Biopsy Devices Market Report, Share, Size, Growth And Foreca... Machine Translation Market Trends 2024, Leading Companies Share, Size And... Process Analyzer Market Trends, Size, Share, Analysis, 2024-2032 | IMARC ... Green Cement Market Trends, Size, Share, Analysis, 2024-2032 | IMARC Grou... More Stories UN Chief Urges Reform Of Int'l Financial System... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... Kremlin Awaits 'Concrete Action' Following Zelensky's Proposal On Negotia... UNHCR To Reduce Workforce In Lebanon Amid Budget Constraints... 4.7-Magnitude Quake Jolts Turkey... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Ananya Panday Buys Herself A Powerful New Luxury SUV... Rebounding chip shares lead US stocks higher... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... The coconut tree presidency? Harris memes break the internet... Times When Nikki Tamboli Showed Off Her SEXY Body That Took The Internet ... French Mps Avoid Shaking Hands With National Rally MP, Makes Rock-Paper-S... Newsletter Daily(English) Daily(Arabic) All() Search ******************** Home News News by Industry News by Region Americas Europe Arab World Asia Africa Press Releases Submit Your press Authors Register Submit your Articles RSS MarketData Equities Market Global Indices MENA Indices Qutoes & Charts End of Day stocks Currencies Currency Convertor Cross Rates Historical Currencies Libor Mena Stocks Stocks Search Commodoties Oil & Energy Economic Calendar Stocks Search Research Premium Research Free Research Countries Saudi Arabia UAE Bahrain Qatar Kuwait Jordan Oman Egypt Lebanon Iraq Palestine Syria Tunisia Algeria Morocco Yemen Sections Events Financial Glossary 🍪 We use cookies! Hi, this website uses essential cookies to ensure its proper operation and tracking cookies to understand how you interact with it. The latter will be set only after consent. Let me choose Accept allReject all Cookie usage 📢 I use cookies to ensure the basic functionalities of the website and to enhance your online experience. You can choose for each category to opt-in/out whenever you want. For more details relative to cookies and other sensitive data, please read the full privacy policy. Strictly necessary cookiesStrictly necessary cookies These cookies are essential for the proper functioning of my website. Without these cookies, the website would not work properly Performance and Analytics cookiesPerformance and Analytics cookies These cookies allow the website to remember the choices you have made in the past NameDomainExpirationDescription^_gagoogle.com2 yearsdescription ..._gidgoogle.com1 daydescription ... Advertisement and Targeting cookiesAdvertisement and Targeting cookies These cookies collect information about how you use the website, which pages you visited and which links you clicked on. All of the data is anonymized and cannot be used to identify you More information For any queries in relation to my policy on cookies and your choices, please contact us. Accept allReject allSave settings"