"Biden seeks public input on expanding protected areas in Alaska petroleum reserve - Eye on the Arctic Please be advised that we use cookies to operate and enhance our services as well as for advertising purposes. We value your privacy. If you are not comfortable with us using this information, please review your settings before continuing your visit. Manage your navigation settings Find out more * Featured * Featured * Zone 3 General News Politics Politics (USA) USA Liz Ruskin, Alaska Public Media Posted: Monday, July 15, 2024 at 09:19 0 Comments FacebookTwitterWhatsAppEmailPrintFriendly A file photo of a site in the National Petroleum Reserve on Alaska's North Slope. (Mark Thiessen/AP/CP) The Biden administration is wasting no time making use of a new conservation rule for the National Petroleum Reserve-Alaska. It's asking for public comment on whether to add acreage to the \"special areas\" of the reserve, where oil and gas development is restricted. The reserve is a tract of federal land in the Western Arctic that's the size of Indiana. About half of it is in special areas, designated as valuable for migratory birds, caribou and marine mammals that use it, and for subsistence hunting. The government finalized a rule in April that calls for maximum protection of resources in these areas. The rule also says the government can review the designations and consider changing their borders or adding new special areas. Possibility of new restrictions The Bureau of Land Management's announcement Friday of a 60-day comment period is the first step toward toward possibly expanding the special areas or adding more restrictions. Despite its name, which reflects the federal government's original interest in the land, the petroleum reserve is a key battleground for environmental groups and for advocates of the oil industry. It is the site of oilfields ConocoPhillips is developing as part of its massive Willow project, which the new rule does not block. National environmental groups cheered today's announcement. The state of Alaska, ConocoPhillips and a North Slope advocacy group called Voice of the Arctic Inupiat has lawsuits underway seeking to overturn the new NPR-A rule. Related stories from around the North: Norway: Norway's oil minister: \"We need new discoveries\", The Independent Barents Observer Russia : Novatek sends 200 engineers to shipyard due to urgent need for more Arctic tankers, The Independent Barents Observer United States : Voice of the Arctic Iñupiat sues to overturn NPR-A rule, Alaska Public Media FacebookTwitterWhatsAppEmailPrintFriendly Arctic, Bureau of Land Management, ConocoPhillips, Iñupiat, National Petroleum Reserve-Alaska, North Slope ← CRTC fibre internet funding, but Nunavut communities question implementation Hay River's Polar Eggs are back on store shelves in the N.W.T. → Liz Ruskin, Alaska Public Media For more news from Alaska visit Alaska Public Media. You May Also Like Alaska: Mushers frustrated over cell phones on Iditarod trail Zachariah Hughes, Alaska Public Media Posted: Monday, October 31, 2016 at 14:40 0 Comments Blog: Northern Canada doesn't have a university ... Does it need one? Heather Exner-Pirot Posted: Friday, July 10, 2015 at 18:16 - Last Updated: Monday, July 13, 2015 at 20:22 0 Comments Admiral Moiseev takes over as Commander-in-Chief of the Russian Navy:Izvestia Thomas Nilsen, The Independent Barents Observer Posted: Monday, March 11, 2024 at 10:55 0 Comments Do you want to report an error or a typo? Click here! Leave a Reply Cancel reply Note: By submitting your comments, you acknowledge that Radio Canada International has the right to reproduce, broadcast and publicize those comments or any part thereof in any manner whatsoever. Radio Canada International does not endorse any of the views posted. Your comments will be pre-moderated and published if they meet netiquette guidelines. Netiquette >> Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Current ye@r * Leave this field empty ✓ Thanks for sharing! AddToAny More..."