"    July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Natural gas prices advanced in July bidweek trading as forecasts called for strong early summer heat to further intensify and cover more of the Lower 48 in the month ahead, offsetting rising production volumes and stout supplies in storage.   Expand   NGI's July Bidweek National Avg. climbed 40.0 cents month/month to $2.215/MMBtu. That was down from $2.560 a year earlier. Trading for the latest bidweek period spanned June 24-26. Weather conditions proved mostly hot across the southern two-thirds of the Lower 48 in that span. National Weather Service (NWS) forecasts call for more of the same through the first half of July, with the heat spreading further to the northern third of the country. NWS outlooks also repeatedly have predicted above-average national temperatures for the summer overall.      Related Tags    natural gas production   weather            Kevin Dobbs     Kevin Dobbs joined the staff of NGI in April 2020. Prior to that, he worked as a financial reporter and editor for S&P Global Market Intelligence, covering financial companies and markets. Earlier in his career, he served as an enterprise reporter for the Des Moines Register. He has a bachelor's degree in English from South Dakota State University.      X  KNatgas   Email  kevin.dobbs@naturalgasintel.com                    June Natural Gas Bidweek Prices Climb on Shrinking Storage Surplus, Forecast for Hot Summer     Bidweek Survey Natural Gas Prices     June 03, 2024   Natural gas prices gained upside momentum in June bidweek trading as rising temperatures ignited cooling demand, pipeline maintenance eased and modest storage injections clashed with hints of increasing production.        May Bidweek Natural Gas Prices Slide as Storage Containment Worries Outmuscle Incoming Heat     Bidweek Survey Natural Gas Prices     May 01, 2024   Natural gas prices slipped lower in May bidweek trading as the month's expected uptick in cooling demand was upstaged by hefty inventory levels and recent bumpy performances by Gulf Coast LNG terminals.        April Natural Gas Bidweek Prices Trip Lower as Spring Season Deflates Demand     Bidweek Survey Natural Gas Prices     April 01, 2024   Natural gas prices were modestly lower in April bidweek trading as the transition from winter to spring signaled milder weather, weakening demand and an end-of-season natural gas supply swelling to the brim.        March Bidweek Natural Gas Prices Drop as Weak Weather Overshadows Production Cuts     Bidweek Survey Natural Gas Prices     March 01, 2024   Natural gas prices retreated in March bidweek trading as signs of declining production were eclipsed by paltry weather-driven demand and lofty levels of supply in storage.        March Bidweek Trading Starts on Downslope as Weather Seen Driving Wider Storage Surplus     Bidweek Survey Natural Gas Prices     February 26, 2024   Hamstrung by a growing surplus of natural gas in inventories and with a spring-like February running into a mild March, traders tugged natural gas prices lower for March baseload delivery, according to  NGI's Bidweek Alert  (BWA).        February Natural Gas Bidweek Prices Mixed Amid Demand Downshift, Production Hits     Bidweek Survey Natural Gas Prices     February 01, 2024   Strengthening but still lower production intersected with spring-like weather during February bidweek trading. Natural gas prices varied by region as a result, with swaths of the country impacted by lower supply and posting gains, and others reporting declines amid waning heating demand.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         "