"       US natural gas prices fall - Markets - Business Recorder                                                                     Markets  Print 2024-07-04  US natural gas prices fall    Reuters   Published July 4, 2024       Facebook   Twitter   Whatsapp   Comments            Follow us      NEW YORK: US natural gas futures held near a seven-week low on Wednesday as the market waits for direction from what should be a bullish federal report expected to show last week's storage build was smaller than usual for an eighth week in a row.  That lack of price movement came despite a bullish heat wave expected to linger over much of the country through at least mid-July and a bearish rise in output so far in July versus June and the tremendous oversupply of gas still in storage. The heat wave should prompt power generators to continue burning lots of gas to produce electricity to keep air conditioners humming. Traders said recent storage builds have been smaller than usual because several producers cut output earlier in the year after futures prices dropped to 3-1/2-year lows in February and March. Higher prices in recent weeks, however, prompted some producers, including EQT and Chesapeake Energy, to return to the well pad. Analysts forecast US utilities added 32 billion cubic feet (bcf) of gas into storage during the week ended June 28. That compares with an increase of 76 bcf in the same week last year and a five-year (2019-2023) average rise of 69 bcf for this time of year. If correct, that will leave about 19% more gas in storage than normal at this time of year. Front-month gas futures for August delivery on the New York Mercantile Exchange rose 0.8 cents, or 0.3%, to $2.443 per million British thermal units (mmBtu) at 8:45 a.m. EDT (1245 GMT). On Tuesday, the contract closed at its lowest since May 15 for a second day in a row. Recent declines in the front-month caused futures for September, which usually trade at a discount to August, to jump to a record premium of around 2.9 cents per mmBtu over the August contract. In the spot market, next-day gas prices at the Waha hub in West Texas plunged from a negative 52 cents per mmBtu for Tuesday to negative $2.06 for Wednesday as pipeline constraints trapped gas in the Permian Shale. It was the fourth time in seven days that Waha prices fell into negative territory during the current heat wave and the 21st time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 or 2022, and once in 2023. Financial firm LSEG said gas output in the Lower 48 US states rose to an average of 101.8 billion cubic feet per day (bcfd) so far in July.      US natural gas         Comments    Comments are closed.          Pakistan   Govt decides to ban Pakistan Tehreek-e-Insaf   US natural gas prices fall Market cheers IMF bailout, KSE-100 gains over 1,200 pointsIntra-day update: rupee appreciates against US dollarComplaints about different projects: ADB decides to dispatch mission Security forces foil terrorist attack on Bannu CanttPML-N files review petition in SC against reserved seats verdict'I'm supposed to be dead' Trump tells NYP after assassination bidIsrael launches new Gaza strikes after weekend attack kills scores in safe zoneSapphire Fibres expands power portfolio with acquisitions of UCH, UCH-IIOil holds its ground as dollar gain and Chinese demand concerns weighPakistani, Chinese cos reach preliminary agreement to introduce solar e-bikes   Read more stories Next Story                    ForexWorldCommodity           Currency Rate        USD PKR Interbank Selling  / Jul 15    278.20    USD PKR Interbank Buying  / Jul 15    278    USD to Japanese Yen  / Jul 15    158.01    USD to Swiss Franc  / Jul 15    0.90    Pound Sterling to USD  / Jul 15    1.30    Euro to USD  / Jul 15    1.09         Stock Volume        S&P 500  / Jul 12    5,615.35    Nasdaq  / Jul 12    18,398.45    Dow Jones  / Jul 12    40,000.90    India Sensex  / Jul 15    80,599.55    Tokyo Nikkei  / Jul 15    41,190.68    Hang Seng  / Jul 15    18,038.56    FTSE 100  / Jul 15    8,211.44    Germany DAX 30  / Jul 15    18,686.70         Item Value        Karachi Cotton PKR/37.32 KG  / Jul 12    18,535    Gold 10 Grams PKR  / Jul 12    213,477    Petrol/Litre  / Jul 15    265.61    Crude Oil USD/Barrel  / Jul 15    82.43    Gold Spot USD/Ounce  / Jul 15    2,411.33    Diesel/Litre  / Jul 15    277.45                       GainersLosersLeaders         Stock Price         786 Invest Ltd   / Jul 15     786 Investments Limited(786)    5    ▼ 0.00 (0.00%)      AL-Abbas Sugar   / Jul 15     Al-Abbas Sugar Mills Limited(AABS)    585    ▼ 0.00 (0.00%)      Agro Allianz   / Jul 15     Agro Allianz Limited(AAL)    16    ▼ 0.00 (0.00%)      AL-Abid Silk   / Jul 15     Al-Abid Silk Mills Limited(AASM)    3.49    ▼ 0.00 (0.00%)      Ali Asghar   / Jul 15     Ali Asghar Textile Mills Limited(AATM)    2.07    ▼ 0.00 (0.00%)      Allied Bank   / Jul 15     Allied Bank Limited(ABL)    87.10    ▼ 0.00 (0.00%)      Abbott Lab.   / Jul 15     Abbott Laboratories (Pakistan) Limited(ABOT)    499.34    ▼ 0.00 (0.00%)      Abson Ind.   / Jul 15     Abson Industries Limited(ABSON)    2.50    ▼ 0.00 (0.00%)      Alfalah ETF.   / Jul 15     Alfalah Consumer Index ETF.(ACIETF)    9.84    ▼ 0.00 (0.00%)          Stock Price         786 Invest Ltd   / Jul 15     786 Investments Limited(786)    5    ▲ 0.00 (0.00%)      AL-Abbas Sugar   / Jul 15     Al-Abbas Sugar Mills Limited(AABS)    585    ▲ 0.00 (0.00%)      Agro Allianz   / Jul 15     Agro Allianz Limited(AAL)    16    ▲ 0.00 (0.00%)      AL-Abid Silk   / Jul 15     Al-Abid Silk Mills Limited(AASM)    3.49    ▲ 0.00 (0.00%)      Ali Asghar   / Jul 15     Ali Asghar Textile Mills Limited(AATM)    2.07    ▲ 0.00 (0.00%)      Allied Bank   / Jul 15     Allied Bank Limited(ABL)    87.10    ▲ 0.00 (0.00%)      Abbott Lab.   / Jul 15     Abbott Laboratories (Pakistan) Limited(ABOT)    499.34    ▲ 0.00 (0.00%)      Abson Ind.   / Jul 15     Abson Industries Limited(ABSON)    2.50    ▲ 0.00 (0.00%)      Alfalah ETF.   / Jul 15     Alfalah Consumer Index ETF.(ACIETF)    9.84    ▲ 0.00 (0.00%)          Stock Volume         P.I.A.C.(A)   / Jul 15     Pakistan International Airlines Corp(PIAA)    47,200,500    ▲ 0.00      Cnergyico PK   / Jul 15     Cnergyico PK Limited(CNERGY)    29,719,327    ▲ 0.00      Pak Petroleum   / Jul 15     Pakistan Petroleum Limited(PPL)    21,170,581    ▲ 0.00      Pak Refinery   / Jul 15     Pakistan Refinery Limited(PRL)    16,965,134    ▲ 0.00      The Searle Co.   / Jul 15     The Searle Company Limited(SEARL)    15,793,227    ▲ 0.00      P.T.C.L.   / Jul 15     Pakistan Telecommunication Company Ltd(PTC)    15,054,641    ▲ 0.00      K-Electric Ltd.   / Jul 15     K-Electric Limited(KEL)    14,145,556    ▲ 0.00      WorldCall Telecom   / Jul 15     Worldcall Telecom Limited(WTL)    13,158,668    ▲ 0.00      Telecard Limited   / Jul 15     Telecard Limited(TELE)    12,358,668    ▲ 0.00           Markets →               Most Popular    Today Yesterday Past 3 Days             Complaints about different projects: ADB decides to dispatch mission    NJLI Sarmaya Growth Fund Rates   Budget 2024-25: income tax calculator for FY25   Market cheers IMF bailout, KSE-100 gains over 1,200 points   Pakistani, Chinese cos reach preliminary agreement to introduce solar e-bikes    Challenge of lower growth: IMF bailout insufficient    The illogical vilification of investors    Govt decides to ban Pakistan Tehreek-e-Insaf   Intra-day update: rupee appreciates against US dollar                   NJLI Sarmaya Growth Fund Rates   PTI activist Sanam Javed rearrested after brief release, lawyer says   Cement dealers announce strike against WHT    Gold price per tola jumps Rs2,200 in Pakistan   Trump survives assassination attempt at campaign rally after major security lapse   Budget 2024-25: income tax calculator for FY25   FBR amends ST Act to harmonise it with IT law    SLA on 37-month EFF: $7bn new loan deal reached with IMF    FBR fails to achieve Rs9.4trn collection target                    NJLI Sarmaya Growth Fund Rates   Gold price per tola jumps Rs2,200 in Pakistan   Budget 2024-25: income tax calculator for FY25   IMF, Pakistan reach staff-level agreement on $7bn Extended Fund Facility   FBR fails to achieve Rs9.4trn collection target    Excessive valuation of immovable properties: FTO's directive to FBR    Complaints about different projects: ADB decides to dispatch mission    PTI activist Sanam Javed rearrested after brief release, lawyer says   Key policy points/reforms stressed by IMF in new staff-level agreement                        "