"       US natural gas prices fall - Markets - Business Recorder                                         Business Recorder    Jul 15, 2024 PRINT EDITION ► BR MARKETS ► Dollar to PKR ►           x    Home Latest BR Research Markets Business & Finance World Editorials Opinion MENA Technology Life & Style Sports Perspectives Pakistan Supplements Print      US natural gas prices fall    Reuters  02 Jul, 2024        Facebook       Twitter       Whatsapp         NEW YORK: US natural gas futures fell about 3% to a one-month low on rising output in recent weeks, forecasts for less demand over the next two weeks than previously expected and an ongoing oversupply of gas in storage. Analysts forecast there was still about 19% more gas in storage than usual for this time of year even though output reductions earlier in 2024 kept weekly injections below normal over the past seven weeks.That price decline came even though the heat wave blanketing much of the country for weeks will linger through at least mid-July, forcing power generators to continue burning lots of gas to keep air conditioners humming. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 6.5 cents, or 2.5%, to $2.536 per million British thermal units (mmBtu) at 10:17 a.m. EDT (1417 GMT), putting the contract on track for its lowest close since May 29.Even though gas prices gained about 4% last week, speculators cut their net long futures and options positions on the New York Mercantile and Intercontinental Exchanges for the first time in three weeks, according to the US Commodity Futures Trading Commission's Commitments of Traders report.In Texas, the Electric Reliability Council of Texas (ERCOT), the power grid operator for most of the state, said peak demand came close but did not break the record for the month of June last week, as had been expected.ERCOT, however, projects demand will break the July record on Tuesday as homes and businesses crank up their air conditioners to escape the heat blanketing the state.        Facebook       Twitter       Whatsapp        Read Comments     "