{
    "title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... ",
    "source": " Natural Gas Intelligence",
    "Content": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high. Expand Here's the latest: August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48 The August contract started to trade below $2.500/MMBtu before 11 a.m. ET before bouncing on either side of the closely watched level into midday. \"Critical support sits at $2.50,\" EBW Analytics Group analyst Eli Rubin said. Forecasting from DTN shed 6.5 cooling degree days (CDD) from its Lower 48 forecasts over the next three weeks since Friday, equating to 10.4 Bcf lower demand, Rubin said. Maxar's Weather Desk also pointed to cooler temperatures. However, NatGasWeather painted a more mixed picture with weekend updates both shedding and adding modest amounts of CDD in the American and European weather models. Both forecasts continued to point to the hottest first half of July of the past 50 years, however, both models have tended to overestimate summer's heat \"and the expectation is they are doing so again this summer,\" NatGasWeather said. Wood Mackenzie estimated Lower 48 gas production fell to 100.0 Bcf/d on Monday, but analysts expected that number to be revised higher in later cycles because of volatility at the start of the month. Freeport LNG terminal's Train 2 was down about 15 hours from Saturday to Sunday, but flows have bounced back on Monday Cheniere Energy Inc.'s Sabine Pass liquefied natural gas export facility may have completed a round of maintenance U.S. LNG feed gas demand climbed to about 12.9 Bcf/d for Monday, highest since last Sunday, according to NGI's U.S. LNG Export Tracker Freeport staff told Texas officials that the facility's Train 2 tripped because of compressor issues. Feed gas flows fell to about 1.6 Bcf/d Saturday and 1.3 Bcf/d Sunday, NGI data show. On Monday, service regained its earlier June pace with nominations at around 1.9 Bcf/d. Kpler has a ship in berth loading and more scheduled through the week. Meanwhile, an uptick in feed gas flows to Sabine Pass over the weekend hints at the terminal wrapping up its traditional June maintenance. Flows to Sabine Pass over the weekend topped out above 4.3 Bcf on Sunday and were scheduled to be around 4.2 Bcf on Monday, NGI data show. \"The terminal could likely run a bit higher, with optimal summer flows near 4.4 Bcf/d,\" Criterion Research Inc.'s James Bevan, vice president of Research, said on online energy platform Enelyst. Elsewhere, flows to Cheniere's Corpus Christi and Sempra Infrastructure's Cameron LNG terminals were stable at about 2.3 Bcf/d and 1.9 Bcf/d, respectively, NGI data show. NGI modeling 29 Bcf injection into Lower 48 storage for week ending June 28 A print in-line with NGI's estimate for this week's U.S. Energy Information Administration (EIA) report would further eat into the Lower 48's lofty storage surplus. Last week's report showed working gas in underground storage stood at 528 Bcf, or a nearly 21% surplus to the five-year average. All but eight of the last 10 weekly injections have lagged the five-year average, narrowing the surplus from 37% in mid-April. For the week ending June 28, the five-year average is an injection of 69 Bcf, while the year-earlier period saw an 76 Bcf increase. Henry Hub spot prices lower at $2.205, down 18.5 cents, NGI's MidDay Price Alert data show Southeast weaker on cooler forecasts, West Texas prices stay negative Waha rose 8.5 cents to negative $2.035 on Monday, according to NGI's MidDay Price Alert. Transco Zone 5 in the Southeast shed 25.5 cents to average $2.560, as forecasts for the region turned cooler. Weather model runs on Monday pulled Southeast forecasts for the next 10 days below normal while the 11- to 15-day outlook is only now marginally above normal, Bevan said. The cooler look resulted in a demand loss of around 9 Bcf for the region, stacking onto losses from Thursday and Friday, Bevan said. Also likely impacting prices in the Southeast is supply from the Mountain Valley Pipeline LLC (MVP), which officially began firm transport service on Monday. The new pipeline is scheduled to deliver its highest volume yet to the Transcontinental Gas Pipe Line Co. (aka Transco) on Monday at around 0.97 Bcf/d, or nearly half its capacity, according to Wood Mackenzie flow data. Transco's Station 160 in North Carolina, which is south of the mainline's interconnect with MVP, showed southbound flows into the Southeast rose above 2 Bcf/d Monday, setting a new high for 2024, Bevan said. Related Tags natural gas prices Mountain Valley Pipeline Natural gas futures Mvp Sabine Pass Midday Transco Zone 5 Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl."
}