{
    "Content": "       US natural gas prices fall - Markets - Business Recorder                                                                     Markets  Print 2024-07-04  US natural gas prices fall    Reuters   Published July 4, 2024       Facebook   Twitter   Whatsapp   Comments            Follow us      NEW YORK: US natural gas futures held near a seven-week low on Wednesday as the market waits for direction from what should be a bullish federal report expected to show last week's storage build was smaller than usual for an eighth week in a row.  That lack of price movement came despite a bullish heat wave expected to linger over much of the country through at least mid-July and a bearish rise in output so far in July versus June and the tremendous oversupply of gas still in storage. The heat wave should prompt power generators to continue burning lots of gas to produce electricity to keep air conditioners humming. Traders said recent storage builds have been smaller than usual because several producers cut output earlier in the year after futures prices dropped to 3-1/2-year lows in February and March. Higher prices in recent weeks, however, prompted some producers, including EQT and Chesapeake Energy, to return to the well pad. Analysts forecast US utilities added 32 billion cubic feet (bcf) of gas into storage during the week ended June 28. That compares with an increase of 76 bcf in the same week last year and a five-year (2019-2023) average rise of 69 bcf for this time of year. If correct, that will leave about 19% more gas in storage than normal at this time of year. Front-month gas futures for August delivery on the New York Mercantile Exchange rose 0.8 cents, or 0.3%, to $2.443 per million British thermal units (mmBtu) at 8:45 a.m. EDT (1245 GMT). On Tuesday, the contract closed at its lowest since May 15 for a second day in a row. Recent declines in the front-month caused futures for September, which usually trade at a discount to August, to jump to a record premium of around 2.9 cents per mmBtu over the August contract. In the spot market, next-day gas prices at the Waha hub in West Texas plunged from a negative 52 cents per mmBtu for Tuesday to negative $2.06 for Wednesday as pipeline constraints trapped gas in the Permian Shale. It was the fourth time in seven days that Waha prices fell into negative territory during the current heat wave and the 21st time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 or 2022, and once in 2023. Financial firm LSEG said gas output in the Lower 48 US states rose to an average of 101.8 billion cubic feet per day (bcfd) so far in July.      US natural gas         Comments         200 characters               Pakistan   Will personally oversee process of downsizing, rightsizing: PM Shehbaz   US natural gas prices fall KSE-100 falls below 80,000 as some selling pressure seen in stocksProperty deals, salaries, car purchase: FBR notifies change in WHT provisions Rupee inches lower against US dollarRelief announced for protected power consumers: Country has navigated hard times, says PM Wahab Riaz, Abdul Razzaq sacked from selection committee after T20 World Cup debacleOil slips on easing US Gulf supply concerns, weak China inflationGold price per tola increases Rs600 in PakistanSuki Kinari project will commence generation from Nov Hydropower project: Riali-II to be processed on 'must run & take-and-pay' basis Tajir Dost Scheme: Registration process to begin in 42 cities: FBR   Read more stories Next Story                    ForexWorldCommodity           Currency Rate        USD PKR Interbank Selling  / Jul 10    27,863    USD PKR Interbank Buying  / Jul 10    278.43    USD to Japanese Yen  / Jul 10    161.53    USD to Swiss Franc  / Jul 10    0.90    Pound Sterling to USD  / Jul 10    1.28    Euro to USD  / Jul 10    1.08         Stock Volume        S&P 500  / Jul 9    5,576.98    Nasdaq  / Jul 9    18,429.29    Dow Jones  / Jul 9    39,291.97    India Sensex  / Jul 10    79,637    Tokyo Nikkei  / Jul 10    41,700.39    Hang Seng  / Jul 10    17,516.78    FTSE 100  / Jul 10    8,161.41    Germany DAX 30  / Jul 10    18,287.99         Item Value        Petrol/Litre  / Jul 10    265.61    Crude Oil USD/Barrel  / Jul 10    81.21    Karachi Cotton PKR/37.32 KG  / Jul 10    18,535    Gold 10 Grams PKR  / Jul 10    210,562    Gold Spot USD/Ounce  / Jul 10    2,367.97    Diesel/Litre  / Jul 10    277.45                       GainersLosersLeaders         Stock Price         786 Invest Ltd   / Jul 10     786 Investments Limited(786)    5    ▼ 0.00 (0.00%)      AL-Abbas Sugar   / Jul 10     Al-Abbas Sugar Mills Limited(AABS)    585    ▼ 0.00 (0.00%)      Agro Allianz   / Jul 10     Agro Allianz Limited(AAL)    16    ▼ 0.00 (0.00%)      AL-Abid Silk   / Jul 10     Al-Abid Silk Mills Limited(AASM)    3.49    ▼ 0.00 (0.00%)      Ali Asghar   / Jul 10     Ali Asghar Textile Mills Limited(AATM)    2.07    ▼ 0.00 (0.00%)      Allied Bank   / Jul 10     Allied Bank Limited(ABL)    87.10    ▼ 0.00 (0.00%)      Abbott Lab.   / Jul 10     Abbott Laboratories (Pakistan) Limited(ABOT)    499.34    ▼ 0.00 (0.00%)      Abson Ind.   / Jul 10     Abson Industries Limited(ABSON)    2.50    ▼ 0.00 (0.00%)      Alfalah ETF.   / Jul 10     Alfalah Consumer Index ETF.(ACIETF)    9.84    ▼ 0.00 (0.00%)          Stock Price         786 Invest Ltd   / Jul 10     786 Investments Limited(786)    5    ▲ 0.00 (0.00%)      AL-Abbas Sugar   / Jul 10     Al-Abbas Sugar Mills Limited(AABS)    585    ▲ 0.00 (0.00%)      Agro Allianz   / Jul 10     Agro Allianz Limited(AAL)    16    ▲ 0.00 (0.00%)      AL-Abid Silk   / Jul 10     Al-Abid Silk Mills Limited(AASM)    3.49    ▲ 0.00 (0.00%)      Ali Asghar   / Jul 10     Ali Asghar Textile Mills Limited(AATM)    2.07    ▲ 0.00 (0.00%)      Allied Bank   / Jul 10     Allied Bank Limited(ABL)    87.10    ▲ 0.00 (0.00%)      Abbott Lab.   / Jul 10     Abbott Laboratories (Pakistan) Limited(ABOT)    499.34    ▲ 0.00 (0.00%)      Abson Ind.   / Jul 10     Abson Industries Limited(ABSON)    2.50    ▲ 0.00 (0.00%)      Alfalah ETF.   / Jul 10     Alfalah Consumer Index ETF.(ACIETF)    9.84    ▲ 0.00 (0.00%)          Stock Volume         P.I.A.C.(A)   / Jul 10     Pakistan International Airlines Corp(PIAA)    47,200,500    ▲ 0.00      Cnergyico PK   / Jul 10     Cnergyico PK Limited(CNERGY)    29,719,327    ▲ 0.00      Pak Petroleum   / Jul 10     Pakistan Petroleum Limited(PPL)    21,170,581    ▲ 0.00      Pak Refinery   / Jul 10     Pakistan Refinery Limited(PRL)    16,965,134    ▲ 0.00      The Searle Co.   / Jul 10     The Searle Company Limited(SEARL)    15,793,227    ▲ 0.00      P.T.C.L.   / Jul 10     Pakistan Telecommunication Company Ltd(PTC)    15,054,641    ▲ 0.00      K-Electric Ltd.   / Jul 10     K-Electric Limited(KEL)    14,145,556    ▲ 0.00      WorldCall Telecom   / Jul 10     Worldcall Telecom Limited(WTL)    13,158,668    ▲ 0.00      Telecard Limited   / Jul 10     Telecard Limited(TELE)    12,358,668    ▲ 0.00           Markets →               Most Popular    Today Yesterday Past 3 Days             Property deals, salaries, car purchase: FBR notifies change in WHT provisions    'They don't care about us'   NJLI Sarmaya Growth Fund Rates   Relief announced for protected power consumers: Country has navigated hard times, says PM    Budget 2024-25: income tax calculator for FY25   Suki Kinari project will commence generation from Nov    Hydropower project: Riali-II to be processed on 'must run & take-and-pay' basis    Tajir Dost Scheme: Registration process to begin in 42 cities: FBR    'Big three': car companies hit 21-year low in annual sales volume in Pakistan                   Budget 2024-25: income tax calculator for FY25   Govt embarks on the path of rightsizing itself    NJLI Sarmaya Growth Fund Rates   Aviation panel told: PIACL sell-off process almost over    Bid to raise subsidy for protected power users: Further cut in FY25 PSDP likely    Agriculture is not the future of Pakistan    Outlook for FY25    Up to 200 units of consumption: PM Shehbaz announces Rs50bn power subsidy for 25mn households   RoI, capacity payments and other terms: Senate panel may initiate probe into IPP pacts                    Budget 2024-25: income tax calculator for FY25   NJLI Sarmaya Growth Fund Rates   Property deals, salaries, car purchase: FBR notifies change in WHT provisions    Taxes: Aurangzeb for breaking IMF bailout cycle    Trading at PSX disrupted after fire incident   Only some bold steps can help govt fix the economy    Govt embarks on the path of rightsizing itself    Azeri firm seeks legislative safeguards for its investment in Pakistan   Agriculture is not the future of Pakistan                         ",
    "Title": "US natural gas prices fall - Markets - Business Recorder"
}