{
    "Content": "       US natural gas prices ease - Markets - Business Recorder                                          Business Recorder    Jul 10, 2024 PRINT EDITION ► BR MARKETS ► Dollar to PKR ►           x    Home Latest BR Research Markets Business & Finance World Editorials Opinion MENA Technology Life & Style Sports Perspectives Pakistan Supplements Print      US natural gas prices ease    Reuters  03 Jul, 2024        Facebook       Twitter       Whatsapp         NEW YORK: US natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row.In other news, a federal judge dealt US President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave.In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again.That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023.In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest US National Hurricane Center (NHC) outlook.        Facebook       Twitter       Whatsapp        Read Comments     ",
    "Title": "US natural gas prices ease - Markets - Business Recorder"
}