"                    India's crude oil imports from Russia touch 13-month high | DH Latest News, DH NEWS, Latest News, India, NEWS , Crude oil production, crude oil imports, crude oil exports, imported crude oil, Indian basket of crude oil, Crude Oil, crude oil prices, Crude Oil import                                                   Facebook   X   LinkedIn   Pinterest   Reddit   WhatsApp   Telegram         New Delhi:  India's crude oil imports from Russia touched 13-month high in June. Data provided by intelligence firm Vortexa showed this. As per data, India imported 2.13 million barrels of crude oil per day from Russia last month, up 7.2% from the previous month. This was the highest since May 2023 when imports from Russia stood at 2.15 million barrels per day. Imports of Urals reached their all-time high 1.6 million barrels per day in June. 'India's imports of Urals have reached an all-time high, never on record did Indian refiners buy more than 1.6 million b/d. India has resumed purchases of Russian grades from the Far East such as ESPO or Sokol, however the quantities thereof are lower than they were on average in 2023,' said Viktor Katona, lead crude analyst at Kpler.  Also Read: UPI transactions surge 49 per cent to 13.89 billion in June   The share of US crude in India oil imports also increased by 75% sequentially to 371,000 barrels per day last month. India imported more than 370,000 b/d of oil from the US in June, the highest since January 2023. Meanwhile, import volumes from Iraq and Saudi Arabia, the other top suppliers of crude oil to India, declined by 24% and 25% on month respectively. June imports from Saudi Arabia came in at a mere 430,000 barrels per day, the lowest monthly figure since January 2014. Saudi Arabia's market share in India's crude imports reduced to 9% last month compared to 11% in May. Iraq's crude market share, too, declined to 17% in June from 21% in May. Cumulatively, the country imported 4.74 million barrels per day of crude oil in June, marginally up from 4.67 million barrels per day imported in June 2023. Among Indian refiners, Reliance Industries bought the largest volumes of Russian crude oil in June at 542,948 barrels per day followed by the state-owned Indian Oil Corp at 453,851 barrels per day.   Tags Crude oil production crude oil imports crude oil exports imported crude oil Indian basket of crude oil Crude Oil crude oil prices Crude Oil import shortlink         Jul 2, 2024, 08:35 pm IST       Facebook   X   LinkedIn   Pinterest   Reddit   WhatsApp   Telegram               Facebook   X   LinkedIn   Pinterest   WhatsApp   Telegram             Post Your Comments                 Facebook   X   Messenger   Messenger   WhatsApp   Telegram       Back to top button           Close        Search for            Close        Search for         "