"India's crude oil imports from Russia at 12-month high in June - The Hindu BusinessLine India's crude oil imports from Russia at 12-month high in June Updated - July 02, 2024 at 10:19 PM. Crude oil imports from Russia up by 15 per cent month-on-month, 2 per cent year-on-year By Rishi Ranjan Kala Comments Share Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit READ LATER Remove See All India's crude oil imports from Russia rose to 1.97 million barrels per day (mbpd) during June 2024, the highest since July 2023, largely due to lower cargoes to China.According to data from energy intelligence firm Vortexa, imports from Russia were up by almost 15 per cent month-on-month and 2 per cent on an annual basis. Data shows that both public and private sector refiners continued to import in record quantities from Russia.Public refiners such as Indian Oil Corporation (IOCL), Bharat Petroleum Corporation (BPCL) and Hindustan Petroleum Corporation (HPCL) imported 1.10 mbpd crude oil, which is also a 12-month high. The cargoes last month were higher by 6 per cent M-o-M. However, imports were down by almost 11 per cent on an annual basis. During May-July 2023, public refiners imported more than 1.2 mbpd on a monthly basis from Russia.Private refiners Reliance Industries (RIL) and Rosneft-backed Nayara Energy imported a record 871,200 barrels per day (bpd) from Russia in June 2024. The cargoes were higher by 28 per cent M-o-M and 20 per cent Y-o-Y. Also read Crude oil up as market expects demand boost during US travel season Consumption of transport fuels declines in June, after May's record high End of petrodollar? We wouldn't hold our breath Vortexa's head of APAC analysis Serena Huang told businessline , \"India's imports of Russian crude at 1.97 mbpd in June 2024 is the highest since last July. China's lower appetite of Russian crude has led to more barrels heading to India.\" Import momentum India's crude imports have remained robust at 4.62 mbpd in June, Huang said. \"We expect the country's crude imports to remain robust, with downside risks from softer refining margins due to slowing global oil demand,\" she added. While Indian refiners procured more barrels from Russia, cargoes from traditional suppliers in West Asia, such as Iraq and Saudi Arabia, declined.Crude oil imports from India's second largest supplier, Iraq, fell by 20 per cent M-o-M and by 3.5 per cent Y-o-Y to roughly 754,000 bpd in June 2024. The decline was steeper in in-bound shipments from Saudi Arabia at 36 per cent M-o-M and 46 per cent Y-o-Y to around 387,000 bpd. Some trade sources said that the higher official selling price (OSP) of its flagship medium sour grade Arab Light in June could have been a reason for the lower cargoes. Crude oil shipments from the US continued to rise for the second consecutive month in June 2024. India imported roughly 331,000 bpd from the US last month, compared to around 224,000 bpd in May 2024 and 112,000 bpd in April. Trade sources said the imports were of light sweet grade due to weak market fundamentals amid refinery outages in Europe. Comments SHARE Copy linkEmailFacebookTwitterTelegramLinkedInWhatsAppReddit Published on July 2, 2024 Related Topics CRUDE OIL imports Russia You might also likeYou might also like Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per monthAccess to comment on every storySign up/Manage to our newslettersGet notified by email for early preview to new features, discounts & offers x Looks like you are already logged in from more than 3 devices! To continue logging in, remove at least one device from the below list Log outLog Out from all devicesTerms & conditions | ${ ind + 1 } ${ device }Last active - ${ la }"