"    US natgas prices ease to 6-week low on rising output, lower LNG feedgas                                          US natgas prices ease to 6-week low on rising output, lower LNG feedgas  July 2 (Reuters) - U.S. natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row.       Advertisement:  The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt           In other news, a federal judge dealt U.S. President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave. In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again. That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023. In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest U.S. National Hurricane Center (NHC) outlook. After marching across the Yucatan, the NHC projected Beryl will weaken into a tropical storm by the time it enters the Bay of Campeche in the Gulf of Mexico, where Mexico produces much of its oil, on Saturday before approaching the Texas-Mexico border on Sunday. SUPPLY AND DEMAND Financial firm LSEG said gas output in the Lower 48 U.S. states rose to an average of 101.5 billion cubic feet per day (bcfd) so far in July. That was up from an average of 100.1 bcfd in June and a 17-month low of 99.5 bcfd in May as many producers reduced drilling activities after prices fell to 3-1/2-year lows in February and March. U.S. output hit a monthly record high of 105.5 bcfd in December 2023. Meteorologists projected weather across the Lower 48 states would remain hotter than normal through at least July 17. With hotter weather expected next week, LSEG forecast average gas demand in the Lower 48, including exports, will rise from 98.5 bcfd this week to 104.5 bcfd next week. Those forecasts were lower than LSEG's outlook on Monday. Gas flows to the seven big U.S. LNG export plants fell to 12.2 bcfd so far in July, down from 12.8 bcfd in June and a monthly record high of 14.7 bcfd in December 2023. That decline was due mostly to an expected drop in feedgas at Cheniere Energy's 4.5-bcfd Sabine Pass in Louisiana to a one-week low of 3.7 bcfd on Tuesday, down from 4.1 bcfd on Monday and an average of 4.0 bcfd over the prior seven days.  (Reporting by Scott DiSavino; editing by Barbara Lewis)       Related Articles      Jul 15, 2024 5:30:am  US natural gas pipeline ADCC begins commercial operations      Jul 12, 2024 7:00:am  About 1 million in Texas without power, Freeport LNG to restart after Beryl      Jul 11, 2024 1:00:pm  Engie to partner with Macquarie in Mexican pipeline project      "