"                               Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper                                                                         Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG     Oil & Gas   By  Kasarahchi ANIAGOLU   On  Jul 2, 2024         File Photo : Crude Oil        The Chairman, Independent Petroleum Producers Group (IPPG) Abdulrazaq Isa on Tuesday called for speedy resolution of divestment involving International Oil Companies so as to unlock crude oil productions to about 2.5 million barrels per day. Isa made the call at the Nigerian Oil and Gas (NOG) Energy Week 2024 in Abuja with the theme, \"Showcasing opportunities, driving investment and meeting energy demand.\"   Advertisement  He told the participants at the event that the approval of IOCs divestment will also restore global investor confidence in Nigeria at a time of huge competition for investments in the energy sector. The IPPG Chairman stated further that despite huge hydrocarbon resource base, with over 37 billion barrels of proven crude oil reserves and 207 tcf and 600 tcf of proven gas reserves, the country is currently in a situation where the daily production has significantly dropped to about 1.3 million barrels of crude oil per day and 8.5 billion standard cubic feet of gas per day respectively. This, he noted, is far below the nation's capacity, noting that Nigeria now runs the risk of partial implementation of its national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. He said, \"IPPG strongly advocates that our member companies - Seplat, the Renaissance Consortium and Oando - have the proven track record to successfully take over and manage these onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5 billion SCF of gas per day within 24 months and well over 500,000 barrels of oil per day in the long term.  Advertisement  \"IPPG believes the timely approval of these IOC divestment transactions will also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. \"The urgent need to address deepwater development and production by untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, Total Energies, ExxonMobil and Chevron, has the potential to unlock incremental production of 700,000 barrels per day from this terrain in the short to medium term.     RELATED            Economy   Nigeria's Push To Attract Investments May Be Frustrated By CBN's Cash Repatriation Restriction- Analyst     Jun 14, 2024            Oil & Gas   Host Communities: Blocking Of IOCs Divestment Will Stifle Investments Into Nigeria's Oil & Gas Sector- NUPRC...     Jun 6, 2024           \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource bases.\" Isa also the hairman and Co-Founder of Waltersmith Group of Companies called for the adoption of a national value-retention strategy, stating that Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from its domestic crude oil and gas production. He noted that this would transform the country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy.  Advertisement  \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we can meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability. \"The development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive as Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed LNG capacity and expanding production (FLNG). \"In addition, we must expand domestic gas utilization (Gas-to-Power; Gas-Based Industries) by investing heavily to address the gas infrastructure deficit facing us today. The International Oil Companies will lead the charge on export gas while IPPG members will drive the domestic gas agenda led by NNPCL,\" he added. Isa noted that the priorities would provide the most realistic and sustainable pathway towards meeting the national long-term production aspiration of four million barrels of oil per day and 13 billion cubic feet of gas per day.     IOCIPPG        Share         Prev Post  LP Guber Candidate Akpata Campaign In Disarray As Edo Obidient Movement Switches Support For APC     Next Post  Ex-Senate President Wabara Bombs Obasanjo, Says I Turned Down N250m Bribe To Support Third Term Agenda       Leave a comment    Advertisement                   Sign in       Home News  Nigeria World News   Politics Business  Economy Oil & Gas Company Consumer Money & Markets   Entertainment  Celebrities Fashion & Style Movies Music   Sports  Football Athletics Tennis Other Sports   Technology  Hardware Mobile Software   SPECIAL PUBLICATION Opinion & Interviews Lifestyle  Health & Fitness Travel Fashion & Style Relationships   Special Reports                   Welcome, Login to your account.     Forget password?  Remember me         Sign in     Recover your password. A password will be e-mailed to you.                 "