"NNPCL declares state of emergency on crude oil production - Champion Newspapers LTD Champion Newspapers Limited For a better society The media gateway to the East. For inquiries: Phone: +234 81 8616 6160 Email: editor.championnews@gmail.com Likes Followers Followers NNPCL declares state of emergency on crude oil production .Calls for collaboration to reduce cost .FG determined to improve oil production, says Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC EnergyLatest News 42 Share UGO AMADI In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry. Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared. According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes. He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels. He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" However, with Nigeria's oil production lagging significantly behind OPEC oil production quota, the Minister for State Petroleum Resources (Oil), Senator Heineken Lokpobiri has expressed the Federal Government's determination to improve production in the coming months. The Minister stated this when he gave his ministerial address at the ongoing 2024 NOG week Lokpobiri emphasized Nigeria's commitment to increasing oil production, adding that while Nigeria \"is not in a rush to transition away from oil, the country is actively seeking to enhance its production capabilities\". According to him, \"We are focused on ramping up our oil production . When we came to office the president was concerned in increasing production in every way. I can confidently tell you that most of the deals like Seplat -ExxonMobil deal and other issues like Malabu deal are being resolved. He highlighted the benefits of the Petroleum Industry Act (PIA), which provides a robust legal framework that guarantees returns on investments and has significantly reshaped the oil and gas sector. \"The PIA ensures a secure and profitable investment climate, making Nigeria an attractive location for investors,\" he noted. .IPPG laments delays in concluding IOCs' divestment transactions The Independent Petroleum Producers Group (IPPG) has expressed concerns over the continuos delays in concluding ongoing divestment transactions by the international oil companies (IOCs). Chairman of IPPG, Mr. Abdulrazaq Isa, raised his members' concerns yesterday in Abuja at the ongoing Nigeria Oil and Gas (NOG) Energy Week 2024, with the theme: \"Showcasing Opportunities, Driving Investment and Meeting Energy Demand\". In his industry address at the event, Isa specifically said that the long-overdrawn delays in concluding the IOCs divestment deals were costly to the Nigerian petroleum industry and extremely detrimental to the country as a whole. He appreciated President Bola Tinubu for the transformative reforms being undertaken by his administratio, pointing out specifically that the recent presidential executive orders and directives were a welcome development for the industry. \"Also of note is His Excellency's direct intervention in untangling issues in some of the long-overdrawn IOC divestment transactions - these delays have been costly to the industry and extremely detrimental to the nation as a whole. \"We are encouraged to see swift progress on implementation and some tangible results within a relatively short period of time. \"Such progressive and impactful policies are exactly what the industry has consistently clamoured for to sustainably develop and move the industry forward\", Isa stated. Notwithstanding those laudable policies and the gradual positive turnarounds being experienced, he maintained that the industry was in dire need of extraordinary focus to mitigate the genuine concerns on its long-term sustainability. According to him, despite Nigeria's world class hydrocarbon resource base of over 37 billion barrels of proven crude oil reserves and 207 trillion cubic feet (tcf) and 600 tcf of proven and contingent gas reserves respectively, we find ourselves in a situation where our daily production has significantly dropped and lies at about 1.3 million barrels of oil and 8.5 bcf of gas today. He noted that the current oil and gas production was way below Nigeria's capacity as a nation. He added that by all globally acceptable standards, this reserves to production ratio was extremely low and a clear indicator that the industry was in a dire situation. In addition, Isa noted that \"we now run the risk of partial implementation of our national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. This trend in production, according to the IPPG chair, \"portends another frightening dimension when we consider that in the not-too-distant future, our overall installed domestic refining capacity, currently closing in on about 1.2 million barrels per day, may soon outstrip our current crude oil production level with the risk of Nigeria finding itself in a position where it is unable to meet its domestic refinery crude demand or even become a net importer of crude oil, God forbid! \"It is against this scary backdrop that IPPG is calling for urgent measures to be undertaken by all relevant stakeholders to immediately arrest this dwindling production level and under-investment by focusing on the following priority areas.\" On the first priority area, he called for immediate conclusion of all pending IOC divestment transactions. Isa posited that IPPG strongly advocates that their member companies such as Seplat, the Renaissance Consortium and Oando have the proven track record to successfully take over and manage those onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5bcf of gas per day within 24 months, and well over 500,000bpd in the long term. He maintained that IPPG believes the timely approval of these IOC divestment transactions would also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. On the second priority area, Isa stressed the urgent need to address deepwater development and production in Nigeria. He said untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, TotalEnergies, ExxonMobil and Chevron has the potential to unlock incremental production of 700,000 bpd from this terrain in the short to medium term. Isa stated, \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource base. \"Priority Area 3: The adoption of a national value-retention strategy: Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from our domestic crude oil and gas production in order to transform our country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we are able to meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability.\" On the fourth priority area, the IPPG boss called for the development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive. He stressed that Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed Liquefied Natural Gas (LNG) capacity and expanding production (FLNG). .We see energy demand rising by 23% by 2045 - OPEC Meanwhile, The Organisation of the Petroleum Exporting Countries (OPEC) says energy demand will rise by an estimated 23 per cent by 2025. OPEC says the rise will be fueled by a world economy that is expected to double in size, growing from $138 trillion dollars in 2023 to $270 trillion dollars in 2045. The OPEC Secretary-General, Haitham Al Ghais, made this known on Tuesday at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition, holding in Abuja. The conference, which holds from June 30 to July 4, has its theme as \"Showcasing Opportunities, Driving Investment, Meeting Energy Demand\". Addressing the Strategic Conference via teleconference, Al Ghais explained that it forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. \"This data tells us that the world will require all forms of energy to meet long-term energy needs. \"Oil and gas will remain the predominant fuels in the energy mix. \"In fact, oil alone will retain its share at almost 30 per cent in 2045 as world demand for oil soars to an estimated 116 million barrels per day (mb/d) by that time,\" he said. To meet this rapid and robust growth in energy consumption, he said the industry would need to boost investment levels significantly in the years to come. He said according to its research, cumulative oil-related investment requirements from 2024 until 2045 would amount to $14 trillion dollars or around $610 billion dollars on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons,\" he said. Al Ghais further emphasised that indeed, the rush to adopt \"Net-Zero\" strategies was misguided and simply not realistic. The OPEC Secretary General said that developing countries would continue to balance priorities between developing their national economies and addressing climate change. In this regard, he pledged that OPEC and its member countries would continue to advocate for a fair process for adaptation, mitigation and means of implementation, with regard to climate finance and technology. He decried the fact that there were an estimated 675 million people with no access to basic forms of energy and 2.3 billion without access to clean cooking fuels. He tasked World leaders to unite and advocate for the necessary support and resources to make a difference in addressing this important matter. \"Looking ahead, OPEC will continue to enhance dialogue and cooperation with all of its energy partners, including in Africa,\" Al Ghais said. The Secretary-General, while commending President Bola Tinubu, appreciated Nigeria's staunch commitment to OPEC and to the Declaration of Cooperation. Continue Reading .Calls for collaboration to reduce cost .FG determined to improve oil productionNNPCLoilsays Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC 42 Share FacebookTwitterWhatsAppTelegram Editor 20983 posts 0 comments Prev Post 24th Milo Basketball Nat'l Championship, held in Lagos Next Post NOG: Enact enforceable local content laws to build capacity - Nestoil Limited You might also like More from author Latest News Set to flood market with petrol, Aliko says electric cars, renewable energy not... Energy SPE-NAICE 2024 to focus on midstream, downstream development Energy NEITI tasks FG on implementation of panel's report on oil theft, vandalism as... Latest News UAE lifts Visa ban on Nigerians - FG Prev Next Comments are closed. More Stories Set to flood market with petrol, Aliko says electric cars,... Jul 16, 2024 SPE-NAICE 2024 to focus on midstream, downstream development Jul 16, 2024 NEITI tasks FG on implementation of panel's report on... Jul 16, 2024 UAE lifts Visa ban on Nigerians - FG Jul 16, 2024 Prev Next 1 of 2,847 You cannot print contents of this website. Sign in Welcome, Login to your account. Login with Facebook Google Twitter Or Forget password? Remember me Sign in Recover your password. A password will be e-mailed to you."