{
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Business Wire",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDI0MDcwMTEyODEwMC9lbi9BZXRob24tQ29tcGxldGVzLUFjcXVpc2l0aW9uLW9mLVRlbGx1cmlhbi1VcHN0cmVhbS1hbmQtTWlkc3RyZWFtLUFzc2V0c9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:00 GMT",
    "Categories": [
        "Company News"
    ],
    "Content": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets | Business Wire July 01, 2024 08:00 AM Eastern Daylight Time DALLAS--(BUSINESS WIRE)--Aethon Energy Management LLC (Aethon) today announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375,000 net acres with gathering and treating capacity of over 3 Bcf/d. Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for two metric tons per annum (mtpa) of liquified natural gas (LNG) from the Driftwood LNG project. \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for two mtpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\" \"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston. \"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of U.S. LNG as the global transition fuel and in providing energy security to America's partners around the world.\" Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel. About Aethon Energy Management Aethon Energy Management is a private investment firm and registered investment adviser that manages closed-end funds focused on acquiring, operating, and developing onshore energy resources across North America. Headquartered in Dallas, TX, Aethon has deployed more than $9 billion over a 34-year track record while generating attractive returns for its fund investors across multiple commodity price cycles. Aethon's vertically integrated strategy provides capital efficient growth, combined with disciplined risk management to support cash flow assurance. Today, Aethon is a leading, low-emission operator and one of the largest private natural gas producers and suppliers to LNG facilities in the U.S., including more than 1,700 miles of midstream infrastructure. Please visit www.AethonEnergy.com for more information. Contacts Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com Release Summary Aethon Energy announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream and midstream Haynesville assets. #Hashtags #Haynesville #LNG #NaturalGas #OilandGas Social Media Profiles Aethon Energy's LinkedIn Profile Contacts Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com Search Advanced News Search Advanced News Search Log In Sign Up",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}