{
    "Title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiamh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1jcmFzaC1iZWxvdy10ZWNobmljYWwtc3VwcG9ydC1pbnRvLW92ZXJzb2xkLXRlcnJpdG9yeS_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 13:50:39 GMT",
    "Categories": [
        "Stock Prices"
    ],
    "Content": "Natural Gas Futures Crash Below Technical Support into Oversold Territory Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures have tumbled below technical support levels this week, setting the market up for a potential bounce. Expand The August New York Mercantile Exchange (Nymex) contract settled at $2.478/MMBtu Monday, down 12.3 cents from the day before and off 21% from a six-month high of $3.129 on June 11. In early trading Tuesday, August futures added to their losses, down 3.6 cents to $2.442. \"The inability to hold key support at $2.50, while not necessarily indicative of severe immediate-term downside, is a glaring indicator of the lack of bullish market appetite,\" EBW Analytics Group analyst Eli Rubin said. Related Tags NYMEX natural gas prices Natural gas futures natural gas trading Cftc Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}