{
    "Title": "Oil futures: Crude prices extend losses on economic, demand concerns - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvb2lsLWZ1dHVyZXMtY3J1ZGUtcHJpY2VzLWV4dGVuZC1sb3NzZXMtb24tZWNvbm9taWMtZGVtYW5kLWNvbmNlcm5zLTI2OTU5Lmh0bWzSAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 16:47:02 GMT",
    "Categories": [
        "Stock Prices",
        "Supply and Demand"
    ],
    "Content": "Oil futures: Crude prices extend losses on economic, demand concerns Oil futures: Crude prices extend losses on economic, demand concerns Crude Oil Refined Products 16 Jul 2024 Quantum Commodity Intelligence - Crude oil futures Tuesday were sliding lower as concerns over broader economic growth offset increasing prospects for a September US rate cut. Front-month Sep24 ICE Brent futures were trading at $83.75/b (1900 GMT), compared to Monday's settle of $84.85/b and an intraday low of $83.30/b. At the same time Aug24 NYMEX WTI was trading at $80.77/b , versus Monday's settle of $81.91/b. Markets remained subdued in the early part of the week despite Federal Reserve Chair Jerome Powell indicating that the nation's central bank does not need to see inflation at 2% before cutting rates. \"The implication of that is that if you wait until inflation gets all the way down to 2%, you've probably waited too long, because the tightening that you're doing, or the level of tightness that you have, is still having effects which will probably drive inflation below 2%,\" Powell said in Monday's comments to the Economic Club of Washington, DC. The comments came after last Thursday's lower-than-expected inflation report lifted the prospect of a long-awaited interest rate cut this September, in turn boosting economic growth and oil consumption. China Benchmarks opened the week softer after disappointing GDP figures from China, while crude oil throughput continued to slide last month as thin margins weighed on utilisation rates across the country. The Chinese National Bureau of Statistics data showed Asia's biggest oil refiner processing 58.32 million mt of crude oil in June, equating to 14.19 million bpd. \"The weak economic data in China also weighed on sentiment in the crude oil market. This comes after data last week showed softness in oil imports. Over the first six months of the year,\" said ANZ commodity strategist Daniel Hynes, adding there are also concerns that demand in the US peaked during the 4 July holiday. Elsewhere, investors continue to monitor stop-start ceasefire talks on the Gaza conflict, while Houthi militants have launched three attempted attacks on regional shipping, including an oil tanker, as the Yemen-based group expands its range to the Mediterranean. This included Houthis publishing a video of a uncrewed surface vessel (USV) hitting the crude oil tanker Chios Lion in the Red Sea on 15 July. The North Sea physical market was also in retreat this week as flagship Forties traded in Monday's MOC window at +$0.60/b to the underlying Dated Brent swap on a FOB basis, having last traded at +1/b on Wednesday. twitter linkedin send print Related Total sees higher Q2 output, slump in refinery margins Crude Oil Refined Products 16 Jul 2024 TotalEnergies sees upstream output at the higher end of its second-quarter guidance, the company said Tuesday... Total's Port Arthur refinery shut for at least a week on steam loss Crude Oil Refined Products 16 Jul 2024 TotalEnergies has been forced to close its troubled Port Arthur refinery in Texas because of a loss of steam... Iraq reaffirms support for OPEC, vows to make up for overproduction Crude Oil 15 Jul 2024 Iraq has reaffirmed its commitment to OPEC and has vowed to make up for overproduction... CHINA DATA: June crude throughput falls to six-month low Crude Oil Refined Products 15 Jul 2024 China's crude oil throughput continued to slide last month as prolonged refinery outages and thin margins weighed on plant... Spec crude net length rises on US rate cut hopes, crude stock draw Crude Oil Refined Products 15 Jul 2024 The speculative net length of Brent and WTI futures extended gains...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}