{
    "Title": "Waha Hub focus of area natural gas industry - Odessa American",
    "Link": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm9hb2EuY29tL2xvY2FsLW5ld3Mvd2FoYS1odWItZm9jdXMtb2YtYXJlYS1uYXR1cmFsLWdhcy1pbmR1c3RyeS_SAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 17:39:49 GMT",
    "Categories": [],
    "Content": "Waha Hub focus of area natural gas industry - Odessa American Facebook Instagram Twitter Youtube E-Edition Logout Sign In MyAccount Newsletter Signup Manage Preferences Link My Account News Sports People Opinion Submit Letter to the Editor Classifieds Obituaries Features Comics Games and Puzzles from King Features eEdition/Tutorial More Newspapers in Education Search E-Edition Logout Sign In MyAccount Newsletter Signup Manage Preferences Link My Account Buy E-edition News Archive Photo Galleries Sports Obituaries Opinion Letters Submit Letter to the Editor E-Edition Features/Tutorial Classifieds Legal Notices Real Estate Jobs Homes Autos Features Games & Puzzles Comics Marketplace Calendar Events More Ask the Expert Special Sections Calendar Digital Advertising Manage Your Account Home Local News Business Waha Hub focus of area natural gas industry Local NewsBusinessIn the Pipeline Facebook Twitter Pinterest WhatsApp A flare burns off excess natural gas near an oil and gas plant Friday, April 8, 2022 in Midland, Texas. (Odessa American/Eli Hartman) COYANOSA The Waha Hub operates in semi-obscurity out here some 60 miles southwest of Odessa in Pecos County, but it is an indispensable part of the Permian Basin's natural gas industry. The Permian Basin Petroleum, Texas Oil & Gas and Texas Pipeline associations say it has also been the scene of consternation as the price of gas has sometimes gone negative in recent years. \"While there is a physical location for the Waha Hub, it is really more a hub for trading natural gas,\" PBPA President Ben Shepperd said. \"The physical network of pipelines crisscrossing the area, which includes intersections at the Waha Hub, connect production to domestic destinations including the West Coast, the Midwest and the Texas Gulf Coast as well as international destinations. \"It is vital that each of the physical assets that make up this network is monitored and protected. While this production originates domestically, it is part of the global marketplace.\" Shepperd said PBPA members are often faced with making difficult business decisions and none are tougher than those tied to the global marketplace including spot prices for production. \"We are proud of the efforts our members make in engaging in such a complex business and the planning it takes to produce this vital commodity that benefits people the world over,\" he said. \"Because of the high levels of production in the Permian Basin and the need for additional takeaway infrastructure, prices for natural gas production traded through the Waha Hub have been depressed. \"And while we all celebrated our nation's independence over the July Fourth holiday, we were not celebrating Waha pricing as we saw prices go to nearly negative $4 for a five-day period. There does not appear to be one identifiable reason for this drop, but it could be attributed to low demand over the weekend and the impacts of Hurricane Beryl, which resulted in gas storage disruption along the Gulf Coast and power outages in certain parts of the state like Houston.\" But U.S. domestic conditions might gradually be improving. The London-based OilPrice.com news website said July 6 that American natural gas storage surplus to the 5-year average of inventories had declined for a seventh consecutive week, falling to 528 billion cubic feet at the end of June on the back of robust gas-fired power demand and production cuts. \"The average value of U.S. natural gas consumption coming from the power sector rose to 45.3 BCf per day by the end of June, a whopping 14-percent higher than the same period a year ago thanks to an exceptionally hot summer,\" OilPrice.com said. \"The launch of the Mountain Valley Pipeline on July 1 has led to a recovery in natural gas output across the Appalachian Basin with production expected to jump to 35 BCf per day from the Marcellus and Utica shale plays. \"For six consecutive weeks already, hedge funds have been holding a net long position in Henry Hub futures, currently around 35,000 contracts, putting an end to extremely bearish market positioning in January-May.\" The Waha Hub has more than a dozen takeaway pipelines including four major interstate pipelines and nine Texas intrastate pipelines, according to the U.S. Energy Information Administration. Some of those include the Trans-Pecos Pipeline, the Agua Blanca Pipeline and the Permian Highway Pipeline. TXOGA Chief Economist Dean Foreman said West Texas needs pipelines to move natural gas, a by-product of oil production, to consumer markets such as the Gulf Coast or exports to Mexico when demand seasonally decreases. \"West Texas has three natural gas storage facilities, OneOK Texas for the Felmac, Keystone and Salado fields, and New Mexico has two more for the Grama Ridge and Washington Ranch fields,\" Foreman said from Austin. \"But the industry still relies on pipeline egress to market the gas and when in-region demand drops, there historically has been excess supply in the spring of recent years.\" Foreman said natural gas spot prices turned negative at the Waha Hub on an average monthly basis in the springs of 2020, 2023 and 2024. \"These are seasonal periods when natural gas consumption eases and storage for the next winter begins,\" he said. \"It's an economic question whether the supply justifies that additional pipeline capacity be built, but this explains why West Texas has distinct characteristics as a natural gas market that differ at times from those at the Henry Hub in Louisiana.\" TPA President Thure Cannon said the Waha is an area where pipelines bring supply from the Permian Basin and other producing areas to access pipelines that take this supply to the demand centers on the West Coast, north to the Mid-Continent and east to the Texas Gulf Coast. \"Waha has evolved over time and it is continuing to grow as production increases along with the need to access markets,\" Cannon said from Austin. \"There are various pipeline headers in the area that help aggregate available supplies and deliver this supply to a market-demand-based pipeline network.\" He said several TPA member companies have assets in the area. \"As production and supply continue to grow, new market access pipelines will need to be developed,\" Cannon said. \"As far as what drives gas prices in the region, it goes back to supply and demand. \"As production grows, there is limited pipeline takeaway and local demand. In general when there is limited local demand or low demand out west, the region will see depressed prices compared with the prices on the Texas Gulf Coast. \"This usually happens in the shoulder months, March to May and October to mid-December.\" %5B%7B%22id%22%3A20%2C%22name%22%3A%22Odessa%20American%20Morning%20Headlines%22%2C%22description%22%3A%22The%20day's%20top%20stories.%22%7D%5D News, straight to your inbox!Sign up for our Odessa American Morning Headlines newsletter. Sorry, something went wrong! subscribe Congratulations! You're all set! Cannon said that has been evident in the last few weeks as high temperatures out west and 100 percent of available pipeline capacity taken helped lift gas prices. \"Periods of low demand and restricted pipeline capacity due to maintenance will usually result in heavily discounted pricing in the region,\" he said. \"It is clear that there is a great demand for a more robust pipeline network in the Waha region as well as throughout Texas so that the midstream industry can continue to deliver the vital hydrocarbons that make all our lives better.\" Like this: Like Loading... Related New pipelines bode well for natural gas marketThings are looking up for Permian Basin natural gas producers with a big new pipeline to the Gulf Coast about to go online and construction of another one about to start. Leaders of the Permian Basin Petroleum, Texas Producers & Royalty Owners and Texas Pipeline associations say the 42-inch Matterhorn...June 5, 2024In \"Business\" Pipelines key to cutting methane emissionsTexas' 417,513 miles of intrastate oil and gas pipelines are crucial are to solving the state's problem with methane emissions and flaring and the presidents of the Texas Pipeline and Texas Independent Producers & Royalty Owners associations say there is an all-out effort to add what's needed. \"An adequate pipeline...January 15, 2023In \"Local News\" More oil, gas pipelines neededMostly out of sight but not out of mind, you might think Texas' 417,513 miles of intrastate oil and gas pipelines would be more than sufficient for the foreseeable future. Not so, say representatives of the Texas Independent Producers & Royalty Owners Association, Pinnacle Midstream Inc., the American Petroleum Institute...April 8, 2022In \"In the Pipeline\" Featured Local Savings Featured Local Savings RELATED ARTICLESMORE FROM AUTHOR Sul Ross hosts cyber camp for high school students Texas man facing execution for 1998 killing of elderly woman for her money Border arrests plunge 29% in June to the lowest of Biden's presidency as asylum halt takes hold Based in Odessa, Texas, the Odessa American was founded in 1940. Odessa American 700 N. Grant Ave., Suite 800 Odessa, TX 79761-4590 (432) 337-4661 Facebook Instagram Twitter Youtube (c) 2024 Odessa American | AIM Media Network | %d Choose your subscription to the Odessa American. Already a subscriber? Log in here",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}