{
    "Title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyNC8wNy8xNC9kYW5nb3RlLXJlZmluZXJ5LXRvLXNvdXJjZS1jcnVkZS1vaWwtZnJvbS1vdGhlci1hZnJpY2FuLWNvdW50cmllcy1hZnRlci1pbXBvcnRzLWZyb20tdXMtYnJhemlsLTIv0gGLAWh0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDI0LzA3LzE0L2RhbmdvdGUtcmVmaW5lcnktdG8tc291cmNlLWNydWRlLW9pbC1mcm9tLW90aGVyLWFmcmljYW4tY291bnRyaWVzLWFmdGVyLWltcG9ydHMtZnJvbS11cy1icmF6aWwtMi8_YW1wPTE?oc=5",
    "Published": "Sun, 14 Jul 2024 11:03:03 GMT",
    "Categories": [
        "Trade and Export"
    ],
    "Content": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil - Nairametrics Login Register HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: No Result View All Result Home Sectors Energy Dangote Refinery to source crude oil from other African countries after imports from US, Brazil by Cyrus Ademola 1 week ago in Energy, Sectors Aliko Dangote Share on FacebookShare on TwitterShare on Linkedin The Chairman of Dangote Refinery, Aliko Dangote, said that his company will source crude oil from other African oil-producing nations following recent imports from the United States and Brazil.Dangote made this disclosure in a statement to newsmen during a tour in his Lagos-based refinery on Saturday.According to the business mogul, the refinery is expecting feedstock acquired from the US and Brazil in the coming months. Related Stories Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 He mentioned that conversations are ongoing to secure more crude from African countries like Angola, Senegal, and Libya, all of which are oil-producing nations. \"We will start importing crude oil from African countries. When we get to those countries, we'll start negotiating with them. We'll start bringing in from there. \"We have just bought from US and Brazil. So I think by next month, we'll expand the scope to most of African countries. \"If we availability in Nigeria, we won't have to turn to these other countries,\" Dangote said.When asked about the timeline for sourcing crude from these African countries, Dangote stated that it could begin as soon as next month. News continues after this ad \"Very soon. I think by next month. You know crude, you have to book two months in advance. So, I'll say October we'll be bringing in from these African countries,\" Dangote responded. Feedstock from US, Brazil According to recent reports, Dangote refinery secured 6 million barrel crude oil from US, which is expected to reach the $19 billion facility by August.In addition, the mega refinery will also receive about 5 million barrel of crude oil from US by September, data from Bloomberg show.Accordingly, Dangote is also sourcing crude from the South American country, Brazil, in the coming months to ramp up production as it sets to commence the supply of petrol to the market this month.The leadership of Dangote has vehemently lamented the unavailability of crude in Nigeria, forcing the oil facility to seek alternatives from other countries. IOCs unable to supply local refineries Despite being a leading oil producer, Nigeria still struggles to meet its OPEC quota as well as supply local refineries in the country.Some local refineries, including Dangote, have accused International Oil Companies (IOCs) of refusal to meet their demands, alleging that these IOCs prefer to sell the crude abroad.In response, the regulatory body of oil in Nigeria, NUPRC, has insisted that the IOCs meet local demands first, before exporting to other African countries. PMS Supply expected in July Moreover, Dangote has said his refinery will supply petrol to local marketers this month.Dangote mentioned that the change in date was due to a slight delay, prompting the shift from the originally proposed June to mid-July.The CEO said the refinery will commence production of petrol between 10 and 15 of July, while supply to local marketers will commence from the third week of the same month. \"We had a bit of delay, but PMS will start coming out by 10 to 15 of July. But then we want to keep it in tank to make sure that it settles. So by third week of July, we'll be able coming out to take it into the market,\" Dangote said.The refinery is expected to significantly reduce Nigeria's dependence on imported petroleum products. Follow us for Breaking News and Market Intelligence. Tags: Aliko DangoteBrazilCrude Oil ImportDangote RefineryOPECUS Cyrus Ademola Cyrus Ademola is a political and economy analyst with over half a decade experience in journalism, research-based oped, economic reportage and political analysis. His works have been featured on different media outlets, covering from politics to business trends, to crime and security as well as the real estate sector. Related Posts Energy Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Op-Eds Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Economy Dangote Refinery: 'Non-availability of crude oil' to domestic refineries affecting fuel quality in Nigeria - Lawmakers July 22, 2024 Energy Dangote refinery to import crude oil from Libya July 22, 2024 Energy \"Let them (NNPCL) buy me out and run the refinery\" says Aliko Dangote amid monopoly allegations July 21, 2024 Digital Media Energy Expert Kelvin Emmanuel on Dangote Refinery Challenges and NNPC's Strategic Stake. July 21, 2024 Next Post How digital financial services are transforming property transactions in Nigeria Comments 2 Michael says: July 14, 2024 at 3:50 pm It is a shame on this country and government not to provide crude oil for Dangote Refinery. It is not patriotic on the side of the people in government to allow this to happen. Our local refineries ought to get crude first before exporting the excess to other countries. By this action government and NNPC and all regulators concern have proved to us that making money for themselves is more important than Nigeria economy and her citizen s welfare. There should be immediate ban on crude oil exchange or swap for refined products outside Nigeria. If there should be any, it should be given to Dangote Refinery or any of the local Refineries not foreign Refineries. Reply Abba says: July 14, 2024 at 6:49 pm So this is how we are going to continue to be clolonised indirectly.. Shame on our leaders. They prefer to please their western evil freinds in exchange for their immunity. Rather than putting their country first. Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment *Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Ad Next Stay Riding Motorbike Alone Across Laos - Beautiful Memories from LAOS - Nếm TV 40 42 00:00 00:00 / 00:00 10 Sec Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar Consultant returns N1.5 billion from NIRSAL contract to EFCC Follow us on social media: Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Download Nairametrics iOS AppDownload Nairametrics Android AppHomeMarketsSectorsEconomyBusiness NewsFinancial LiteracyDisclaimerAds Disclaimer (c) 2024 Nairametrics Welcome Back! Login to your account below Remember Me Forgotten Password? Sign Up Create New Account! Fill the forms below to register All fields are required. Log In Retrieve your password Please enter your username or email address to reset your password. Log In No Result View All Result HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Login Sign Up (c) 2024 Nairametrics Advertisement",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}