{
    "Title": "New North Hamada Pipeline Boosts Libyan Oil Production - Energy Capital & Power",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZW5lcmd5Y2FwaXRhbHBvd2VyLmNvbS9uZXctbm9ydGgtaGFtYWRhLXBpcGVsaW5lLWJvb3N0cy1saWJ5YW4tb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 08:55:58 GMT",
    "Categories": [
        "Production Updates"
    ],
    "Content": "New North Hamada Pipeline Boosts Libyan Oil Production This website stores cookies on your computer. These cookies are used to improve your website experience and provide more personalized services to you, both on this website and through other media. To find out more about the cookies we use, see our Privacy Policy. We won't track your information when you visit our site. But in order to comply with your preferences, we'll have to use just one tiny cookie so that you're not asked to make this choice again. Accept Decline Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences Terms of Use Privacy Policy {title} New North Hamada Pipeline Boosts Libyan Oil Production Connect with us: Facebook Twitter Youtube Linkedin Instagram July 15, 2024 A new pipeline from the North Hamada oil field in Libya, developed by the Libyan National Oil Corporation (NOC)'s subsidiary, Nafusa Oil Operations, has commenced operations. On July 8, the field's production began flowing to the Mellitah oil port through the 250 km Al-Feel - Mellitah oil pipeline. In May 2024, state-owned Mellitah Oil and Gas and Nafusa Oil Operations signed an agreement for the transport, handling, and shipment of crude oil via the Al-Feel - Mellitah pipeline and completed a new shipping line. Production from the field will gradually increase, reaching 8,000 barrels per day by mid-July and 10,000 barrels per day by next August. Over the past few months, NOC has been revitalizing and rehabilitating several production sites with the goal of achieving a production rate of 2 million barrels per day by 2030. Share This Article Industry Insights TotalEnergies Divests Interest in Nigerian Joint Venture Read More >> Senegal to Implement Regulatory Framework for Electric Vehicles Read More >> Ivory Coast's $20B Infrastructure Plan to Spur Economic Growth Read More >> Anne Laure Klein Anne-Laure Klein works as a field editor for Energy Capital & Power. She graduated in Political Science with a Master's degree in International Relations and geopolitics. Before joining ECP, she worked as a Senior Account manager for International Tech and Energy companies. She is from French, Syrian and Italian descent, and fluently speaks English, French, Spanish and Italian. On a personal level, she is a seasoned traveler and has visited more than 110 countries. Trending News Articles What to Expect From First Oil in the MSGBC Region First oil from Senegal's Sangomar Field could drive an exploration resurgence in the region, along with new gas-to-power and refining projects. Read More >> News Articles From Africa to Europe: Securing Investment for Gas Export Infrastructure Supplying African gas to Europe calls for increased investments in associated export infrastructure - a focal point of the upcoming Invest in African Energy forum in Paris. Read More >> News Articles Angola Oil & Gas Summit Returns to Luanda in October, Unveiling Unprecedented Investment Opportunities in Africa's Energy Hub With substantial oil and gas reserves, an improved operating environment and a burgeoning energy industry, Angola is an attractive destination for international investors seeking opportunities in the African market. Read More >> Proud member of Supported by Sign up for latest news and event info Facebook Youtube Linkedin Instagram Events MSGBC Oil, Gas & Power Libya Energy & Economic Summit Global Black Impact Summit Services ECP Event Services ECP Creative & Marketing Custom Publishing About What is ECP? Partners What People Say News reports Careers Contact Privacy Policy · Terms of Use error: Content is protected !! Manage consent",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}