{
    "Title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiiwFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL3NlbGxpbmctY29udGludWVzLWZvci1uYXR1cmFsLWdhcy1mdXR1cmVzLWNhbGlmb3JuaWEtY2FzaC1kb3duLXNoYXJwbHktZGVzcGl0ZS1oZWF0LW1pZGRheS1tYXJrZXQtc25hcHNob3Qv0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 18:55:40 GMT",
    "Categories": [
        "Market Trends",
        "Stock Prices"
    ],
    "Content": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track to decline for a sixth straight session through midday trading Tuesday, undercut by cooler weather forecasts and weaker cash prices. Expand Here's the latest: August Nymex natural gas futures down 3.9 cents to $2.439/MMBtu as of 2:22 p.m. ET Back of the curve higher after a federal court in Louisiana ordered the U.S. Department of Energy (DOE) to lift LNG permit pause Related Tags NYMEX natural gas prices PG&E citygate Natural gas futures SoCal Border Avg. Biden LNG Pause Sabine Pass LNG Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}