{
    "Title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices - World Pipelines",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy53b3JsZHBpcGVsaW5lcy5jb20vc3BlY2lhbC1yZXBvcnRzLzAyMDcyMDI0L3J5c3RhZC1lbmVyZ3ktYnVsbGlzaC1tYXJrZXQtZnVuZGFtZW50YWxzLWFyZS10aGUtbWFpbi1jb250cmlidXRpbmctZmFjdG9yLXRvLWhpZ2hlci1nbG9iYWwtb2lsLXByaWNlcy_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:38:00 GMT",
    "Categories": [
        "Market Trends"
    ],
    "Content": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices | World Pipelines For full functionality of this site it is necessary to enable JavaScript. Here are the instructions how to enable JavaScript in your web browser. Skip to main content Advertisement Home Special reports 02 Jul 24 Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices Advertisement Here is Rystad Energy's oil macro update from Global Market Analysis Director Claudio Galimberti: \"Strong market fundamentals are pushing oil prices higher this week, on track for four consecutive weeks of increases. Lower crude exports from OPEC and Russia, just as refinery runs ramp up for the summer peak, are helping contribute to a tighter-than-expected market, and prices are reacting accordingly. Increasingly likely interest rates cuts by the Fed in coming months and still high geopolitical risk premium are adding to the upward pressure.\" Better-than-expected market fundamentals and expectations of forthcoming interest rate cuts by the US Federal Reserve are helping keep oil prices on a bullish trajectory this week.Rystad Energy modelling suggests most of the price increases have been driven by bullish fundamentals, specifically on the refining and crude side, while macroeconomic factors and ongoing concerns regarding the escalation of conflicts in the Middle East and Ukraine have played a secondary, albeit non-negligible, role.Brent prices increased by more than 6% in June, and July is starting on a similar path.Looking at the fundamentals, we have significantly lowered our forecast for US oil production from August onwards.These adjustments reflect a downturn in Permian oil output due to ongoing low activity and consolidation through mergers and acquisitions.Most changes are concentrated on the Texas side, while New Mexico has shown resilience, although April data reflects a decline in monthly figures, averaging a fall of approximately 80 000 bpd. Overall, the downward adjustment from August 2024 through December 2025 averages about 200 000 bpd.These adjustments are bullish for Brent prices and support a narrowing of the WTI-Brent spread.It should help provide some relief for OPEC+, given the production cuts they have implemented and the planned unwinding of the voluntary reductions starting in October, for the following 12 months.Recent reports suggest OPEC+ crude exports declined in June versus May, but the latest official data showed steady exports from the Middle East and declining exports from Russia in May.If crude exports from OPEC - after accounting for changes in crude burns and refinery runs - are confirmed to have declined by somewhere between 3% and 4% in June, then that may point to greater compliance by OPEC members. However, that is still speculative.Russia's seaborne crude flows in the week to 23 June appear to have dropped by 0.66 million bpd, to the lowest in more than three months.The combined effect of lower crude exports from OPEC and Russia, right at the time when global refinery runs are expected to further rump up - from 83.1 million bpd in June to 84.4 in August - would explain the tighter crude market and the surge in Brent prices over the past three weeks.On macroeconomics, the latest data from the Bureau of Economic Analysis (BEA) showed that US inflation, measured by the personal consumption expenditures (CPE) index, eased further to 2.6% year on year in May, matching expectations. The core PCE, excluding food and fuel prices, also decreased to 2.6%, the lowest since March 2021.These figures are pivotal for the Federal Reserve's upcoming rate-setting decision on 31 July, with markets anticipating at least two quarter-point rate cuts this year, potentially starting in September. Despite the encouraging inflation data, a September cut remains uncertain as the pace of decline remains slow, which may be perceived as too gradual. On the political front, the US Presidential debate on Thursday night has dominated the airwaves.Early policy indications suggest either candidate would favour protectionist measures and large budget deficits if elected.This isn't good news for inflation, as both stances are inflationary.Energy-specific messaging was hard to identify in the debate, but it's safe to assume that a Trump administration would be pro-deregulation while Biden would continue to push policies aimed at advancing the green transition. In Europe, French President Emmanuel Macron's decision to call snap elections for the National Assembly backfired on Sunday as the National Rally party won by a significant margin in the first round of voting. Macron took a huge risk, but with the second round of voting this coming weekend, the exact fallout is still unclear.The second round of voting on 7 July will be pivotal for France's political stability and its leadership within the EU and the transatlantic community during this critical period. Read the latest issue of World Pipelines magazine for pipeline news, project stories, industry insight and technical articles. World Pipelines' June 2024 issue The June 2024 issue of World Pipelines includes a keynote section on hydrogen pipeline transport, in which Contributing Editor Gordon Cope offers a broad look at the global hydrogen pipeline market, and Atmos International discusses modelling pure hydrogen pipelines. Also in the issue: technical articles on subsea survey, pigging tool performance, HDD operations for the Trans Mountain Expansion project, and more. Read the article online at: https://www.worldpipelines.com/special-reports/02072024/rystad-energy-bullish-market-fundamentals-are-the-main-contributing-factor-to-higher-global-oil-prices/ You might also like The ADCC pipeline entered commercial service on July 1, 2024, and is capable of providing approximately 1.7 billion cubic feet per day of natural gas. Embed Embed article link: (copy the HTML code below): Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices xClose This content is available to registered readers of our magazine only. Please sign in or register for free. Benefits include Access to locked videos & articles Downloadable white papers Full website access Register for free >> Get started now for absolutely FREE, no credit card required. Already a member? Sign in here xClose Do you have the right tools to harness your data effectively? Join us on 17 July for a live webinar and Q&A session with dataPARC entitled 'Beyond ProcessBook & PI Vision: Exploring Today's Industrial Analytics Tools'. Register for FREE",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}