{
    "Title": "US natural gas pipeline ADCC begins commercial operations - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vdXMtbmF0dXJhbC1nYXMtcGlwZWxpbmUtYWRjYy1zdGFydHMtY29tbWVyY2lhbC1vcGVyYXRpb25zLTExMjEzNdIBAA?oc=5",
    "Published": "Mon, 15 Jul 2024 05:40:19 GMT",
    "Categories": [],
    "Content": "US natural gas pipeline ADCC begins commercial operations US natural gas pipeline ADCC begins commercial operations July 12 (Reuters) - Infrastructure firm WhiteWater said on Friday the ADCC pipeline in South Texas started commercial service on July 1, amid surging U.S. liquefied natural gas exports to global markets. The 40-mile pipeline has a capacity to transport about 1.7 billion cubic feet per day (bcfd) of natural gas to the Cheniere Corpus Christi Liquefaction facility from Whistler Pipeline's Agua Dulce Header in South Texas. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt ADCC is owned 70% by Whistler Pipeline - a joint venture of WhiteWater and Enbridge - and 30% by a subsidiary of Cheniere. The U.S. is forecast to export a record 12.2 bcfd of natural gas this year. It became the world's biggest LNG supplier in 2023 and has stayed ahead of recent leaders Australia and Qatar. WhiteWater said the pipeline provides Cheniere direct access to Permian and Eagle Ford volumes in addition to volumes sourced along the Gulf Coast. (Reporting by Tanay Dhumal in Bengaluru; Editing by Shilpi Majumdar and Sriraj Kalluvila) Related Articles Jul 22, 2024 2:41:pm Freeport LNG in Texas resumes exports as gas processing ramps up Jul 22, 2024 1:45:pm EUROPE GAS-Prices inch down on comfortable stocks, Freeport LNG Jul 22, 2024 11:36:am Portugal's Galp second-quarter profit jumps 16%, beats expectations BDOW!",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}