{
    "Title": "Oil prices tumble as demand worries in China - Al Bawaba",
    "Link": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmFsYmF3YWJhLmNvbS9idXNpbmVzcy9vaWwtcHJpY2VzLXR1bWJsZS1kZW1hbmQtd29ycmllcy1jaGluYS0xNTc3MzU40gEA?oc=5",
    "Published": "Tue, 16 Jul 2024 07:50:00 GMT",
    "Categories": [
        "Supply and Demand"
    ],
    "Content": "Oil prices tumble as demand worries in China | Al Bawaba Skip to main content Home BUSINESS Oil prices tumble as demand worries in China Oil prices tumble as demand worries in China Published July 16th, 2024 - 07:50 GMT FacebookTwitterWhatsAppShare Shutterstock Oil prices decreased on Tuesday as the weak economic data in China caused worries about a slowing economy crimping demand in the world's largest crude oil importer. International benchmark Brent crude traded at $84.23 per barrel at 09.39 a.m. local time (0639GMT), a decline of 0.73% from the closing price of $84.85 per barrel in the previous trading session.The American benchmark West Texas Intermediate (WTI) traded at $80.22 per barrel at the same time, a 0.77% fall from the previous session that closed at $80.84 per barrel.The gross domestic product (GDP) of China rose by 4.7% in the second quarter of 2024, below market expectations, according to official figures on Monday.The country's economy expanded by 5.3% in the first quarter, and the market forecast was a GDP growth rate of 5.1% in the second quarter, the National Bureau of Statistics said.This comes after data last week showed softness in oil imports, according to Daniel Hynes, a commodity strategist at the Australia and New Zealand Banking Group.\"Over the first six months of the year, the world's top importer bought less crude oil compared with last year. June crude oil imports fell on both a monthly and annual basis to 46.45 million tons,\" Hynes said in an e-mailed note.Hynes also added that a stronger US dollar emerged as investors ratcheted up their bets that former US President Trump would win back the White House, which dented investor appetite. The US dollar index rose by 0.18% to 104.065 at 09.39 a.m. local time (0639GMT), compared to the previous trading session close. The higher US dollar curbs oil demand and supports price declines.Trump was targeted in an assassination attempt during a rally in Pennsylvania on Saturday, just days before he was set to accept the Republican nomination for a third term.However, increased expectations that the US Federal Reserve's (Fed) interest rate cut will start soon limited further price declines.The Fed is receiving \"more good\" inflation data, paving the way for its first interest rate cut later this year, Chair Jerome Powell said Monday.Speaking at the Economic Club of Washington, DC, Powell reiterated his comments that the US central bank is looking for \"greater confidence\" that inflation is returning to its 2% target.Powell noted the Fed does not need to wait until inflation hits its 2% long-term target to begin lowering interest rates because of the lagging effect of monetary tightening on inflation data.Market players interpreted Powell's remarks as a return to interest rate cuts may not be far off.Lower interest rates are set to reduce the cost of consumer borrowing and stoke expectations of increased economic growth and demand for oil. Tags:ChinaOilOil Prices Via SyndiGate.info LatestPopular Oil prices tumble as demand worries in China Billie Eilish set to read CBeebies bedtime story to ... New research shows how reducing screen time improves ... American Kestrel finds temporary home in Winnipeg city hall Canada's manufacturing sales see a rise by 0.4% in May Loading content ... Sign up to our newsletter for exclusive updates and enhanced content Sign up to get Al Bawaba's exclusive celeb scoops and entertainment news (c) 2000 - 2024 Al Bawaba (www.albawaba.com) ✓ Thanks for sharing! AddToAny More...",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}