{
    "Title": "ADCC natural gas pipeline in Texas enters commercial service - Daily Energy Insider",
    "Link": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZGFpbHllbmVyZ3lpbnNpZGVyLmNvbS9uZXdzLzQ0NTAyLWFkY2MtbmF0dXJhbC1nYXMtcGlwZWxpbmUtaW4tdGV4YXMtZW50ZXJzLWNvbW1lcmNpYWwtc2VydmljZS_SAQA?oc=5",
    "Published": "Tue, 16 Jul 2024 11:32:24 GMT",
    "Categories": [],
    "Content": "ADCC natural gas pipeline in Texas enters commercial service - Daily Energy Insider Home >> ADCC natural gas pipeline in Texas enters commercial service « Arizona regulators laud largest utilities for successfully meeting higher electricity demands NREL researchers say offshore wind turbines offer path for clean hydrogen production >> ADCC natural gas pipeline in Texas enters commercial service Published on July 16, 2024 by Dave Kovaleski Shares Share Post Pin Share Share Mail Share (c) Shutterstock On July 1, the ADCC Pipeline in Texas entered commercial service. The 40-mile pipeline transports natural gas from Whistler Pipeline's Agua Dulce Header to Cheniere's Corpus Christi Liquefaction facility in Texas. The pipeline is capable of providing approximately 1.7 billion cubic feet per day (Bcf/d) of natural gas transportation capacity to the Cheniere Corpus Christi Liquefaction facility from markets on Whistler Pipeline's Agua Dulce Header in South Texas. The receipt points in Agua Dulce provide Cheniere direct access to Permian and Eagle Ford volumes in addition to volumes sourced along the Gulf Coast. The ADCC Pipeline further enhances the natural gas infrastructure in Texas and creates an additional demand point for Permian gas. Further, the infrastructure supports U.S. LNG exports to global markets. The ADCC Pipeline is a joint venture owned 70 percent by Whistler Pipeline LLC, which is a joint venture between WhiteWater, MPLX LP, and Enbridge - and 30 percent by a wholly-owned subsidiary of Cheniere Energy. WhiteWater is an Austin, Texas-based infrastructure company and operator of the Whistler Pipeline. The Whistler Pipeline is an approximately 450-mile, 42-inch intrastate pipeline that transports natural gas from the Waha Header in the Permian Basin to Agua Dulce, Texas, providing direct access to South Texas and export markets. An approximately 50-mile 36-inch lateral provides connectivity to the Midland Basin. « Arizona regulators laud largest utilities for successfully meeting higher electricity demands NREL researchers say offshore wind turbines offer path for clean hydrogen production >> Connect with Us Podcast Have an idea for our new podcast? Share It with Us Sponsored Content: Fortress Information Security's CEO, Alex Santos, on the latest in electric utility cybersecurity Oil markets in the time of conflict with API's Dean Foreman Sponsored Podcast: Fortress A2V with Tobias Whitney Ransomware and US Energy Companies The Digital Divide: Electric utilities to the rescue? RECEIVE WEEKLY NEWSLETTER Please leave this field empty First Name * Last Name * Email Address * Organization Check your inbox or spam folder now to confirm your subscription. Please review our Privacy Policy before submitting. Most Read Last 7 Days ADCC natural gas pipeline in Texas enters commercial service ESG Clean Energy develops a breakthrough carbon capture system Duke Energy Florida reaches rate case agreement with consumer, business groups Indiana Michigan Power seeks more clean-energy generation resources in Michigan GSA, Defense Department seeking contractors to provide clean energy NEADA co-releases report showing most Americans have no utility shut-off protections NREL researchers say offshore wind turbines offer path for clean hydrogen production New tariffs would stifle U.S. solar progress, says ACORE analysis Federally proposed bill promotes Energy Dept.'s use of AI in energy, national security, science FirstEnergy gains $1.2B in proceeds as sale of transmission subsidiary gets finalized Latest Policy News Energy adequacy key component in grid planning, NERC report says Rhode Island Energy requests lower winter rates from state regulators Congress members urge DOT to finalize gas pipeline leak detection rule Minnesota regulators greenlight final site permit for Xcel's massive solar project Wyoming Congress members urge DOI to rescind plan that would hurt coal leasing news archive 2024 2024 Jul Jun May Apr Mar Feb Jan 2023 2023 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2022 2022 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2021 2021 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2020 2020 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2019 2019 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2018 2018 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2017 2017 Dec Nov Oct Sep Aug Jul Jun May Apr Mar Feb Jan 2016 2016 Dec Nov Oct Sep Aug Jul Jun May Apr Home News Source Electric Oil and Natural Gas Renewable Nuclear Policy Federal State Infrastructure Reports About Daily Energy Insider Editorial Team Corrections Policy Macallan Communications Contact Please ensure Javascript is enabled for purposes of website accessibility",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}