{
    "Title": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vZWd5cHRzLWdhcy1vdXRwdXQtYXQtNS43LWJsbi1jdWJpYy1mZWV0LXBlci1kYXktcGV0cm9sZXVtLW1pbmlzdHJ5LXNwb2tlc3BlcnNvbi1zYXlzLTExMTkzNtIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:48:14 GMT",
    "Categories": [
        "Production Updates"
    ],
    "Content": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says CAIRO, July 1 (Reuters) - Egypt's gas production is currently at 5.7 billion cubic feet per day, the state news agency MENA quoted the spokesperson of the petroleum ministry as saying on Monday. The spokesperson also said that it was agreed that 21 liquefied natural gas cargos are to arrive in Egypt during the summer, in addition to shipments of mazut fuel. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt The first gas shipment arrived on Monday, and it is currently being discharged for supply into the national gas grid, the ministry spokesperson said. \"With the third week of July...the national gas grid's supply will be sufficient,\" he added. In June, Egypt fully awarded 20 cargoes of LNG in its biggest purchase of the seaborne fuel, aimed to cover heavy summer demand from July through September. Supplies of the natural gas that helps Egypt generate electricity have been dwindling at a time when an expanding population and urban development have been pushing up electricity demand. When temperatures rise, air conditioning use drives up power consumption. Egypt needs to import around $1.18 billion worth of natural gas and mazut fuel oil to end persistent power cuts exacerbated by consecutive heatwaves, Prime Minister Mostafa Madbouly said last month. (Reporting by Jaidaa Taha and Muhammad Al GebalyEditing by Chris Reese and Leslie Adler) Related Articles Jul 16, 2024 5:45:am US natgas prices drop 7% to 10-week low on Texas Freeport LNG outage Jul 16, 2024 4:45:am Australia's Vintage delays Odin-2 well completion due to heavy rainfall Jul 16, 2024 3:30:am CNOOC achieves exploration breakthrough in Bohai Bay",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}