{
    "Title": "Williams project clears legal hurdle for Louisiana natural gas pipeline crossings - 10/12 Industry Report",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LjEwMTJpbmR1c3RyeXJlcG9ydC5jb20vbGVnYWwvd2lsbGlhbXMtcHJvamVjdC1jbGVhcnMtbGVnYWwtaHVyZGxlLWZvci1sb3Vpc2lhbmEtbmF0dXJhbC1nYXMtcGlwZWxpbmUtY3Jvc3NpbmdzL9IBAA?oc=5",
    "Published": "Mon, 15 Jul 2024 20:04:26 GMT",
    "Categories": [],
    "Content": "Williams project clears legal hurdle for Louisiana natural gas pipeline crossings Facebook Linkedin Home Petrochemical Oil & Gas Faces of Industry Workforce Industry Focus Operations & Maintenance Safety Environmental Transport Construction & Design Newsletter 10/12 Industry Weekly Sign up for our free newsletter Store Search Get the newsletter Advertise Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. 10/12 Industry Report Home Petrochemical Oil & Gas Faces of Industry Workforce Industry Focus Operations & Maintenance Safety Environmental Transport Construction & Design Newsletter 10/12 Industry Weekly Sign up for our free newsletter Store Home Legal Williams project clears legal hurdle for Louisiana natural gas pipeline crossings Tuesday, July 16, 2024 Facebook Linkedin Email Print (iStock) A second Louisiana court has sided with Williams in its dispute with Energy Transfer LP over natural gas pipeline crossings, clearing another obstacle for the Louisiana Energy Gateway (LEG) system that would supply LNG export terminals, reports Natural Gas Intelligence . The 42nd Judicial District Court in DeSoto Parish ruled that Energy Transfer could not block Williams from constructing LEG pipeline crossings under the ETC Texas Pipeline in DeSoto and Sabine parishes in northwestern Louisiana. Williams as well as DT Midstream Inc. (DTM) and Momentum Midstream LLC have accused Energy Transfer of upending industry practices for pipeline crossings. The pipeline operators have said it is an attempt by Energy Transfer to prevent competitors from transporting natural gas from the Haynesville Shale. Energy Transfer has in turn defended its land use rights. Read more. (c) 10/12 Industry Report. All rights reserved. MORE STORIES Environmental Shell backs off increased use of 'advanced recycling' despite successful Louisiana... 10/12 Industry Report Staff",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}