{
    "Title": "July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvanVseS1iaWR3ZWVrLW5hdHVyYWwtZ2FzLXByaWNlcy1yYWxseS1hcy1zdW1tZXItZGVtYW5kLWV4cGVjdGF0aW9ucy1lc2NhbGF0ZS_SAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:44:00 GMT",
    "Categories": [
        "Supply and Demand"
    ],
    "Content": "July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Natural gas prices advanced in July bidweek trading as forecasts called for strong early summer heat to further intensify and cover more of the Lower 48 in the month ahead, offsetting rising production volumes and stout supplies in storage. Expand NGI's July Bidweek National Avg. climbed 40.0 cents month/month to $2.215/MMBtu. That was down from $2.560 a year earlier. Trading for the latest bidweek period spanned June 24-26. Weather conditions proved mostly hot across the southern two-thirds of the Lower 48 in that span. National Weather Service (NWS) forecasts call for more of the same through the first half of July, with the heat spreading further to the northern third of the country. NWS outlooks also repeatedly have predicted above-average national temperatures for the summer overall. \"The weather backdrop is simply bullish,\" Pinebrook Energy Advisors' Andy Huenefeld, managing partner, told NGI during bidweek. Several natural gas hubs in California and the Southwest, where scorching temperatures were widespread over the final days of June and forecasted to sizzle further in coming weeks, propelled the overall increase during bidweek. Those regions also are dependent in part on gas from the Permian Basin, where maintenance work amid pipeline constraints in June limited supplies flowing west. SoCal Citygate surged $1.335 month/month to average $3.055, and SoCal Border Avg. jumped $1.235 to $2.565. In the Southwest, KRGT Del Pool spiked $1.150 to $2.740, while El Paso S. Mainline/N. Baja rose $1.400 to $2.600. Futures prices, however, struggled in late June as traders fixated on rising production and robust inventories of gas stored underground. Production consistently held around 100 Bcf/d late last month, rising from spring lows in the mid-90s Bcf/d, according to Wood Mackenzie. The firm on Monday estimated output at 100 Bcf/d. At the same time, supplies in storage remained abundant. The U.S. Energy Information Administration (EIA) reported an injection of 52 Bcf for the week ended June 21. The increase boosted inventories to 3,097 Bcf and put stocks 21% above the five-year average of 2,569 Bcf. The futures market \"is a little bit in a wait-and-see mode, wanting to actually witness the July heat develop as forecasted,\" StoneX Financial Inc.'s Thomas Saal, senior vice president of energy, told NGI. \"Because if that heat doesn't come through, we're going to be sitting on a lot of gas.\" Futures Pressure On the final day of the latest bidweek period, the July Nymex natural gas futures contract rolled off the board with a 12.8-cent loss. It settled at $2.628 on that Wednesday, down 3% from the prior week's close. It had lost ground the previous week as well. The August contract moved to the front of the curve last Thursday and fell 6.0 cents in that session and another 8.4 cents the following day. On Monday, it settled at $2.478, down 12.3 cents. \"We remain focused on rising natural gas production in mid-summer as drillers return deferred supply to the market,\" said EBW Analytics Group's Eli Rubin, senior analyst. Any \"downturn in cooling demand could send gas tumbling.\" Still, Rubin noted the forecasts point to solid demand ahead, and on the storage front, the surplus to the five-year average has narrowed over the past two months. With the latest EIA print, the surfeit declined by two percentage points. It has been cut in half since topping 40% in March. If that continues alongside scorching mid-summer conditions, he said, futures could rally. \"In the most likely scenario, record July heat may reinforce support for gas prices, whittle down storage surpluses, and allow\" the August contract \"to rebound towards $3.00 in the near-to-medium term.\" Catalysts Ahead While rising production creates a bearish undercurrent to watch closely, Rubin also noted that several new LNG facilities are in the works along the Gulf Coast that could double liquefied natural gas demand before the end of this decade. The first of them could open later this year, launching the trend. Notably, in late June, Texas Eastern Transmission LP began feeding gas to a pending Venture Global LNG Inc. export terminal through Gator Express in Louisiana. The initial test volumes to Plaquemines LNG indicated the facility was on track \"to start exporting in late 2024,\" Wood Mackenzie analyst Nadeem Ahmed said. Rubin described the testing as \"a momentous\" for Venture Global LNG. \"The speed of the near-term ramp up at Plaquemines may offer sufficient demand for natural gas to ward off oversupply later this year,\" he said. Wood Mackenzie data showed gas flows to LNG export facilities at 12.5 Bcf on Monday, up from an average of 12 Bcf/d last week. In the near term, NWS forecasts showed hotter-than-normal high temperatures from the upper 80s to 100s canvassing large swaths of the country from the Southwest to the East Coast this week. \"The first week of July marks the approximate six weeks of the year that typically bring the hottest conditions to most of the nation,\" said AccuWeather meteorologist Alex Sosnowski. \"When temperatures exceed the historical average even by a few degrees this time of the year, the heat can be dangerous.\" For the second week of July, highs from the 80s to low 90s were expected to spread over northern markets, while temperatures in the upper 80s to 100s were predicted to remain prevalent throughout southern areas. That would mark a continuation from late June. Strong heat in the final week of the month was expected to result in a seasonally light storage injection with the next EIA report on Wednesday - a day earlier than usual this week because of the Fourth of July holiday on Thursday. Preliminary injection estimates submitted to Reuters for the week ended June 28 ranged from 13 Bcf to 76 Bcf, with an average of 41 Bcf. NGI modeled a build of 29 Bcf. That compares with a five-year average increase of 69 Bcf. With those bullish factors in play, NGI's Patrick Rau, senior vice president of Research & Analysis, said Monday that futures were \"well into oversold territory now.\" However, he added, since the August contract fell below $2.50, \"there could be some follow-on selling down toward the next technical support level in the $2.40 range.\" Related Tags natural gas production weather Kevin Dobbs Kevin Dobbs joined the staff of NGI in April 2020. Prior to that, he worked as a financial reporter and editor for S&P Global Market Intelligence, covering financial companies and markets. Earlier in his career, he served as an enterprise reporter for the Des Moines Register. He has a bachelor's degree in English from South Dakota State University. X KNatgas Email kevin.dobbs@naturalgasintel.com June Natural Gas Bidweek Prices Climb on Shrinking Storage Surplus, Forecast for Hot Summer Bidweek Survey Natural Gas Prices June 03, 2024 Natural gas prices gained upside momentum in June bidweek trading as rising temperatures ignited cooling demand, pipeline maintenance eased and modest storage injections clashed with hints of increasing production. May Bidweek Natural Gas Prices Slide as Storage Containment Worries Outmuscle Incoming Heat Bidweek Survey Natural Gas Prices May 01, 2024 Natural gas prices slipped lower in May bidweek trading as the month's expected uptick in cooling demand was upstaged by hefty inventory levels and recent bumpy performances by Gulf Coast LNG terminals. April Natural Gas Bidweek Prices Trip Lower as Spring Season Deflates Demand Bidweek Survey Natural Gas Prices April 01, 2024 Natural gas prices were modestly lower in April bidweek trading as the transition from winter to spring signaled milder weather, weakening demand and an end-of-season natural gas supply swelling to the brim. March Bidweek Natural Gas Prices Drop as Weak Weather Overshadows Production Cuts Bidweek Survey Natural Gas Prices March 01, 2024 Natural gas prices retreated in March bidweek trading as signs of declining production were eclipsed by paltry weather-driven demand and lofty levels of supply in storage. March Bidweek Trading Starts on Downslope as Weather Seen Driving Wider Storage Surplus Bidweek Survey Natural Gas Prices February 26, 2024 Hamstrung by a growing surplus of natural gas in inventories and with a spring-like February running into a mild March, traders tugged natural gas prices lower for March baseload delivery, according to NGI's Bidweek Alert (BWA). February Natural Gas Bidweek Prices Mixed Amid Demand Downshift, Production Hits Bidweek Survey Natural Gas Prices February 01, 2024 Strengthening but still lower production intersected with spring-like weather during February bidweek trading. Natural gas prices varied by region as a result, with swaths of the country impacted by lower supply and posting gains, and others reporting declines amid waning heating demand.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}