{
    "Title": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMib2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbWV4aWNvLW5hdHVyYWwtZ2FzLXByb2R1Y3Rpb24tc2Vlcy11cHRpY2staW4tbWF5LWJ1dC1zdGlsbC1vZmYteWVhci1hZ28tbGV2ZWxzL9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:09:56 GMT",
    "Categories": [
        "Production Updates"
    ],
    "Content": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Mexico's natural gas production ticked upward to 3.85 Bcf/d in May from a three-year low of 3.76 Bcf/d in April, but was down 11% year/year, government data show. State oil company Petróleos Mexicanos (Pemex) produced 3.65 Bcf/d, or 95% of total gas output last month, with private sector operators accounting for the remainder, according to upstream regulator Comisión Nacional de Hidrocarburos (CNH). The top five gas producing fields, all operated by Pemex, were Quesqui (570 MMcf/d), Ixachi (507 MMcf/d), Akal (355 MMcf/d), Maloob (138 MMcf/d) and Onel (133 MMcf/d). Associated gas tied to oil production averaged 1.99 Bcf/d, versus 1.86 Bcf/d for non-associated gas. The International Energy Agency is forecasting a major decline in oil supply from Mexico between 2024 and 2030 due to underinvestment in exploration and production (E&P). President-elect Claudia Sheinbaum has signaled her intent to continue the energy policies of her predecessor Andres Manuel López Obrador, who has sought to solidify Pemex's dominant role in E&P. Sheinbaum on Thursday (June 27) named economist Luz Elena González Escobar to be the country's next energy secretary. González Escobar said she would pursue \"an energy policy that will continue to guarantee national sovereignty and will at the same time advance the energy transition.\" López Obrador and Sheinbaum also both officially oppose hydraulic fracturing (fracking) in Mexico, despite the country's substantial prospective resources of unconventional natural gas. In a June 20 speech, CNH Chairman Agustín Díaz Lastra - a López Obrador appointee - said that exploration work should continue so that unconventional prospective resources could be reclassified as reserves. This would allow unconventional projects to be developed more quickly if fracking is authorized, Díaz indicated. Upon taking office in 2018, López Obrador canceled bid rounds that would have made onshore unconventional gas blocks available for exploration. Meanwhile, gas imports from the United States have accounted for 6.37 Bcf/d, or 72% of Mexico's total gas supply this year through June 19, up 536 MMcf/d from the same period last year, Wood Mackenzie data show. The country's overall gas demand over the same span was down 120 MMcf/d to 8.52 Bcf/d, with only the power sector showing a year/year increase in consumption. Domestic production has accounted for 2.38 Bcf/d, or 27% of Mexican gas supply this year, according to the consultancy. Pemex has consumed 1.56 Bcf/d for its own operations, including enhanced oil recovery and refining. Pemex, for its part, reported a third straight sequential decline in dry gas production from its processing centers to 1.8 Bcf/d in May. Mexico natural gas prices closely track those of the United States due to Mexico's reliance on U.S. imports. Mexico's IPGN monthly natural gas price index averaged $1.922/MMBtu in May 2024, down from $3.159 in May 2023. After slumping below $2.00for much of 2024 so far, Lower 48 natural gas prices have strengthened some with summer underway. NGI's daily Henry Hub spot price averaged $2.390 on Friday. Related Tags Mexico Exploration And Production natural gas Andrew Baker Andrew joined NGI in 2018 to support coverage of Mexico's newly liberalized oil and gas sector, and his role has since expanded to include the rest of North America. Before joining NGI, Andrew covered Latin America's hydrocarbon and electric power industries from 2014 to 2018 for Business News Americas in Santiago, Chile. He speaks fluent Spanish, and holds a B.A. in journalism and mass communications from the University of Minnesota. X AbakerNGI Email andrew.baker@naturalgasintel.com Macquarie Joining Engie to Expand Natural Gas Supplies for Mexico's Power-Hungry Yucatán Mexico Gas Price Index Mexico July 15, 2024 Macquarie Asset Management is joining Engie SA in a project to double the transport capacity on the existing 250 MMcf/d Energía Mayakan natural gas pipeline serving Mexico's Yucatán Peninsula, the companies said. Storm Season Hitting Demand in Texas, Mexico as Natural Gas Prices Slump - Spotlight Mexico Gas Price Index Mexico Natural Gas Prices July 11, 2024 The Atlantic storm season has come on strong early this year and with great force, leading to reduced demand for natural gas on both sides of the U.S.-Mexico border. Morena Landslide Could Allow Major Energy Reforms Before Mexico's AMLO Leaves Office Mexico Gas Price Index Mexico July 10, 2024 Mexico's outgoing president Andres Manuel López Obrador could still push through a regulatory overhaul of the energy sector before his successor Claudia Sheinbaum is sworn in this October, according to the Baker Institute for Public Policy's David Gantz. Eni Notches Another Mexico Upstream Discovery as Natural Gas Prices Forecast to Rise Mexico Gas Price Index E&P Natural Gas Prices July 09, 2024 Italy's Eni SpA, one of Mexico's leading private sector producers, has found more oil and associated natural gas in shallow waters offshore Mexico. Billionaire Slim's Grupo Carso to Develop Lakach Deepwater Natural Gas Field with Pemex Mexico Gas Price Index E&P Mexico July 08, 2024 Mexico's Grupo Carso, SAB de CV, a conglomerate owned by billionaire Carlos Slim, signed a services contract with state oil company Petróleos Mexicanos (Pemex) to help develop the Lakach deepwater natural gas field off Mexico's southeastern coast. Mexico Importing Record Levels of U.S. Natural Gas, but Resolving Trade Disputes Said Crucial Mexico Gas Price Index Mexico Regulatory July 03, 2024 Mexico is importing around 7 Bcf/d of natural gas from the United States this summer, but unresolved issues related to a trade treaty binding the two economies could complicate this relationship.",
    "Relevancy Score": "",
    "Relevancy reasoning": ""
}