{
    "title": "Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling ",
    "source": " Surfrider Foundation",
    "Content": "Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling Skip to content (press enter) 07.02.24 Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling By Katie Day Each year, Congress must draft and agree upon a budget to fund the federal government. The intent of these appropriation bills is to provide funding that federal agencies need to accomplish their mandates and fund important programs. However, the first round of the Fiscal Year (FY) 2025 budget bills to pass out of House Committees last week are riddled with extensive budget cuts to ocean and coastal management programs that the public rely on for clean water and healthy beaches. The bills also include harmful policy provisions, known as \"policy riders\", that have no business being in a budget bill! Some of the most concerning policy riders in the House Fiscal Year 2025 budget bills include mandates for new oil and gas leasing, prohibitions on the establishment of important protected areas for wildlife and natural ecosystems , and limitations that hinder federal agency ability to regulate polluters ; putting water quality, air quality, and the climate at risk. For decades, Surfrider has fought to protect annual funding levels for important ocean and coastal programs. These include programs to support ocean research, protect ocean and coastal habitats, help communities prepare for coastal hazards, test water quality to keep people safe at the beach, and more. Two of the key federal agencies that administer these programs are the Environmental Protection Agency (EPA) and National Oceanic and Atmospheric Administration (NOAA), yet the House budget bills call for a 20 percent funding cut to the EPA , and a 12 percent funding cut to NOAA . While this is a very concerning way to start off the 2025 appropriations process, all is not lost. Your voice can make a difference! Click here to contact your federal representatives and urge them to oppose these funding cuts and dangerous policy riders in order to protect communities, wildlife, the environment, and our ocean and coasts! FY 2025 House Appropriation Bills: The Bad Coastal water quality at risk to more sewage spills. Funding levels for each program administered by the EPA have yet to be released, but a reduction in topline funding of 20 percent (not accounting for inflation!) does not bode well for EPA programs that are critical for protecting water quality, coastlines, and beachgoers in light of increasing climate change impacts. For instance, the Interior, Environment and Related Agencies Appropriations bill allocates just $1.2 billion to the Clean Water State Revolving Fund, roughly one third of the authorized level. Accounting for the hefty earmarks to specific projects, that's just $649 million to the actual fund, which is a critical EPA program that states rely on to fund wastewater infrastructure upgrades in order to prevent sewage spills. Ocean ecosystems, community resilience, and coastal hazard preparedness threatened. The Commerce, Justice, Science and Related Agencies Appropriations bill cuts funding to NOAA by 12 percent. While we don't have all the details of funding levels for each NOAA-administered program just yet, a notable topline funding cut means important programs like Coastal Zone Management, Sea Grant, Marine Sanctuaries and Protected Areas, and more could be at risk. These programs are designed to fund ocean and coastal research that keep communities safe, enhance coastal resilience, and help prepare against severe weather events. Marine wildlife and coastal communities exposed to dangerous offshore oil and gas drilling. Offshore oil and gas drilling exacerbates climate change by producing fossil fuels, pollutes coastal waters with heavy metals and chemicals, and ultimately results in heart-wrenching oil spills that harm marine wildlife and coastal communities. The Interior, Environment and Related Agencies Appropriations bill includes requirements for new oil and gas lease sales and limits much needed protections for marine mammals from harm caused by offshore energy leasing. Protections limited for at risk wildlife and ecosystems. The Interior, Environment and Related Agencies Appropriations bill stops the Biden Administration's effort to protect 30 percent of our nation's lands and waters by 2030, known as the 30x30 Initiative, and weakens the Endangered Species Act. The nation's ability to regulate polluters and respond to the climate crisis hindered. The Interior, Environment and Related Agencies Appropriations bill blocks the EPA from enforcing the recently established methane fee on fossil fuel producers and prevents federal agencies from accounting for climate change impacts by blocking the use of the Social Cost of Carbon in cost benefit analyses. The bill also removes the ability of the National Environmental Protection Act to require the consideration of climate change efforts in permitting. Finally, the bill minimizes the ability of agencies to oversee and limit pollution from chemical and pesticide manufacturers. National environmental justice initiatives blocked. The Interior, Environment and Related Agencies Appropriations bill defunds important environmental justice programs, including the American Climate Corps, Climate Justice Alliance, and eco grief counseling. The bill also prohibits the Biden Administration's executive orders on diversity, equity, and inclusion from being implemented. FY 2025 House Appropriation Bills: The Hopeful Funding to address to the Tijuana River Valley water quality and environmental justice crisis. The State, Foreign Operations, and Related Programs Appropriations bill includes record funding for the International Boundary and Water Commission, which will support essential maintenance and infrastructure upgrades at the International Wastewater Treatment plant at the US/Mexico border. This is a priority campaign for the Surfrider Foundation and our San Diego Chapter. Full funding to the Land and Water Conservation Fund . While permanent, full funding to the Land and Water Conservation Fund is required thanks to the Great Americans Outdoors Act (a bill Surfrider helped pass in 2020!), last year millions of dollars were \"rescinded\" from the program during the appropriations process. We're grateful to see House Committee members include full funding to this important program. There are still many steps to go before becoming final! These bills have only passed their various House Committees. Each of these appropriation bills will also need to be voted on by the full House of Representatives and confer with the Senate before the budget is finalized. The Senate versions are still in development but are expected to be more protective of funding levels and not include these harmful policy riders. The fight isn't over. Surfrider will continue to fight back to get funding levels restored for critical ocean and coastal programs in the Fiscal Year 2025 budget. Surfrider will also work diligently to prevent these harmful policy riders from becoming law. Surfrider will continue to advocate for federal protections, funding and support for our ocean and coasts. From hosting fly-ins to Washington, D.C . to arranging in district field visits so Congressmembers and their staff can see the issues first hand, to submitting testimony to Congressional Committees throughout the year; Surfrider will not stop until these funding levels are restored and dangerous policies are avoided. Not a Surfrider member? Become one today and join the movement!"
}