{
    "title": "Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly ... ",
    "source": " StockTitan",
    "Content": "Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property | SITKF Stock News Login Please enter your login and password Wrong username or password. Email address Password Forgot password? LOGIN Close Don't have an account? Sign Up! Forgot Password Please enter your email address An email has been sent to your address with instructions for changing your password. There is no user registered with this email. Email address RECOVER Close Sign Up To create a free account, please fill out the form below. Thank you for signing up! A confirmation email has been sent to your email address. Please check your email and follow the instructions in the message to complete the registration process. If you do not receive the email, please check your spam folder or contact us for assistance. Welcome to our platform! Oops! Something went wrong while trying to create your new account. Please try again and if the problem persist, Email Us to receive support. Username Email address Password I accept the user agreement Sign me up for the newsletter CREATE ACCOUNT Close Already have an account? Login Home News SITKF Trending News PLTR Palantir Announces Date of Second Quarter 2024 Earnings Release a... RUM Rumble Announces Multiple Exclusive Brands FOA Finance of America Announces Expected Effective Date of July 25, ... SYM Symbotic Announces Date for Reporting Third Quarter Fiscal 2024 F... ETON Eton Pharmaceuticals Announces FDA Acceptance of New Drug Applica... OPTT Ocean Power Technologies Awarded Contract for Delivery of AI Capa... PLTR Palantir Announces Date of Second Quarter 2024 Earnings Release a... RUM Rumble Announces Multiple Exclusive Brands FOA Finance of America Announces Expected Effective Date of July 25, ... SYM Symbotic Announces Date for Reporting Third Quarter Fiscal 2024 F... ETON Eton Pharmaceuticals Announces FDA Acceptance of New Drug Applica... OPTT Ocean Power Technologies Awarded Contract for Delivery of AI Capa... Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property Rhea-AI Impact (Neutral) Rhea-AI Sentiment (Negative) Tags acquisition Rhea-AI Summary Sitka Gold has initiated its 2024 exploration at the newly acquired Clear Creek property in Yukon, incorporating diamond drilling and additional geochemical surveys, geological mapping, and data integration. The first diamond drilling in Rhosgobel Intrusion since 1995 aims to extend findings from historical drilling. Soil sampling and geological mapping are underway to explore high-potential zones south of the Blackjack deposit and the newly acquired Clear Creek claims. Previous exploration data indicates multiple gold targets with promising results, setting the stage for potentially significant discoveries. Positive Initiation of the 2024 exploration program at Clear Creek, including diamond drilling. First diamond drilling at Rhosgobel Intrusion since 1995 aims to extend historical gold findings. Integration of extensive historical datasets to accelerate new gold discoveries. Geochemical surveys and geological mapping to explore high-potential zones for gold deposits. Positive historical drilling results with significant gold intersections at multiple targets. Negative None of the historically reported assay results from Clear Creek have been verified by Sitka. 07/03/2024 - 08:30 AM 2024 exploration has begun on the newly acquired Clear Creek property First diamond drilling program ever to be completed on the Rhosgobel Intrusion since historical shallow reverse circulation drilling in 1995 to follow up on holes 95-15 which intersected 50.3 m of 1.07 g/t gold and 95-16 which intersected 67.1 m of 1.03 g/t gold with both holes ending in strong gold mineralization. Grid geochemistry currently underway to infill gaps to the south of the Blackjack deposit on the high potential Pukelman West intrusion and G2 zone on the newly acquired Clear Creek claims. Integration of newly acquired datasets (geological, geophysical, geochemical) with Sitka Gold data. Geological mapping and prospecting following up on the high grade G2 zone, Contact zone and other highly prospective gold targets. VANCOUVER, BC / ACCESSWIRE / July 3, 2024 / Sitka Gold Corp. (\"Sitka\" or the \"Company\") (TSXV:SIG)(FSE:1RF)(OTCQB:SITKF) is pleased to announce that it has expanded the planned 2024 exploration program at its contiguous, 431 square kilometre RC Gold Project (\"RC Gold\" or the \"Project\") in Yukon to include diamond drilling and additional soil geochemistry surveys, geological mapping, prospecting and data integration and analysis on its newly acquired Clear Creek property (\"Clear Creek\") claims that complete the consolidation of the Clear Creek Intrusive Complex (see Figure 1). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program for 2024. \"The accumulation of data from several years of systematic exploration by previous operators on the newly acquired Clear Creek Property has generated several high-quality exploration targets,\" said Cor Coe, Director and CEO of Sitka Gold. \"The newly acquired claims cover at least three intrusion related gold targets that are geologically similar to our developing Blackjack gold deposit and the team is very excited to begin assessing the property by testing the Rhosgobel intrusion, where historical work strongly indicates the potential for the presence of a multi-million ounce gold deposit. Sitka's initial discovery of the Blackjack and Eiger gold deposits came about through a similar process of review and compilation of a large historical database and we see the ability to accelerate the discovery of additional gold deposits by utilizing our growing knowledge of the intrusion-related gold systems in this area in conjunction with the comprehensive Clear Creek data-set as we continue our exploration activities across this emerging mining district.\" The newly consolidated Project includes four high-priority areas that have had previous reverse circulation and/or diamond drilling that require additional drilling. These areas are the Rhosgobel intrusion where historical drilling intersected up to 1.03 g/t gold over 67.1 m , the Contact zone with drill results up to 20.3 g/t gold over 10.7 m , the Bear Paw Breccia which intersected up to 1.87 g/t gold over 42.6 m and the Pukelman intrusion with results of 1.20 g/t gold over 10.0 m (see Figure 2, Table 1). The first target area to be tested is the Rhosgobel Intrusion where shallow historical drilling in 1995 by Kennecott outlined a large area of intrusion related gold mineralization (see Figure 3). Previous drilling at Rhosgobel was limited to a vertical depth of approximately 60 metres. The gold mineralization observed at Rhosgobel is sheeted quartz veins hosted in a megacrystic quartz monzonite similar to the Blackjack deposit located 5 km to the north along the recently discovered Blackjack Mineralized Corridor. The first drill hole will be a step out to drill underneath the mineralized zone intersected in Holes 15 and 16 in shallow reverse circulation drilling (see Figure 4). This will be the first diamond drill hole ever drilled in the Rhosgobel intrusion. Geological interpretation of a steeply dipping mineralized zone is consistent with controls on mineralization observed elsewhere on the property.The Company has recently engaged GroundTruth Exploration to conduct grid based soil sampling in an area south of the Blackjack deposit where prospecting in 2015 identified a highly prospective area. The G2 zone was prospected in 2015 and 13 surface float samples were collected with a range of trace to 43.4 g/t gold (see Figure 5) within mineralized intrusive and metasedimentary rocks. Three other samples returned values of 5.9, 7.2 and 13.6 g/t gold . This area is located approximately 2 km south of the Blackjack gold deposit area, within the Blackjack Mineralized Corridor in proximity to the West Pukelman intrusion. Previous reconnaissance scale soil sampling encountered anomalous gold in soil in the area. The G2 zone is located approximately 1 km west of the Pukelman West intrusion within an extensional corridor containing both the Pukelman and Pukelman West intrusions and several previously reported lamprophyre dykes. The Pukelman West intrusion is located approximately 1.5 km south of the Blackjack deposit where recent drilling has intersected higher-grade mineralization associated with the N-S trending Blackjack fault. The intersection of these structural zones is interpreted by Sitka to be highly prospective for the discovery of additional gold mineralization.Prospecting in 2015 also focused on the Contact zone located at the southern margin of the Pukelman intrusion. Nineteen samples were collected ranging from trace to 166.2 g/t gold . Seven additional samples of mainly quartz vein material taken from float and outcrop assayed above 1.0 g/t gold including 86.0, 31.8, 47.2, 27.4, 18.1, 2.8, and 1.5 g/t gold (see Figure 5). The sampling indicates that the extent of the Contact zone could be much larger than the area previously drilled. Additional mapping and prospecting is planned to refine drill targets in anticipation of drilling this area.Geological mapping and prospecting in the G2 to Pukelman West corridor and along the Blackjack fault mineralized corridor from the Blackjack deposit south through the Pukelman West and Rhosgobel intrusion for additional areas of undiscovered gold mineralization will also be conducted with the goal of identifying additional drill targets.Recently acquired data encompassing the southern portion of the Clear Creek Intrusive Complex is being integrated within the Sitka database and plans for drilling additional known areas of mineralization are being developed. Figure 1 - The acquisition of the Clear Creek property now completes Sitka Gold's 100% ownership of the Clear Creek Intrusive Complex and adds several underexplored areas that have strong potential for new gold discoveries in addition to four high-quality drill targets. Figure 2 - The purchase of the Clear Creek Property (outlined in yellow boundary) now completes Sitka Gold's ownership of 100% of the Clear Creek Intrusive Complex, an area of approximately 8 km x 15 km that includes several known surface intrusions with associated gold mineralization. The newly acquired property contains four highly prospective areas with limited historical drilling and several areas that have produced high-grade surface samples but remain under-explored and undrilled. Figure 3 - Shallow reverse circulation drilling in the Rhosgobel intrusion in 1995 produced numerous intersections of gold mineralization consisting of sheeted quartz veins with megacrystic quartz monzonite. Holes 15 and 16 were drilled in opposite directions at 60 degrees dip intersected mineralization over their entire lengths. The holes intersected 50.3 m grading 1.07 g/t gold and 67.1m of 1.03 g/t gold respectively with both holes ending in mineralization. Figure 4 - Cross-section of previous drilling at Rhosgobel along holes 15 and 16 which ended in mineralization. The first ever diamond drill hole proposed in the Rhosgobel intrusion (PROS-24-A) will step back and drill underneath holes 15 and 16 to test the width of the mineralized zone intersected in 1995. Figure 5 - Prospecting in 2015 was conducted in the G2 zone and the Contact Zone and produced many high-grade results. Additional grid soil sampling (shown in Figure 2) will be conducted in these areas and south where previous soil sampling has been conducted at only wide spacings. Current drilling is expanding the Blackjack deposit to the south towards this highly prospective area. Table 1: Significant drill hole results from the Clear Creek Property *Intervals are drilled core length, as insufficient drilling has been completed at this time to determine true widths Table References Robinson, S.D. and R. A. Doherty, 1988. Geological, Geochemical, Geophysical and Diamond Drilling 1988 Summary Report on the Rum, Rye and Roll Claims ((assessment report 092748) Feulgen, S. and J.C. Stephen, 1989, Initial Diamond Drilling Report on the Rain, Wind, Sleet Claims, Left Clear Creek, Yukon (assessment report 092752) Bidwell, G., 1993. Clear Creek Project, 1992 Reverse Circulation Drill Program (assessment report 093097) Coombes, S., 1995. 1995 Assessment Report on the Clear Creek Option; prepared by Kennecott Canada Inc. (assessment report 093372). Stammers, M.A., 2000. 1999 Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 094058) Weeks, S. and R. Falls, 2001, 2000 Geological, Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 94165) O'Brien, 2010;Assessment Report, 2010 Diamond Drilling Program, Clear Creek Property (Assessment report 095539) Shutty, 2011; Assessment Report, 2011 Exploration Program, Clear Creek Property (Assessment Report 095984) The Company cautions that none of the historically reported assay results from the newly acquired Clear Creek property have been verified by Sitka. About the Flagship RC Gold Project The RC Gold Project consists of a 431 square kilometre contiguous district-scale land package located in the heart of Yukon's Tombstone Gold Belt. The project is located approximately 100 kilometres east of Dawson City, which has a 5,000 foot paved runway, and is accessed via a secondary gravel road from the Klondike Highway which is usable year-round and is an approximate 2 hour drive from Dawson City. It is the largest consolidated land package strategically positioned mid-way between Victoria Gold's Eagle Gold Mine - Yukon's newest gold mine which reached commercial production in the summer of 2020 - and Victoria Gold's former producing Brewery Creek Gold Mine.On January 19, 2023 Sitka Gold announced an Initial Mineral Resource Estimate prepared in accordance with National Instrument 43-101 (\"NI 43-101\") guidelines for the RC Gold Property of 1,340,000 ounces of gold (1) . The road accessible, pit constrained Mineral Resource is classified as inferred and is contained in two zones: The Blackjack and Eiger deposits. Both of these deposits are at/near surface, are potentially open pit minable and amenable to heap leaching, with initial bottle roll tests indicating that the gold is not refractory and has high gold recoveries of up to 94% with minimal NaCN consumption (see News Release July 13, 2022). The Mineral Resource estimate is presented in the following table at a base case cut-off grade of 0.25 g/t Au: RC Gold Inferred Mineral Resource Estimate COG g/t Au Blackjack Zone Eiger Zone Combined Tonnes 000's Au g/t 0z Au 000's Tonnes 000's Au g/t 0z Au 000's Tonnes 000's Au g/t 0z Au 000's 0.2035,7980.80921 32,5230.45471 68,3210.631,391 0.25 33,743 0.83 900 27,362 0.50 440 61,105 0.68 1,340 0.3031,2820.88885 22,2530.55393 53,5350.741,2790.3529,0650.92860 17,8170.60344 46,8820.801,2030.4026,9750.96833 14,5060.66308 41,4810.861,140Notes Mineral resource estimate prepared by Ronald G. Simpson of GeoSim Services Inc. with an effective date of January 19, 2023. Mineral Resources are classified using the 2014 CIM Definition Standards. The cut-off grade of 0.25 g/t Au is believed to provide a reasonable margin over operating and sustaining costs for open-pit mining and processing Mineral resources are constrained by an optimised pit shell using the following assumptions: US $1800/oz Au price; a 45 degrees pit slope; assumed metallurgical recovery of 85%; mining costs of US$2.00 per tonne; processing costs of US$8.00 per tonne; G&A of US$1.50/t. Mineral resources are not mineral reserves and do not have demonstrated economic viability. Totals may not sum due to rounding. To date, 56 diamond drill holes have been drilled into this system for a total of approximately 19,962 metres including 16 drill holes totalling 6,515 metres completed in 2023 focused on expanding the initial resource. The drilling in 2023 produced results of up to 219.0 m of 1.34 g/t gold including 124.8 m of 2.01 g/t gold and 55.0 m of 3.11 g/t gold in drill hole DDRCCC-23-047 at Blackjack (see news release dated September 26, 2023). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program. Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory RC Gold Deposit Model Exploration on the Property has mainly focused on identifying an intrusion-related gold system (\"IRGS\"). The property is within the Tombstone Gold Belt which is the prominent host to IRGS deposits within the Tintina Gold Province in Yukon and Alaska. Notable deposits from the belt include: Fort Knox Mine in Alaska with current Proven and Probable Reserves of 230 million tonnes at 0.3 g/t Au (2.471 million ounces; Sims 2018) (1) ; Eagle Gold Mine with current Measured and Indicated Resources of 233 million tonnes at a grade of 0.57 g/t Au at the Eagle Main Zone (4.303 million ounces; Harvey et al, 2022) (2) ; the Brewery Creek deposit with current Indicated Mineral Resource of 22.2 million tonnes at a gold grade of 1.11 g/t (0.789 million ounces; Hulse et al. 2020) (3) ; the Florin Gold deposit, located adjacent to Sitka's RC Gold project, with a current Inferred Mineral Resource of 170.99 million tonnes grading 0.45 g/t (2.47 million ounces; Simpson 2021) (4) and the AurMac Project with an Inferred Mineral Resource of 347.49 million tonnes grading 0.63 gram per tonne gold (7.00 million ounces) (5) . Sims J. Fort Knox Mine Fairbanks North Star Borough, Alaska, USA National Instrument 43-101 Technical Report. June 11, 2018. https://s2.q4cdn.com/496390694/files/doc_downloads/2018/Fort-Knox-June-2018-Technical-Report.pdf Harvey N., Gray P., Winterton J., Jutras M., Levy M.,Technical Report for the Eagle Gold Mine, Yukon Territory, Canada. Victoria Gold Corp. December 31, 2022. https://vgcx.com/site/assets/files/6534/vgcx_-_2023_eagle_mine_technical_report_final.pdf Hulse D, Emanuel C, Cook C. NI 43-101 Technical Report on Mineral Resources. Gustavson Associates. May 31, 2020. https://minedocs.com/22/Brewery-Creek-PEA-01182022.pdf Simpson R. Florin Gold Project NI 43-101 Technical Report. Geosim Services Inc. April 21, 2021. https://sedar.com/GetFile.do?lang=EN&docClass=24&issuerNo=00005795&issuerType=03&projectNo=03236138&docI d=4984158 Banyan Gold News Release Dated February 7, 2023 (Technical Report to be filed within 45 days of news release) https://banyangold.com/news-releases/2024/banyan-announces-7-million-ounce-gold-updated-mineral-resource-estimate-aurmac-project-yukon-canada/ Upcoming Events Sitka Gold will be attending and/or presenting at the following events*: Takestock Investor Forum, Stampede Event, Calgary, Alberta: July 3, 2024 Kelowna Capital Events, Kelowna, BC: July 19 - 21, 2024 Precious Metals Summit, Beaver Creek, Colorado: September 10 - 13, 2024 Yukon Geoscience, Whitehorse, Yukon: November 17 - 20, 2024 *All events are subject to change. About Sitka Gold Corp. Sitka Gold Corp. is a well-funded mineral exploration company headquartered in Canada. The Company is managed by a team of experienced industry professionals and is focused on exploring for economically viable mineral deposits with its primary emphasis on gold, silver and copper mineral properties of merit. Sitka is currently exploring its 100% owned, 431 square kilometre flagship RC Gold Project within the Tombstone Gold Belt in the Yukon Territory with a 15,000 metre diamond drill program planned for 2024. The Company is also advancing the Alpha Gold Project in Nevada and currently has drill permits for its Burro Creek Gold and Silver Project in Arizona and the Coppermine River Project in Nunavut.The Company recently announced an NI 43-101 compliant initial inferred Mineral Resource Estimate of 1,340,000 ounces of gold (1) beginning at surface and grading 0.68 g/t at its RC Gold Project in Yukon (see news release dated January 19, 2023). Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory *For more detailed information on the underlying properties please visit our website at www.sitkagoldcorp.comThe scientific and technical content of this news release has been reviewed and approved by Cor Coe, P.Geo., Director and CEO of the Company, and a Qualified Person (QP) as defined by National Instrument 43-101.ON BEHALF OF THE BOARD OF DIRECTORS OFSITKA GOLD CORP. \" Donald Penner \" President and DirectorFor more information contact: Donald Penner President & Director778-212-1950dpenner@sitkagoldcorp.comor Cor Coe CEO & Director604-817-4753ccoe@sitkagoldcorp.comNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary and Forward-Looking Statements This release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". This information and these statements, referred to herein as \"forward-looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, the use of the proceeds raised under the Offering and the Company's anticipated work programs. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will complete its anticipated work programs and use the proceeds of the Offering as currently anticipated. These forward-looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, market uncertainty, the results of the Company's anticipated work programs and that the Company will not use the proceeds of the Offering as currently anticipated. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor. SOURCE: Sitka Gold CorpView the original press release on accesswire.com FAQ What is Sitka Gold's 2024 exploration program at Clear Creek? Sitka Gold's 2024 exploration program at Clear Creek includes diamond drilling, additional geochemical surveys, geological mapping, and data integration to explore high-potential gold zones. What are the historical drilling results at Rhosgobel Intrusion? Historical drilling at Rhosgobel Intrusion in 1995 intersected 50.3 m of 1.07 g/t gold and 67.1 m of 1.03 g/t gold, with both holes ending in strong gold mineralization. What is the significance of the newly acquired Clear Creek property? The newly acquired Clear Creek property consolidates Sitka Gold's ownership, adds multiple high-potential gold targets, and integrates historical data to accelerate new discoveries. What are the key targets in Sitka Gold's 2024 drilling program? Key targets include the Rhosgobel Intrusion, the Contact zone, the Bear Paw Breccia, and the Pukelman intrusion, all showing promising historical drilling results. What are the expected outcomes of Sitka Gold's exploration at Clear Creek? Sitka Gold aims to identify and expand gold deposits by leveraging historical data and conducting comprehensive exploration activities, potentially leading to significant new gold discoveries. Sitka Gold Corp. OTC:SITKF SITKF Rankings N/A Ranked by Market Cap N/A Ranked by Dividends SITKF Latest News Jul 15, 2024 Sitka Intercepts Strong Mineralization Including Visible Gold at Its RC Gold Project, Yukon Jun 24, 2024 Sitka Announces Expansion of RC Gold Project with Acquisition of Victoria Gold's Clear Creek Property, Yukon Jun 13, 2024 Sitka Resumes Drilling at Its RC Gold Project, Yukon May 23, 2024 Sitka Gold Drills 154.0 Metres of 1.47 g/t Gold Including 37.0 Metres of 3.07 g/t Gold and 8.0 Metres of 4.61 g/t Gold at its RC Gold Project, Yukon May 1, 2024 Sitka Gold Drills 191.0 Metres of 1.16 g/t Gold Including 89.0 Metres of 2.03 g/t Gold and 11.0 Metres of 5.80 g/t Gold at its RC Gold Project, Yukon SITKF Stock Data Market Cap 29.76M Float 214.51M Insiders Ownership 13.48% Institutions Ownership 4.98% Industry Gold Ore Mining Sector Mining, Quarrying, and Oil and Gas Extraction Website Link Country United States of America City Vancouver"
}