"Offshore drilling surge creates turnaround for Australian exploration About CONTACT US Sign In Log out Newsletter signup HOME OIL & GAS Operations Exploration Policy ENERGY TRANSITION MARKETS OPINION GLOBAL RESEARCH PARTNER CONTENT x Search CLOSE Sign In Log out ✖ HOME OIL & GAS Operations Exploration Policy ENERGY TRANSITION MARKETS OPINION GLOBAL RESEARCH LATEST HEADLINES News Analysis Events Tags Partner Content ABOUT About ENB Newsletter signup Frequently Asked Questions SOLUTIONS Advertise LEGAL Terms and Conditions Privacy Policy Cookie Policy SOCIAL LINKEDIN X YOUTUBE FACEBOOK EXPLORATION Offshore drilling surge creates turnaround for Australian exploration Petroleum exploration expenditure hits $337 million in March quarter Colin Sandell-Hay Australian offshore petroleum drilling has increased. 02 July 2024 After a number of years in the doldrums, Australia's petroleum exploration sector achieved a welcome turnaround in the March quarter, with expenditure hitting $337 million. Up from $254 million in 2023,... Start a free trial to continue reading this article Already have an account? Sign in here Navigate the Future of Energy with Premier Intelligence Energy News Bulletin (ENB) is the Asia Pacific region's most comprehensive source of daily energy news, providing unparalleled insight into the Energy sector through expert commentary and researched features. RELATED ARTICLES New Greenpeace boat permanently in APAC region to lead the charge Slugcatcher: Yes, no, maybe. Predicted NZ gas shortages \"very concerning\" New research projects southeast Asia offshore gas set to boom MORE ON THIS TOPIC NEXT: First Kumul O&G exploration to start in PNG PREVIOUS: Tamboran's NYSE IPO fails to impress Get the Energy News Bulletin Newsletter delivered free each day MOST POPULAR 1 EXPLORATION Top End uncovers significant gas potential South Nicholson Basin 2 OPERATIONS New Greenpeace boat permanently in APAC region to lead the charge 3 OPINION Slugcatcher: Yes, no, maybe. 4 ENERGY TRANSITION Snowy Hydro secures vital 25-year gas storage deal RESEARCH Premium subscribers only View more A growing series of reports, each focused on a key discussion point for the energy sector, brought to you by the Energy News Bulletin Intelligence team. A growing series of reports, each focused on a key discussion point for the energy sector, brought to you by the Energy News Bulletin Intelligence team. ENB CCS Report 2024 ENB's CCS Report 2024 finds that CCS could be the much-needed magic bullet for Australia's decarbonisation drive ENB Cost Report 2023 ENB's latest Cost Report findings provide optimism as investments in oil and gas, as well as new energy rise. ENB Future of Energy Report 2023 ENB's inaugural Future of Energy Report details the industry outlook on the medium-to-long-term future for the sector in the Asia Pacific region. ENB Cost Report 2021 This industry-wide report aims to understand current cost levels across the energy industry LINKEDIN X YOUTUBE FACEBOOK Content Oil & Gas Energy Transition Markets Opinion Global Research Events News Analysis Tags Partner Content About About ENB Newsletter Signup Frequently Asked Questions Solutions Advertise Legal Terms And Conditions Privacy Policy Cookie Policy THE ASPERMONT BRAND PORTFOLIO Login Invalid username or password Log in Username Password Remember me Lost password?"