{
    "title": "ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field ",
    "source": " WorldOil",
    "Content": "ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field Advertise | | Contact WO Menu Topics Onshore Exploration Drilling Completion Production Shale Hydraulic Fracturing Conventional Digital Transformation Automation & Control Data Storage Artificial Intelligence Offshore Exploration Drilling Production Deepwater Subsea Decommissioning Energy Transition LNG Sustainability Offshore Wind Hydrogen Carbon Capture Industry & Analysis Economics/statistics Regulatory ESG/Investment Regions North America South America Europe Eastern Mediterranean Russia & FSU Africa Middle East Far East South Asia South Pacific Arctic East Asia Australasia Magazine Current Issue Archive Free Trial Subscription Full Access Subscription Renew Subscription Supplements Forecast Reprints & Back Issues News Latest News Company News Newsletter Sign-Up Resources Webcasts Whitepapers eBooks Podcasts Videos Upstream365 Event Presentations Maps Store Events World Oil Events Gulf Energy Information Excellence Awards Women's Global Leadership Conference World Oil Forecast Breakfast Project Data Global Energy Infrastructure Login Offshore Drilling Middle East UAE ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field July 03, 2024 (WO) - ADNOC Drilling Company PJSC has won $733 million in total contracts, by ADNOC Offshore, for three island drilling rigs to support growing operations at the offshore Zakum oil field. The three new island rigs will operate on existing and newly constructed innovative artificial islands at the offshore Zakum field for drilling and completion of wells. The rigs, which will be constructed by Honghua Group (HH), will incorporate industry leading technology and automation. Delivery of the rigs and commencement of operations is expected during 2026. The rigs will be designed and built as part of a partnership between ADNOC Drilling and HH. This partnership has been specifically formed to harness the transformative nature of AI, digitization, and advanced technology in the design and operation of these next generation drilling rigs. ADNOC Drilling and HH will look to also collaborate with AIQ, an Abu Dhabi based artificial intelligence (AI) pioneer contributing to the energy sector globally. The design of the rig operating systems will look to utilize real-time condition, performance and utilization data to create actionable insights, enhancing rig performance and increasing efficiency, leading to improvements in safety and well delivery times. Additionally, drilling operations on ADNOC's innovative artificial islands create the ideal conditions for extended reach drilling (ERD) with the top five longest wells in the world being delivered from these islands off the coast of Abu Dhabi, the most recently delivered being over 52,000 feet. The rigs will be built to deliver ERD as well as having the state-of-the-art capability of walking between wells eliminating the need for the rigs to be dismantled to be moved. These capabilities dramatically improve efficiency and safety while vastly reducing costs and emissions. The ADNOC Drilling fleet is now expected to total at least 148 by 2026, including these three new rigs, as well as the previously announced three land rigs for the initial phase of unconventional development. Abdulrahman Abdulla Al Seiari, Chief Executive Officer of ADNOC Drilling, said, \"ADNOC Drilling is honored to receive this substantial award, which marks a significant milestone in our company's accelerated growth journey. These new island rigs will be the most advanced in the world, embracing artificial intelligence, the most transformative technology of our generation. \"Our partnership with HH will amplify the creativity and ingenuity of our industry as we design and build these rigs of the future that drive efficiency and safety and deliver exceptional value for our customer ADNOC Offshore.\" Commenting on the award, Tayba Abdul Rahim Al Hashemi, Chief Executive Officer of ADNOC Offshore, said: \"ADNOC Drilling's technical expertise and enhanced capabilities are key enablers as we safely and sustainably accelerate to meet the world's growing energy demands. This award will strengthen our partnership in the future as we work together to harness AI and innovation to maximise energy, minimize emissions and unlock significant value for stakeholders.\" (c)2024 World Oil, (c) 2024 Gulf Publishing Company LLC.market data is provided by Barchart Solutions. Futures: at least 10 minute delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. To see all exchange delays and terms of use, please see disclaimer. All material subject to strictly enforced copyright laws Please read our Terms & Conditions, Cookies Policy and Privacy Policy before using the site. Connect with World Oil Connect with World Oil , the upstream industry's most trusted source of forecast data, industry trends, and insights into operational and technological advances. Newsletter Sign Up"
}