{
    "title": "Exploration Co. Announces MRE & 2024 Drilling Program ",
    "source": " Streetwise Reports",
    "Content": "          Exploration Co. Announces MRE & 2024 Drilling Program                                             Streetwise Reports   The Gold Report   The Energy Report   The Life Sciences Report   Research Reports       Streetwise Reports The Gold Report The Energy Report The Life Sciences Report Research Reports                  Don't Forget ToRate This Article      Get the Latest Investment Ideas Delivered Straight to Your Inbox.   URL       TICKERS: MMG; MMNGF  Exploration Co. Announces MRE and 2024 Drilling Program Research Report    View Important Disclosures for this Article    Close  Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.        GoldSilverBase MetalsCritical Metals    Source: Couloir Capital (7/3/24)   Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) recently announced its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program, according to a Couloir Capital report.    Couloir Capital, in a research report published on June 29, 2024, provided an update on Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) following the company's announcement of its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program. Metallic Minerals announced its first NI 43-101 MRE at the Keno Silver project, comprising four separate deposits (Formo, Fox, Caribou, and Homestake). \"The resource comprises an inferred resource of 2.5 Mt at 223 [grams per tonne silver equivalent] g/t AgEq, equating to 18.16 Moz of contained AgEq,\" Couloir Capital noted. \"These deposits remain open to lateral and depth expansion. We expect further drilling to add more resources, which should lead to an increase in the valuation.\" The analysts highlighted the company's 2024 drilling program, which has been initiated at both the La Plata and Keno Silver projects. \"This drilling initiative seeks to expand existing resources and evaluate the potential for new discoveries at the highest-priority, drill-ready targets,\" they stated. At Keno Silver, the focus will be on resource expansion at the Formo target, while at La Plata, the initial focus is on extending higher-grade mineralization at the Allard resource area. Couloir Capital also noted the recent top-up financing from  Newmont Corp. (NEM:NYSE) , viewing it as a positive development. \"We are encouraged to see additional share purchases from Newmont Corp. Newmont exercised its 'top-up right' to buy additional shares of MMG to maintain its 9.5% stake in the company,\" the analysts commented. \"We see this as a vote of confidence by a tier-1 miner in MMG's resource potential.\" Couloir Capital's fair value per share estimate of Blackwolf was updated to CA$0.47, representing a projected upside of 61.08% from the price at the time of the report of CA$0.29. Metallic Minerals' strategic plans include continuing exploration and resource expansion at both the Keno Silver and La Plata projects, as well as earning royalty monies on alluvial gold claims at its Australia Creek property near Dawson City, Yukon. With a Buy rating and a fair value estimate of CA$0.47, Couloir Capital sees significant potential in Metallic Minerals as the company advances its exploration projects and continues to expand its resource base. The analysts expect the 2024 drilling program to \"add significant ounces to the existing resources,\" potentially driving further value for shareholders.       Want to be the first to know about interesting  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Sign up to receive the  FREE  Streetwise Reports'  newsletter .         Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.       Related Articles    Copper Appears To Have Bottomed  Source: Michael Ballanger (07/05/2024)   Michael Ballanger of GGM Advisory Inc. takes a look at the current state of copper and shares his recommendations for two stocks.  read more > Expert Says Silver and Gold Stock Looking Most Attractive  Source: Clive Maund (07/03/2024)   Technical Analyst Clive Maund takes a look at Outcrop Silver & Gold Corp. (OCG:TSX.V; OCGSF:OTCQX; MRG1:DB) to explain why he believes it is a Buy. read more > Gold Popping up Once Again  Source: Michael Ballanger (07/03/2024)   Michael Ballanger of GGM Advisory Inc. shares an update on the current state of the market, and one stock he has been keeping his eye on. read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona  Source: Streetwise Reports (07/03/2024)   World Copper Ltd. (WCU:TSX.V; WCUFF:OTCQX; 7LY0:FRA) has released an update on its Zonia copper-oxide project in Arizona, revealing new potential for re-processing mineralized material from historical mine operations. What does this mean for future projects in the region? read more > Assays Find More High-Grade Lithium-Boron Results in Nevada  Source: Streetwise Reports (07/03/2024)   Canter Resources Corp. (CRC:CSE; CNRCF:OTC; 601:FRA) announced more brine assay results from its 15-hole shallow Geoprobe drill program at its Columbus Lithium-Boron Project near Tonopah, Nevada. Find out why one expert says the results so far are a hit. read more >               Want to read more about  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Get Our Streetwise Reports Newsletter Free and be the first to know!  A valid email address is required to subscribe   URL        Recommended Articles    Copper Appears To Have Bottomed Source: Michael Ballanger (07/05/2024) read more > Expert Says Silver and Gold Stock Looking Most Attractive Source: Clive Maund (07/03/2024) read more > Gold Popping up Once Again Source: Michael Ballanger (07/03/2024) read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona Source: Streetwise Reports (07/03/2024) read more > Assays Find More High-Grade Lithium-Boron Results in Nevada Source: Streetwise Reports (07/03/2024) read more >                Have You Signed Up for Our Newsletter Yet?       No Thanks          AboutDisclaimerContactSponsorshipSyndicationCareersPolicies  (c) 2024 Streetwise Reports. All rights reserved. Streetwise Reports is registered with the U.S. Patent and Trademark Office.         "
}