{
    "title": "Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New ... ",
    "source": " Newsfile",
    "Content": "       Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project                                              Cookie Settings  We use cookies to analyze user behavior in order to constantly improve the website for you. Learn more. Accept All Accept Selection Reject All   Necessary Analytics              Login    Search       Search       en fr de es                   Vancouver, British Columbia--(Newsfile Corp. - July 3, 2024) -  Nicola Mining Inc. (TSXV: NIM)  (the \" Company \" or \" Nicola \") is pleased to announce the completion of a 3D induced polarization survey (\" 3D IP Survey \"). Based on 3D IP Survey results the Company is in the process of commencing of its 2024 diamond drilling program (\" Program \") at the New Craigmont Copper Project (\" New Craigmont \"), situated approximately 11 kilometres from Merritt, BC and adjacent to Teck Resources Ltd.'s Highland Valley Copper, Canada's largest open-pit copper mine.As previously announced in the Company's Feb. 21, 2024 and May 13, 2024 news releases, Nicola engaged Dias Geophysical of Saskatoon, SK, to conduct a 3D IP Survey. This comprehensive survey aimed to better define two principal exploration areas: the MARB-CAS Zone and the West Craigmont Zone (Figure 1). Upon reviewing the data from the approximately 6.5 square kilometer survey, the Company has commenced its 2024 diamond drilling exploration program. Figure 1 . 2024 IP Survey AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_001full.jpgA significant resistivity anomaly appears in the western section of New Craigmont, near the Lornex Fault, via the Company's 2022 ZTEM Survey. This anomaly was confirmed and refined by the 2024 3D IP Survey. Additionally, the Survey detected chargeability anomalies on the edges of the resistivity anomaly within the area, and a potential structure trending ENE, which coincides with the strongest and largest chargeability anomaly. This resistivity high could represent a felsic intrusion, as was observed in outcrop, and the chargeability high could indicate peripheral sulphidation, likely enhanced along the potential structure. The 3D IP Survey has generated multiple drilling targets focusing on the chargeability anomalies within the West Craigmont Zone.The 3D IP Survey at MARB-CAS provided valuable information regarding the lithologies and appears to clearly delineate the contact between Nicola Group rocks and the Guichon Creek Batholith. The major chargeability anomalies are primarily confined within the Nicola Group rocks in the southern portion of the survey area, with some chargeability anomalies detected between the MARB and CAS MINFILE showings.Peter Espig, Chief Executive Officer, commented, \"The 3D IP Survey both confirmed and further defined key targets. Combining numerous geological and geophysical parameters, including bedrock mapping, airborne magnetic survey, and ZTEM survey with the 3D IP Survey gives us a great confidence to have a successful Program.\"A total of 5,000 m of core drilling is planned for the 2024 exploration program. Drilling will primarily be focused on the West Craigmont Zone initially, with the possibility of also drilling at MARB/CAS later in the summer (Figure 2). Figure 2 . 2024 Drill Target AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_002full.jpg Qualified Person William Whitty, P. Geo., the Company's VP Exploration, is the Qualified Person as defined by National Instrument 43-101 -  Standards of Disclosure for Mineral Projects  and supervised the preparation of, and has reviewed and approved, the technical information in this release. About Nicola Mining Nicola Mining Inc. is a junior mining company listed on the Exchange and Frankfurt Exchange that maintains a 100% owned mill and tailings facility, located near Merritt, British Columbia It has signed Mining and Milling Profit Share Agreements with high grade gold projects. Nicola's fully permitted mill can process both gold and silver mill feed via gravity and flotation processes.The Company owns 100% of the New Craigmont Project, a high-grade copper property, which covers an area of over 10,800 hectares along the southern end of the Guichon Batholith and is adjacent to Highland Valley Copper, Canada's largest copper mine. The Company also owns 100% of the Treasure Mountain Property, which includes 30 mineral claims and a mineral lease, spanning an area exceeding 2,200 hectares.On behalf of the Board of Directors \" Peter Espig \"  Peter EspigCEO & Director For additional information Contact: Peter EspigPhone: (778) 385-1213 Email: info@nicolamining.comURL: www.nicolamining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/215275        Get News by Email  Analyst, journalist, or company stakeholder? Sign up to receive news releases by email for Nicola Mining Inc. or all companies belonging to the Mining and Metals industry.  Sign Up    Recent News  Company Profile   Articles from Newsfile        Oct 25, 2023       How to Avoid the Most Haunted PR Communication Mistakes     The worldwide public relations market is valued at approximately $107 billion U.S. dollars in 2023.          Hashtags   Subjects  Economy, Business and Finance Metal and Mineral Mining    Similar Stories               Tell Us Your Story      Learn More                    Treating you-and your story-with courtesy and care. Our commitment to delivering the best personal service defines our business and inspires our efforts every day. We're accessible and responsive to every client we serve, using cutting-edge technology and innovation makes it easier for us to focus on relationship building. The way we see it, a helpful voice on the phone is always welcomed. In addition to respecting you, Newsfile is respected as an accredited source of business news-making every story we handle become trusted for retail and institutional investment decisions.Complete the form to the right and a customer service representative will contact you to answer your questions.         x    Name *     Company *     Email *     Phone     Message *      Send Message                       x Login     Incorrect username/password.       Username     Password       Login         "
}