{
    "title": "Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New ... ",
    "source": " StockTitan",
    "Content": "                                  Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project | HUSIF Stock News                               Login  Please enter your login and password   Wrong username or password.     Email address     Password   Forgot password?   LOGIN Close     Don't have an account? Sign Up!                            Forgot Password  Please enter your email address   An email has been sent to your address with instructions for changing your password.     There is no user registered with this email.     Email address     RECOVER Close                            Sign Up  To create a free account, please fill out the form below.   Thank you for signing up! A confirmation email has been sent to your email address. Please check your email and follow the instructions in the message to complete the registration process. If you do not receive the email, please check your spam folder or contact us for assistance. Welcome to our platform!     Oops! Something went wrong while trying to create your new account. Please try again and if the problem persist, Email Us to receive support.     Username     Email address     Password      I accept the user agreement       Sign me up for the newsletter      CREATE ACCOUNT Close     Already have an account? Login                   Home     News    HUSIF        Trending News           AP   Ampco-Pittsburgh Subsidiaries Announce Commercial Contract Wins a...           VVPR   VIVOPOWER SECURES EXTENSION FOR US$34M LOAN FINANCING FACILITY AG...           SOFI   Galileo Financial Technologies Helps Fintechs Meet Demand for Fas...           MAXN   Maxeon Releases 2023 Sustainability Report, Highlighting its Cont...           ARQT   FDA Approves Arcutis' ZORYVE(r) (roflumilast) Cream 0.15% for the T...           AMLX   Amylyx Pharmaceuticals Announces Acquisition of Phase 3-ready GLP...                       AP   Ampco-Pittsburgh Subsidiaries Announce Commercial Contract Wins a...           VVPR   VIVOPOWER SECURES EXTENSION FOR US$34M LOAN FINANCING FACILITY AG...                   SOFI   Galileo Financial Technologies Helps Fintechs Meet Demand for Fas...           MAXN   Maxeon Releases 2023 Sustainability Report, Highlighting its Cont...                   ARQT   FDA Approves Arcutis' ZORYVE(r) (roflumilast) Cream 0.15% for the T...           AMLX   Amylyx Pharmaceuticals Announces Acquisition of Phase 3-ready GLP...                     Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project          Rhea-AI Impact    (No impact)        Rhea-AI Sentiment    (Neutral)        Tags             Rhea-AI Summary     Nicola Mining has completed a 3D induced polarization (IP) survey at its New Craigmont Copper Project near Merritt, BC. The survey, conducted by Dias Geophysical, covered approximately 6.5 square kilometers and focused on the MARB-CAS and West Craigmont Zones. Key findings include significant resistivity and chargeability anomalies that indicate potential copper-rich areas. Based on these results, Nicola has commenced its 2024 diamond drilling program, targeting 5,000 meters of core drilling. Initial drilling will focus on the West Craigmont Zone, with possible expansion to the MARB/CAS areas later in the summer.         Positive   None.       Negative   None.           07/03/2024 - 09:00 AM  Vancouver, British Columbia--(Newsfile Corp. - July 3, 2024) -  Nicola Mining Inc. (TSXV: NIM)  (the \" Company \" or \" Nicola \") is pleased to announce the completion of a 3D induced polarization survey (\" 3D IP Survey \"). Based on 3D IP Survey results the Company is in the process of commencing of its 2024 diamond drilling program (\" Program \") at the New Craigmont Copper Project (\" New Craigmont \"), situated approximately 11 kilometres from Merritt, BC and adjacent to Teck Resources Ltd.'s Highland Valley Copper, Canada's largest open-pit copper mine.As previously announced in the Company's Feb. 21, 2024 and May 13, 2024 news releases, Nicola engaged Dias Geophysical of Saskatoon, SK, to conduct a 3D IP Survey. This comprehensive survey aimed to better define two principal exploration areas: the MARB-CAS Zone and the West Craigmont Zone (Figure 1). Upon reviewing the data from the approximately 6.5 square kilometer survey, the Company has commenced its 2024 diamond drilling exploration program. Figure 1 . 2024 IP Survey AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_001full.jpgA significant resistivity anomaly appears in the western section of New Craigmont, near the Lornex Fault, via the Company's 2022 ZTEM Survey. This anomaly was confirmed and refined by the 2024 3D IP Survey. Additionally, the Survey detected chargeability anomalies on the edges of the resistivity anomaly within the area, and a potential structure trending ENE, which coincides with the strongest and largest chargeability anomaly. This resistivity high could represent a felsic intrusion, as was observed in outcrop, and the chargeability high could indicate peripheral sulphidation, likely enhanced along the potential structure. The 3D IP Survey has generated multiple drilling targets focusing on the chargeability anomalies within the West Craigmont Zone.The 3D IP Survey at MARB-CAS provided valuable information regarding the lithologies and appears to clearly delineate the contact between Nicola Group rocks and the Guichon Creek Batholith. The major chargeability anomalies are primarily confined within the Nicola Group rocks in the southern portion of the survey area, with some chargeability anomalies detected between the MARB and CAS MINFILE showings.Peter Espig, Chief Executive Officer, commented, \"The 3D IP Survey both confirmed and further defined key targets. Combining numerous geological and geophysical parameters, including bedrock mapping, airborne magnetic survey, and ZTEM survey with the 3D IP Survey gives us a great confidence to have a successful Program.\"A total of 5,000 m of core drilling is planned for the 2024 exploration program. Drilling will primarily be focused on the West Craigmont Zone initially, with the possibility of also drilling at MARB/CAS later in the summer (Figure 2). Figure 2 . 2024 Drill Target AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_002full.jpg Qualified Person William Whitty, P. Geo., the Company's VP Exploration, is the Qualified Person as defined by National Instrument 43-101 -  Standards of Disclosure for Mineral Projects  and supervised the preparation of, and has reviewed and approved, the technical information in this release. About Nicola Mining Nicola Mining Inc. is a junior mining company listed on the Exchange and Frankfurt Exchange that maintains a 100% owned mill and tailings facility, located near Merritt, British Columbia It has signed Mining and Milling Profit Share Agreements with high grade gold projects. Nicola's fully permitted mill can process both gold and silver mill feed via gravity and flotation processes.The Company owns 100% of the New Craigmont Project, a high-grade copper property, which covers an area of over 10,800 hectares along the southern end of the Guichon Batholith and is adjacent to Highland Valley Copper, Canada's largest copper mine. The Company also owns 100% of the Treasure Mountain Property, which includes 30 mineral claims and a mineral lease, spanning an area exceeding 2,200 hectares.On behalf of the Board of Directors \" Peter Espig \"  Peter EspigCEO & Director For additional information Contact: Peter EspigPhone: (778) 385-1213 Email: info@nicolamining.comURL: www.nicolamining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/215275     FAQ       What is the significance of Nicola Mining's 3D IP Survey at New Craigmont?    The 3D IP Survey identified significant resistivity and chargeability anomalies, indicating potential copper-rich areas, which guide the 2024 drilling program.        When did Nicola Mining announce the completion of the 3D IP Survey at New Craigmont?    Nicola Mining announced the completion of the 3D IP Survey on July 3, 2024.        What zones are targeted in Nicola Mining's 2024 drilling program at New Craigmont?    The 2024 drilling program targets the West Craigmont Zone initially, with possible expansion to the MARB/CAS areas later in the summer.        Who conducted the 3D IP Survey for Nicola Mining?    Dias Geophysical conducted the 3D IP Survey for Nicola Mining.        How large is the survey area for Nicola Mining's 3D IP Survey at New Craigmont?    The 3D IP Survey covered approximately 6.5 square kilometers at New Craigmont.        What is the planned drilling depth for Nicola Mining's 2024 exploration program at New Craigmont?    Nicola Mining plans to drill a total of 5,000 meters of core drilling in its 2024 exploration program.        What anomalies were found in the 3D IP Survey at New Craigmont?    The 3D IP Survey identified significant resistivity and chargeability anomalies, suggesting potential copper mineralization.         Nicola Mining Inc. OTC:HUSIF        HUSIF Rankings     N/A  Ranked by Market Cap   N/A  Ranked by Dividends         HUSIF Latest News       Jun 3, 2024  Nicola Mining and High Range Exploration Commence Work at Dominion Creek High Grade Gold / Silver Project      May 13, 2024  Nicola Mining Announces Commencement of 3D IP Survey at New Craigmont Copper Project      Apr 9, 2024  Nicola Mining Inc. and Talisker Resources Ltd. Enter into Milling Agreement      Apr 5, 2024  Nicola Mining and Lower Nicola Site Services Commence Construction of Cement Plant to Service Infrastructure Projects      Feb 21, 2024  Nicola Mining Inc. Engages Dias Geophysical to Conduct IP Survey at New Craigmont Copper Project          HUSIF Stock Data       Market Cap 36.67M     Float 131.13M     Insiders Ownership 21.63%     Institutions Ownership 12.66%     Industry Dimension Stone Mining and Quarrying      Sector Mining, Quarrying, and Oil and Gas Extraction     Website Link     Country United States of America     City Lower Nicola         "
}