{
    "title": "Environmental coalition opposes Challenger Energy's bid to renew offshore drilling licenses ",
    "source": " EyeWitness News",
    "Content": "        Environmental coalition opposes Challenger Energy's bid to renew offshore drilling licenses - Eye Witness News                                                                                                              NASSAU, BAHAMAS - A coalition of environmental organizations and businesses has strongly opposed Challenger Energy Group's attempt to renew its offshore drilling licenses. \"Our Islands, Our Future (OIOF),\" a coalition of over 150 businesses, environmental groups, tourism advocates, and other Bahamian and international leaders, stated yesterday that it strongly opposes Challenger Energy Group's recent suggestion that the Bahamian government may renew offshore drilling licenses that expired over three years ago. The coalition stressed that the government's previous decision to halt consideration of these renewals sends a clear message that The Bahamas is shifting away from fossil fuels and embracing a sustainable energy future. Challenger Energy Group, formerly known as The Bahamas Petroleum Company (BPC), continues its efforts to secure the renewal of its licenses for a third three-year exploration period. The company is currently engaged in ongoing discussions with the Government regarding the renewal terms. Eytan Uliel, Chief Executive of Challenger Energy, noted in the company's 2023 annual report and financial statement: \"In relation to the Company's licenses in The Bahamas, throughout 2023 we continued to pursue a renewal of the licenses into a third exploration period. In parallel, we explored various alternative strategies to monetize those assets. The process has been frustratingly slow, but we expect to make better progress in the coming 12 months.\" The report also noted that under its Bahamian exploration licenses, the company must pay the government in advance for annual rentals in the licensed areas. Following the Environmental Authorization for the Perseverance-1 well on February 27, 2020, discussions between the company and the Government of The Bahamas seeking a final agreement on the amount of license fees payable for the remainder of the second exploration period (including the extension due to force majeure) have lacked substantive progress to date. \"The fact that the government has not renewed or considered these licenses is a positive indication that The Bahamas is looking toward a cleaner, greener future,\" said Andurah Daxon, Executive Director of Waterkeepers Bahamas. \"We cannot afford to jeopardize our marine environment and coastal ecosystems for uncertain oil prospects.\" Earlier this year, OIOF commissioned a nationwide poll revealing overwhelming public support for a permanent ban on oil drilling in Bahamian waters. The extensive survey showed that 86 percent of respondents support legislative action to prevent further fossil fuel exploration, with 74 percent advocating for a transition to renewable energy. Of the more than 400 respondents, only four percent opposed a ban on oil drilling, and nine percent were undecided. \"The Bahamian people have spoken loud and clear. They want to protect our pristine waters and vibrant marine life, which are the lifeblood of our tourism and fishing industries,\" said Casuarina McKinney-Lambert, Executive Director of the Bahamas Reef Environment Educational Foundation (BREEF). \"The path forward for the Bahamas is not through fossil fuels but through sustainable energy solutions. The recent oil spill off Clifton underscores the urgency to clean up existing sources of marine pollution and transition to a renewable future.\" According to OIOF, the exploration licenses referenced in Challenger Energy Group's 2023 annual report expired in 2021, and based on available information, the company still owes government fees associated with those licenses. Therefore, the groups emphasize that it is dangerously misleading to state, \"Challenger Energy holds four exploration licenses offshore in The Bahamas.\" This discrepancy further underscores the need for the government to take decisive action and permanently deny these renewal requests. \"The government's refusal to consider renewal based on non-payment of license fees was an important step, and three years have now gone by since those licenses expired,\" said Chris Wilke of Waterkeeper Alliance. \"With Challenger still knocking at the door, a permanent ban on oil drilling would provide the strongest possible assurance of the Bahamian commitment to safeguarding the marine environment and embracing a clean energy future.\" OIOF asserts that The Bahamas has a unique opportunity to lead the Caribbean region to reject dirty fossil fuel proliferation, transition to renewable energy, and set an example for sustainable development and environmental stewardship. OIOF urges the government to prioritize the long-term health and prosperity of the nation by formally denying exploration renewal requests, rejecting any further oil exploration licenses, and committing to a future powered by clean, renewable energy.                                Tags  Always a headline ahead, ewnews, ewnews.com, Eyewitness News, Eyewitness News Online, Nassau Bahamas, www.ewnews.com          About Natario McKenzie  View all posts by Natario McKenzie →         Related                   Watch Live at 7pm   Watch ILTV Live                       By clicking \"Accept\" you agree to Eye Witness News Comment Policy, Terms and Conditions and Privacy Policy | Terms & Conditions |  Comment Policy |  Privacy Policy  ACCEPT Terms & Privacy Policy       Close            Privacy Overview    This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.               Necessary    Necessary   Always Enabled         Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.              Non-necessary    Non-necessary           Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.                           SAVE & ACCEPT                  Translate >>    Hide picture    "
}