"      Crude oil futures and settle at $83.38 | Forexlive        ADVERTISEMENT - CONTINUE READING BELOW     Home    >  Technical Analysis  >  Crude oil futures and settle at $83.38     Technical Analysis      Oil   Crude oil futures and settle at $83.38   Up $1.84 or 2.26% on the day      Greg Michalowski    Monday, 01/07/2024 | 18:45 GMT-0     01/07/2024 | 18:45 GMT-0      0       Crude oil futures are settling at $83.38. That is up $1.84 or 2.26% on the day. The gain is the largest one day gain since June 10 when the index rose 2.93% and driven by expectations of higher summer demand and concerns over potential supply shortages due to OPEC+ production cuts. Oil prices increased by 6% in June, supported by OPEC+ extending output cuts until 2025. Analysts foresee supply deficits in the third quarter as summer travel and increased air-conditioning usage reduce fuel reserves. Investors are awaiting comments from Federal Reserve Chair Jerome Powell, the central bank's policy meeting minutes on Wednesday, and U.S. nonfarm payroll data on Friday to gauge the direction for ageless rates and the economy. Additionally, traders are monitoring the impact of hurricanes on oil and gas production, with Hurricane Beryl threatening the Caribbean's Windward Islands.  Crude oil is moving away from the 61.8% retracement Technically, after moving above the 50% retracement of the move down from the April 2024 high at $80.06 back on June 18, the price consolidated between the 61.8% at $81.84 and the 50% midpoint at $80.06 until breaking higher on Friday. That break, however, did retrace back toward the 61.8% retracement level into Friday's close (see yellow area on the chart above). Today, the trend was more to the upside extending to the highest levels since April 29.The next target comes in against the April 26 high price at $84.46. The close risk now comes against the 61.8% retracement at $81.84.  ADVERTISEMENT - CONTINUE READING BELOW   Tags  Oil  ADVERTISEMENT - CONTINUE READING BELOW   Most Popular   Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)   Weekly Market Outlook (15-19 July)   Statement from Former Pres. Trump after assassination attempt   US June PPI +2.6% vs +2.3% expected   China plenum meeting against the background of calls for more economic stimulus   Former Pres. Trump rushed off stage after apparent shots fired   Dollar gives up light gains from earlier in the day   ADVERTISEMENT - CONTINUE READING BELOW    ADVERTISEMENT - CONTINUE READING BELOW             Contact us     Newsletter          GMT  00:00:00 LON  00:00:00 NY  00:00:00 TKYO  00:00:00 SYD  00:00:00        Get the Forexlive newsletter     Your email         First name         Last name       Select additional content:    Education    Trading offers from relevant providers        By submitting I agree to Forexlive's Terms, Cookies and Privacy Notice.     Submit      Stock Daily Updates AAPL stockAMD stockAMZN stockAXON stock   Top Forex Brokers    Must Read  Kickstart the FX trading day for July 12 w/a technical look at the EURUSD, USDJPY & GBPUSD 🔥📊🚀Unbelievable REAL trading success: A trader turned $200 to $190,000! 🔥📊🚀 How to use fundamentals to trade forex I am shorting oil here near 84-85 USD, see the plan It's not you.. The temperature definitely feels hotter Gold Technical Analysis - The NFP report increased the bullish sentiment Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)        !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}    "