[
    {
        "title": "ICE Low Sulphur Gasoil markets hit series of OI records",
        "source": "FX News Group",
        "keypoints": [
            "ICE Low Sulphur Gasoil markets achieved open interest records through June 2024.",
            "Open interest reached 1.2 million across futures and options, equivalent to 120 million metric tons.",
            "Year-over-year growth: futures and options open interest up over 40%, trading volumes up 30%.",
            "ICE Gasoil options hit record open interest of 234,570 contracts.",
            "In Q2 2024, 287,421 Gasoil options traded, contributing to a record 16.2 million oil options contracts at ICE.",
            "ICE Gasoil is physically deliverable, with an average of over 100,000 tons entering the delivery process monthly in 2024.",
            "ICE’s global crude and refined product complex includes significant benchmarks like Brent crude and ICE Murban.",
            "The global oil complex open interest at ICE is up over 20%, totaling 14 million contracts."
        ]
    },
    {
        "title": "NNPC Ltd Declares State of Emergency on Crude Oil Production",
        "source": "NNPC Ltd",
        "keypoints": [
            "NNPC Ltd declared a state of emergency to boost Nigeria's crude oil production and reserves.",
            "Aims to produce 2 million barrels of crude oil per day without new rigs.",
            "Focus on overcoming delays in procurement processes and other production obstacles.",
            "Plans to replace old crude oil pipelines and introduce a rig-sharing program to retain rigs in-country.",
            "NNPC Ltd is investing in midstream gas infrastructure to boost domestic gas production and supply.",
            "The company is also advancing in the Compressed Natural Gas (CNG) sector, commissioning new CNG stations.",
            "Calls for industry collaboration to reduce production costs and boost output.",
            "Emphasized commitment to critical infrastructure projects like the OB3 and Ajaokuta-Kaduna-Kano gas pipelines."
        ]
    },
    {
        "title": "EIA reports surge in Iraqi oil exports to the US",
        "source": "Shafaq News",
        "keypoints": [
            "Iraqi oil exports to the US increased to an average of 217,000 barrels per day (bpd) last week.",
            "This marks an increase of 22,000 bpd from the previous week's average of 195,000 bpd.",
            "The US crude oil imports from nine key countries reached 5.635 million bpd, up by 235,000 bpd from the previous week.",
            "Canada led US oil imports with 3.889 million bpd, followed by Mexico and Saudi Arabia.",
            "EIA data indicates significant contributions from other countries like Colombia, Brazil, Nigeria, Ecuador, and Libya."
        ]
    },
    {
        "title": "Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise",
        "source": "MarketPulse",
        "keypoints": [
            "Oil prices remain stable despite a turbulent weekend and a strong US dollar.",
            "Chinese economic data, including disappointing GDP growth and declining refinery output, raises concerns about oil demand.",
            "Technical analysis suggests potential for a triple bottom pattern in oil prices, with key support and resistance levels identified.",
            "Chinese GDP growth slowed to 0.7% quarter-on-quarter in Q2, down from 1.6% in Q1, below market expectations.",
            "Chinese refinery output declined for the third consecutive month due to planned maintenance and weak fuel demand.",
            "Crude oil imports for June dropped 11% while H1 imports were down 2.3% YoY.",
            "The Chinese share of global oil demand growth is declining to 40% this year from last year's 70%.",
            "US and Europe are in the middle of the peak driving season, leading to high demand for petroleum and other oil-related products.",
            "Geopolitics remains a concern and could impact oil prices."
        ]
    },
    {
        "title": "India's crude oil imports from Russia at 12-month high in June",
        "source": "The Hindu BusinessLine",
        "keypoints": [
            "India's crude oil imports from Russia rose to 1.97 million barrels per day in June 2024, the highest since July 2023.",
            "Imports from Russia were up by 15% month-on-month and 2% year-on-year.",
            "Public refiners such as IOCL, BPCL, and HPCL imported 1.10 mbpd crude oil, a 12-month high.",
            "Private refiners Reliance Industries and Rosneft-backed Nayara Energy imported a record 871,200 barrels per day from Russia in June 2024.",
            "India's crude imports have remained robust at 4.62 mbpd in June.",
            "Imports from traditional suppliers in West Asia, such as Iraq and Saudi Arabia, declined.",
            "Crude oil shipments from the US continued to rise for the second consecutive month in June 2024."
        ]
    },
    {
        "title": "Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline",
        "source": "Nairametrics",
        "keypoints": [
            "Dangote refinery in Nigeria is increasing gasoil exports to West Africa, reducing reliance on European imports.",
            "The refinery's output of gasoil reached nearly 100,000 barrels per day in May, doubling April's levels.",
            "European gasoil exports to West Africa hit a four-year low in May, while Russian exports to the region also declined.",
            "The Petroleum Industry Bill in Nigeria mandates a sulphur content of 50 ppm, but the local market temporarily allowed higher sulphur content.",
            "The refinery aims to supply West and Central African countries once fully operational, potentially reducing $17 billion in oil imports."
        ]
    },
    {
        "title": "Oil prices surge amid political uncertainty, geopolitical tensions",
        "source": "MENAFN",
        "keypoints": [
            "Oil prices saw a modest increase due to geopolitical uncertainty in the U.S. and Middle East, despite pressures from a stronger dollar and subdued Chinese demand.",
            "Brent crude futures increased to USD85.18 per barrel, while West Texas Intermediate crude rose to USD82.41 per barrel.",
            "The attempted assassination of U.S. presidential candidate Donald Trump added to market uncertainty.",
            "Ongoing geopolitical risks in the Middle East and continuing supply cuts by OPEC+ supported oil prices.",
            "China's economic slowdown and reduced crude oil imports have exerted downward pressure on oil prices."
        ]
    },
    {
        "title": "Global Oil Prices Inched Down amid China's Slowing Economy",
        "source": "Tempo.co",
        "keypoints": [
            "Global oil prices fell due to concerns over declining demand from China amid its economic slowdown.",
            "Brent crude fell to US$84.76 per barrel, and West Texas Intermediate (WTI) crude dropped to US$81.78 per barrel.",
            "China's economy grew at a slower-than-expected rate of 4.7 percent in Q2 2024.",
            "China's oil refinery output fell 3.7 percent in June due to planned maintenance and poor refining margins.",
            "Fed Chair Jerome Powell's comments about U.S. inflation suggested potential for lower interest rates, which could increase oil demand."
        ]
    },
    {
        "title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026",
        "source": "Quantum Commodity Intelligence",
        "keypoints": [
            "Adnoc is set to boost production from the giant offshore Zakum field with further ramp-up from 2026.",
            "The expansion includes awarding a $412m drilling contract for Upper Zakum.",
            "Adnoc Logistics and Services has been awarded its first major contract for a new Lower Zakum island.",
            "Adnoc is increasing the volumes of medium sour Upper Zakum crude to its Ruwais refining complex."
        ]
    },
    {
        "title": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG",
        "source": "The Whistler Newspaper",
        "keypoints": [
            "The IPPG chairman calls for expedited resolution of IOC divestments to unlock crude oil production up to 2.5 million barrels per day.",
            "Approval of IOC divestment is seen as a way to restore global investor confidence in Nigeria.",
            "Despite Nigeria's large hydrocarbon resources, current production is significantly below capacity.",
            "Advocates for deepwater development to unlock incremental production of 700,000 barrels per day.",
            "Emphasizes the need for domestic refining and petrochemical capacity to transform Nigeria into a net exporter."
        ]
    },
    {
        "title": "OPEC: Global crude oil demand will rise to 116m bpd in 2045",
        "source": "TV360 Nigeria",
        "keypoints": [
            "OPEC projects global oil demand to reach 116 million barrels per day by 2045.",
            "World economy expected to grow from $138 trillion in 2023 to $270 trillion in 2045.",
            "Total oil-related investment requirements between 2024 and 2045 estimated at $14 trillion.",
            "OPEC emphasizes the need for significant investment to maintain supply security and avoid volatility.",
            "675 million people currently lack access to basic energy forms; 2.3 billion without access to clean cooking fuels."
        ]
    },
    {
        "title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil",
        "source": "Nairametrics",
        "keypoints": [
            "Dangote Refinery plans to source crude oil from African countries like Angola, Senegal, and Libya.",
            "Recent imports from the US and Brazil are expected to supply the refinery in the coming months.",
            "Local refineries in Nigeria face challenges in securing crude due to preferences for export by IOCs.",
            "Dangote Refinery aims to start production of petrol by mid-July and significantly reduce Nigeria's dependency on imported petroleum products.",
            "Regulatory bodies insist IOCs meet local demand before exporting."
        ]
    },
    {
        "title": "Oil futures: Crude prices extend losses on economic, demand concerns",
        "source": "Quantum Commodity Intelligence",
        "keypoints": [
            "Crude oil futures are declining due to concerns over broader economic growth, despite prospects for a US rate cut in September.",
            "Federal Reserve Chair Jerome Powell indicated rate cuts could happen before inflation hits 2%, which could drive economic growth and oil consumption.",
            "Chinese GDP figures were disappointing, and crude oil throughput in China is decreasing due to thin margins.",
            "Weak economic data from China negatively impacts crude oil market sentiment.",
            "Concerns are rising that US oil demand peaked during the 4th of July holiday.",
            "Ongoing geopolitical tensions, including attacks on regional shipping by Houthi militants, are being closely monitored.",
            "The North Sea physical market is retreating, with Forties crude trading lower."
        ]
    },
    {
        "title": "Dangote Refinery: Crude oil supply options",
        "source": "Blueprint Newspapers Limited",
        "keypoints": [
            "International oil companies (IOCs) operating in Nigeria have resisted establishing refineries, citing government-controlled pump prices as a deterrent.",
            "Dangote Refinery, funded by international development banks, disproved the IOCs' claims and started operations in January 2024.",
            "IOCs are reportedly sabotaging Dangote Refinery by refusing to sell crude oil or selling it at inflated prices.",
            "As a result, Dangote Refinery imports crude oil from the USA despite Nigeria being a major crude oil producer.",
            "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) allows independent marketers to import diesel, exacerbating high energy costs and inflation.",
            "The Nigerian National Petroleum Company Limited (NNPCL) is criticized for not supplying crude oil to Dangote Refinery, which could alleviate Nigeria's energy cost crisis.",
            "NNPCL's refusal to supply crude oil is linked to its interests in maintaining the petrol subsidy scandal.",
            "There is potential for NNPCL to reroute crude oil exports to Dangote Refinery, benefiting Nigeria's economy and reducing reliance on foreign refiners."
        ]
    },
    {
        "title": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes",
        "source": "Reuters",
        "keypoints": [
            "Spain's crude oil imports in May increased by 23.5% year-on-year to 5.9 million tonnes.",
            "The increase in crude oil imports is indicative of rising demand or adjustments in supply chains."
        ]
    },
    {
        "title": "New North Hamada Pipeline Boosts Libyan Oil Production",
        "source": "Energy Capital & Power",
        "keypoints": [
            "A new pipeline from the North Hamada oil field in Libya has commenced operations.",
            "The pipeline, developed by Nafusa Oil Operations, transports oil to the Mellitah oil port.",
            "Production from the North Hamada field is expected to reach 8,000 barrels per day by mid-July and 10,000 barrels per day by next August.",
            "The Libyan National Oil Corporation (NOC) aims to achieve a production rate of 2 million barrels per day by 2030."
        ]
    },
    {
        "title": "NNPC Declares State of Emergency on Crude Oil Production",
        "source": "News Diary Online",
        "keypoints": [
            "NNPC Ltd has declared a state of emergency on crude oil production in Nigeria to increase output and grow reserves.",
            "The declaration was made by the Group Chief Executive Officer, Mr. Mele Kyari, at the Nigeria Oil & Gas Conference and Exhibition.",
            "Nigeria has the potential to produce two million barrels of crude oil per day without new rigs, but delays and other challenges have impeded production.",
            "NNPC Ltd plans to replace old crude oil pipelines and introduce a rig sharing program to improve production efficiency.",
            "NNPC Ltd is committed to investing in critical midstream gas infrastructure and boosting domestic gas production for power generation and industrial development."
        ]
    },
    {
        "title": "Crude oil falls after weak Chinese growth",
        "source": "London Business News | Londonlovesbusiness.com",
        "keypoints": [
            "Crude oil prices fell slightly due to weak Chinese economic data.",
            "West Texas Intermediate (WTI) dropped from $81.20 to $80.45 per barrel, while Brent crude declined to $83.80 per barrel.",
            "China's year-on-year growth in the second quarter was 4.7%, lower than the forecasted 5.1%.",
            "China's crude oil imports fell by 2.3% in the first half of the year, indicating weaker economic activity.",
            "Despite weak Chinese demand, geopolitical factors have maintained stability in crude oil prices."
        ]
    },
    {
        "title": "China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report",
        "source": "The North Africa Post",
        "keypoints": [
            "Major African oil suppliers are struggling with declining production and exports to China.",
            "China's oil imports from Africa dropped from more than a third to about one-tenth by 2022.",
            "Between 2019 and 2023, China's oil imports from Malaysia, the UAE, Kazakhstan, and Kuwait increased dramatically.",
            "Angola, once China's No. 2 source of crude oil, has fallen to the eighth place.",
            "Declines in China's oil imports from countries like South Sudan, Sudan, and Nigeria are due to geopolitical considerations, lack of investment, and domestic political problems.",
            "China is increasingly turning to the more predictable production infrastructure of the Gulf countries, Russia, and other Asian countries."
        ]
    },
    {
        "title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices",
        "source": "World Pipelines",
        "keypoints": [
            "Strong market fundamentals are pushing oil prices higher, with four consecutive weeks of increases.",
            "Lower crude exports from OPEC and Russia, combined with ramped-up refinery runs, are contributing to a tighter market.",
            "Expectations of interest rate cuts by the US Federal Reserve and high geopolitical risk premiums are adding to the upward pressure on oil prices.",
            "Rystad Energy has lowered its forecast for US oil production from August 2024 onwards due to a downturn in Permian oil output.",
            "OPEC+ crude exports declined in June compared to May, with steady exports from the Middle East and declining exports from Russia.",
            "The tightening crude market and the surge in Brent prices over the past three weeks are explained by lower crude exports and increased global refinery runs.",
            "US inflation figures are pivotal for the Federal Reserve's upcoming rate-setting decision, with markets anticipating rate cuts potentially starting in September."
        ]
    },
    {
        "title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance",
        "source": "Shafaq News",
        "keypoints": [
            "OPEC's crude oil production held steady for the third consecutive month due to Iraq and the UAE's non-compliance with agreed-upon cuts.",
            "OPEC produced an average of 26.98 million barrels per day in June, a decrease of 80,000 barrels per day from the previous month.",
            "Iraq and the UAE did not fully comply with the production cuts agreed upon at the beginning of the year.",
            "Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day in June, but its production still exceeded the quota by approximately 250,000 barrels per day.",
            "Efforts to enhance compliance with production cuts have shown limited results, and full enforcement may be necessary to push crude oil prices higher."
        ]
    },
    {
        "title": "India's crude oil imports from Russia touch 13-month high",
        "source": "DH Latest News",
        "keypoints": [
            "India's crude oil imports from Russia reached a 13-month high in June, with 2.13 million barrels per day.",
            "Imports of Urals crude oil reached an all-time high of 1.6 million barrels per day.",
            "India's imports of Russian grades from the Far East, such as ESPO or Sokol, have resumed but in lower quantities compared to 2023.",
            "The share of US crude in India’s oil imports increased by 75% sequentially to 371,000 barrels per day.",
            "Import volumes from Iraq and Saudi Arabia declined by 24% and 25% respectively in June.",
            "June imports from Saudi Arabia were at the lowest monthly figure since January 2014.",
            "Reliance Industries and Indian Oil Corp were the largest buyers of Russian crude oil among Indian refiners in June."
        ]
    },
    {
        "title": "Dangote Refinery to Import First Shipment of Brazilian Crude Oil",
        "source": "Naija247news",
        "keypoints": [
            "Nigeria's Dangote refinery is set to receive its first shipment of Brazilian crude oil, marking a historic purchase for Nigeria.",
            "The refinery will import a one-million-barrel cargo of Brazil's Tupi crude, scheduled for delivery in the latter half of next month.",
            "The Dangote refinery aims to reduce Nigeria's reliance on imported fuel by refining crude locally, enhancing energy security, reducing import dependency, and lowering fuel prices.",
            "Sourcing crude oil from diverse global suppliers is key to the refinery's success and Nigeria's broader energy strategy.",
            "The Nigerian Upstream Petroleum Regulatory Commission reached an agreement with oil producers to supply crude oil to domestic refineries at market prices, ensuring a stable supply.",
            "The Dangote refinery stands at the forefront of Nigeria's efforts to build its refining capabilities and transform its energy infrastructure."
        ]
    }
]