[
    {
        "title": "Bedford gas leak after drilling company hits natural gas pocket ",
        "source": " BBC.com",
        "keypoints": [
            "A drilling company caused a gas leak in Bedford after hitting a natural gas pocket.",
            "The incident led to road closures and the involvement of Bedfordshire Fire and Rescue.",
            "The borehole was temporarily capped, and efforts were made to permanently close it."
        ]
    },
    {
        "title": "NNPCL declares state of emergency on crude oil production ",
        "source": " Champion Newspapers",
        "keypoints": [
            "NNPC Ltd declared a state of emergency on Nigeria's crude oil production.",
            "The company aims to address challenges and increase production to two million barrels per day.",
            "Plans include replacing old pipelines, rig sharing, and investing in gas infrastructure.",
            "OPEC predicts a 23% rise in energy demand by 2045, emphasizing the need for significant investment in oil."
        ]
    },
    {
        "title": "Global Oil Prices Inched Down amid China's Slowing Economy ",
        "source": " Tempo.co English",
        "keypoints": [
            "Global oil prices fell due to concerns over China's slowing economy.",
            "China's economic growth in Q2 2024 was slower than forecasted, affecting oil demand.",
            "Fed chair Jerome Powell's comments on U.S. inflation hinted at potential lower interest rates, which could impact oil demand."
        ]
    },
    {
        "title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Chronicle",
        "source": "Tribune",
        "keypoints": [
            "Aethon Energy Management LLC (Aethon) successfully closed the acquisition of Tellurian's integrated upstream assets.",
            "Aethon's footprint now covers approximately 375,000 net acres in the Haynesville Shale.",
            "The acquisition includes gathering and treating capacity of over 3 Bcf/d, enhancing Aethon's operational capabilities."
        ]
    },
    {
        "title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost",
        "source": "NNPC Ltd",
        "keypoints": [
            "NNPC Ltd declared a state of emergency to increase Nigeria's crude oil production and grow reserves.",
            "The goal is to produce two million barrels of crude oil per day without deploying new rigs.",
            "NNPC Ltd plans to replace old crude oil pipelines and introduce a rig-sharing program to boost production.",
            "There is a call for industry collaboration to reduce production costs and improve efficiency.",
            "NNPC Ltd is investing in critical midstream gas infrastructure and compressed natural gas (CNG) initiatives."
        ]
    },
    {
        "title": "Crude oil falls after weak Chinese growth",
        "source": "London Loves Business",
        "keypoints": [
            "Weak Chinese economic data has led to a decline in crude oil prices.",
            "West Texas Intermediate (WTI) fell to $80.45 per barrel, and Brent crude declined to $83.80 per barrel.",
            "China recorded its weakest year-on-year growth in the second quarter, with actual growth at 4.7% versus the forecasted 5.1%.",
            "China's crude oil imports fell by 2.3% in the first half of the year due to lower-than-expected fuel demand.",
            "Despite weak Chinese demand, geopolitical factors have prevented more pronounced declines in oil prices."
        ]
    },
    {
        "title": "Foreign policy to emphasize Taiwan’s key role in global supply chains ",
        "source": " Taiwan News",
        "keypoints": [
            "Taiwan's Ministry of Foreign Affairs to focus on maintaining Taiwan's crucial role in global supply chains.",
            "A new economic diplomacy taskforce will be launched with Foreign Minister Lin Chia-lung as its head.",
            "International cooperation to be expanded as part of the core strategy.",
            "Setting up of industrial zones overseas is part of the plan, although the Ministry of Economic Affairs will be in charge of this project."
        ]
    },
    {
        "title": "Oil prices surge amid political uncertainty, geopolitical tensions ",
        "source": " MENAFN.COM",
        "keypoints": [
            "Oil prices increased due to geopolitical uncertainty in the US and Middle East.",
            "Brent crude futures rose by 0.2% to USD85.18 per barrel.",
            "US West Texas Intermediate crude also rose by 0.2% to USD82.41 per barrel.",
            "The attempted assassination of US presidential candidate Donald Trump contributed to market uncertainty.",
            "Geopolitical risks in the Middle East supported oil prices.",
            "Ongoing supply cuts by OPEC+ members, including Iraq's commitment to counter excess oil production from 2024, continue to bolster the market.",
            "Weak demand in China has led to a decline in oil prices last week.",
            "China's economic slowdown and reduced output by independent refiners due to narrow profit margins are contributing factors.",
            "Expectations for additional stimulus measures from Beijing to bolster domestic demand."
        ]
    },
    {
        "title": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes – Cores ",
        "source": " XM",
        "keypoints": [
            "Spain's crude oil imports increased by 23.5% year-on-year in May to 5.9 million tonnes.",
            "The source of the information is Cores, as reported by Reuters."
        ]
    },
    {
        "title": "2024 - Alberta | Oil company fined for exposing animals to toxins ",
        "source": "Actual News Magazine",
        "keypoints": [
            "Canadian Natural Resources (CNRL) fined $278,000 by Alberta Energy Regulator for wildlife exposure to toxins in tailings ponds.",
            "Incident led to death of 411 birds, with coyotes and wolves also affected.",
            "The company failed to prevent the formation of an island in the tailings pond, attracting wildlife.",
            "Mitigation measures were ineffective, but a fence was eventually installed to prevent further wildlife harm.",
            "The tailings ponds lie on a major bird migration route, posing ongoing risks despite preventative measures."
        ]
    },
    {
        "title": "Dangote Refinery: Crude oil supply options ",
        "source": "Blueprint Newspapers Limited",
        "keypoints": [
            "International oil companies (IOCs) in Nigeria have refused to sell crude oil to Dangote Refinery at market prices.",
            "Dangote has secured funding from international banks, proving the refinery's viability.",
            "Nigeria's federal government has been unable to compel IOCs to establish local refineries.",
            "NNPCL is seen as complicit with IOCs, prioritizing its interests over national refinery support.",
            "Dangote Refinery imports crude from the USA, impacting its cost competitiveness.",
            "NNPCL owes Dangote Refinery $1.7 billion in crude oil supply as part of its equity stake."
        ]
    },
    {
        "title": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 ",
        "source": "TV360",
        "keypoints": [
            "OPEC forecasts global oil demand to reach 116 million barrels per day by 2045.",
            "The world economy is expected to double in size, reaching $270 trillion by 2045.",
            "Urbanization and population growth (over 9.5 billion people by 2045) will drive demand.",
            "Significant investment ($14 trillion) needed in oil-related sectors to meet future demand.",
            "OPEC emphasizes the importance of securing investment to maintain supply security and avoid volatility.",
            "OPEC continues to advocate for fair climate finance and technology adaptation."
        ]
    },
    {
        "title": "Oil futures: Crude prices extend losses on economic, demand concerns ",
        "source": "Quantum Commodity Intelligence",
        "keypoints": [
            "Oil futures prices fell due to concerns over global economic growth.",
            "ICE Brent and NYMEX WTI futures saw declines amid prospects of a US rate cut.",
            "China's disappointing GDP figures and reduced oil throughput contributed to market pessimism.",
            "Geopolitical tensions, including Houthi attacks on oil tankers, added to market instability.",
            "The North Sea physical market also saw reduced trading prices for flagship Forties crude."
        ]
    },
    {
        "title": "China’s oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia — report",
        "source": "The North Africa Post",
        "keypoints": [
            "China's oil imports from Africa have significantly decreased, dropping from over a third to about one-tenth by 2022.",
            "The decline is attributed to geopolitical considerations, infrastructure issues, and domestic political problems in African countries.",
            "China has increased oil imports from Malaysia, UAE, Kazakhstan, and Kuwait between 2019 and 2023.",
            "Major African oil producers like Angola, South Sudan, Sudan, and Nigeria have seen sharp declines in exports to China.",
            "China is increasingly turning to more stable suppliers in the Gulf, Russia, and other Asian countries."
        ]
    },
    {
        "title": "Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026",
        "source": "Upstream Online",
        "keypoints": [
            "A Middle East company has secured multimillion-dollar rig deals.",
            "The company's drilling fleet is expected to expand to 148 rigs by 2026.",
            "The rigs will be constructed by China's Honghua Group.",
            "ADNOC Drilling is a key player involved in this expansion."
        ]
    },
    {
        "title": "Exclusive-Russia restoring oil refining capacity knocked out by drones",
        "source": "Yahoo News Australia",
        "keypoints": [
            "Russia is swiftly repairing oil refineries damaged by Ukrainian drone attacks, reducing idled capacity from 14% to 10%.",
            "Despite the drone attacks, there have been no successful hits on large Russian refineries since April 2.",
            "The repairs include major refineries like Rosneft-owned Ryazan and Kuibyshev.",
            "Total Russian primary oil refining capacity offline due to various issues is expected to reach 4.4 million tons in April, up from 4.1 million tons in March.",
            "The Biden administration has discouraged Ukraine from these attacks due to potential impacts on global energy markets."
        ]
    },
    {
        "title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil",
        "source": "Nairametrics",
        "keypoints": [
            "Dangote Refinery plans to source crude oil from African countries like Angola, Senegal, and Libya.",
            "The refinery recently imported crude oil from the US and Brazil.",
            "Nigeria's unavailability of crude forces Dangote Refinery to seek alternatives.",
            "Local refineries in Nigeria struggle to meet demands due to International Oil Companies preferring to sell crude abroad.",
            "Dangote Refinery aims to supply petrol to the local market by mid-July 2024."
        ]
    },
    {
        "title": "Oil Price Update – Oil Prices Hold Firm as Chinese Demand Concerns Rise ",
        "source": " MarketPulse",
        "keypoints": [
            "Oil prices remain stable despite turbulent conditions and a strong US dollar.",
            "Chinese economic data shows disappointing GDP growth and declining refinery output, raising concerns about oil demand.",
            "Technical analysis suggests potential for a triple bottom pattern in oil prices, with key support and resistance levels identified.",
            "Chinese GDP growth slowed to 0.7% q/q in Q2, down from 1.6% q/q in Q1.",
            "Chinese refinery output declined for the third consecutive month due to planned maintenance and weak fuel demand.",
            "Crude oil imports in China for June dropped 11%, and H1 imports were down 2.3% YoY.",
            "The Chinese share of global oil demand growth is declining to 40% this year from last year's 70%.",
            "Geopolitical concerns and summer driving season in the US may impact oil inventories and prices."
        ]
    },
    {
        "title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices ",
        "source": " World Pipelines",
        "keypoints": [
            "Strong market fundamentals are pushing oil prices higher, with four consecutive weeks of increases.",
            "Lower crude exports from OPEC and Russia are contributing to a tighter-than-expected market.",
            "Interest rate cuts by the Fed and high geopolitical risk premium are adding upward pressure on oil prices.",
            "Rystad Energy modelling attributes most price increases to bullish fundamentals, particularly on the refining and crude side.",
            "US oil production forecast has been lowered due to a downturn in Permian output.",
            "Brent prices increased by more than 6% in June, with July showing a similar trend.",
            "OPEC+ crude exports declined in June, indicating greater compliance by OPEC members.",
            "US inflation data shows easing, with potential rate cuts anticipated from the Federal Reserve."
        ]
    },
    {
        "title": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions ",
        "source": " Via News Agency",
        "keypoints": [
            "Natural Gas (NG) has seen a decline of 18.78% over the last 21 sessions.",
            "NG last reported volume is significantly below its average volume.",
            "Natural Gas's volatility has varied, with the highest amplitude of average volatility being 5.08% last month.",
            "According to the stochastic oscillator, NG is considered overbought.",
            "China's reduced LNG imports after price rises have impacted NG demand.",
            "A US judge lifted the ban on new export licenses for LNG, potentially affecting NG prices further."
        ]
    },
    {
        "title": "Oil prices tumble as demand worries in China ",
        "source": " Al Bawaba",
        "keypoints": [
            "Oil prices decreased due to weak economic data in China, causing demand concerns in the world's largest crude oil importer.",
            "Brent crude traded at $84.23 per barrel, a decline of 0.73% from the previous session.",
            "WTI traded at $80.22 per barrel, a 0.77% fall from the previous session.",
            "China's GDP growth in Q2 2024 was 4.7%, below market expectations.",
            "China's crude oil imports fell on both a monthly and annual basis in June.",
            "A stronger US dollar and concerns about the US Presidential election have impacted investor sentiment.",
            "Expectations of a US Federal Reserve interest rate cut may limit further oil price declines."
        ]
    },
    {
        "title": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says",
        "source": "Natural Gas World",
        "keypoints": [
            "Russian pipeline gas exports to the EU increased by 24% year-on-year in the first half of the year.",
            "The Gas Exporting Countries Forum (GECF) reported higher imports from Russia and Azerbaijan to the EU each month in 2024 compared to 2023.",
            "Russian pipeline gas exports to Europe had dropped to post-Soviet lows in 2022 due to geopolitical tensions, but have since rebounded.",
            "Gazprom's average daily natural gas supplies to Europe increased by almost 23% in June 2024 compared to the previous year.",
            "The future of Russian pipeline gas supplies is uncertain due to the upcoming expiration of the gas transit deal with Ukraine."
        ]
    },
    {
        "title": "NNPC Declares State of Emergency on Crude Oil Production",
        "source": "News Diary",
        "keypoints": [
            "NNPC Ltd has declared a state of emergency on crude oil production to address challenges in Nigeria's oil and gas industry.",
            "The goal is to increase Nigeria's crude oil production to two million barrels per day without deploying new rigs.",
            "NNPC Ltd plans to replace old crude oil pipelines and introduce a rig-sharing program to ensure production rigs remain in the country.",
            "The company is committed to investing in midstream gas infrastructure to boost domestic gas production and supply.",
            "NNPC Ltd is supporting the Presidential CNG drive and has built multiple CNG stations in collaboration with partners."
        ]
    },
    {
        "title": "India’s crude oil imports from Russia at 12-month high in June",
        "source": "BusinessLine",
        "keypoints": [
            "India's crude oil imports from Russia reached a 12-month high of 1.97 million barrels per day in June 2024.",
            "Imports from Russia increased by 15% month-on-month and 2% year-on-year.",
            "Public sector refiners imported 1.10 million barrels per day, while private refiners imported a record 871,200 barrels per day.",
            "The increase in imports from Russia was due to lower cargoes to China.",
            "Imports from traditional suppliers like Iraq and Saudi Arabia declined in June 2024.",
            "Crude oil imports from the US increased for the second consecutive month in June 2024."
        ]
    },
    {
        "title": "The interplay of inclusiveness, technology and sustainability in today’s turbulent trade finance landscape",
        "source": "Global Trade Review (GTR)",
        "keypoints": [
            "Geopolitical tensions and economic uncertainty are affecting trade volumes and financing in the Asia Pacific trade industry.",
            "There is a shift in procurement to Southeast Asia, Mexico, and India, reducing China's market share.",
            "High US dollar interest rates are impacting cross-border trade finance market, with companies turning to internal cash flows.",
            "SMEs face higher trade costs and have less access to financing, contributing to a global trade finance gap.",
            "Regulatory support and technological advancements are key to broadening access to financing solutions.",
            "Investments in infrastructure projects and the participation of mid-cap companies and SMEs are crucial for growth in Asian economies.",
            "Digital technologies and partnerships are helping to streamline trade transaction processing and provide financing solutions."
        ]
    }
]