[
    {
        "title": "Oil Prices Hold Firm as Chinese Demand Concerns Rise",
        "source": "MarketPulse",
        "keypoints": [
            "Oil prices remain stable despite a turbulent weekend and a strong US dollar.",
            "Disappointing Chinese economic data raises concerns about oil demand.",
            "Focus shifts from supply concerns in the US to demand worries in China.",
            "Technical analysis suggests potential for a triple bottom pattern in oil prices."
        ]
    },
    {
        "title": "Adnoc Gas awards $550mn EPC contracts for UAE gas pipe project",
        "source": "Unknown",
        "keypoints": [
            "ADNOC has awarded $550 million in EPC contracts for a UAE gas pipeline project.",
            "BP, Mitsui, Shell, and Total each to buy a 10% stake in ADNOC's Ruwais LNG project."
        ]
    },
    {
        "title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026",
        "source": "Quantum Commodity Intelligence",
        "keypoints": [
            "ADNOC is set to boost production from the giant offshore Zakum field starting in 2026.",
            "The expansion includes lifting Murban exports and increasing refining capacity at the Ruwais complex."
        ]
    },
    {
        "title": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG",
        "source": "The Whistler Newspaper",
        "keypoints": [
            "IPPG calls for a speedy resolution of IOCs divestment to unlock crude oil production in Nigeria.",
            "Divestment approval expected to restore global investor confidence in Nigeria.",
            "Nigeria's daily crude oil production has significantly dropped to about 1.3 million barrels per day.",
            "Timely approval of IOC divestment could boost production to 2.5 million barrels per day in the near term."
        ]
    },
    {
        "title": "India's crude oil imports from Russia touch 13-month high",
        "source": "DH Latest News",
        "keypoints": [
            "India's crude oil imports from Russia reached a 13-month high in June at 2.13 million barrels per day.",
            "Imports of Urals crude reached an all-time high of 1.6 million barrels per day.",
            "The share of US crude in India's oil imports increased by 75% to 371,000 barrels per day.",
            "Imports from Iraq and Saudi Arabia declined by 24% and 25% respectively."
        ]
    },
    {
        "title": "US natural gas pipeline ADCC begins commercial operations",
        "source": "Reuters",
        "keypoints": [
            "ADCC pipeline in South Texas started commercial service on July 1.",
            "The 40-mile pipeline has a capacity to transport about 1.7 billion cubic feet per day (bcfd) of natural gas.",
            "ADCC is owned 70% by Whistler Pipeline and 30% by a subsidiary of Cheniere.",
            "The U.S. is forecast to export a record 12.2 bcfd of natural gas this year."
        ]
    },
    {
        "title": "Bedford gas leak after drilling company hits natural gas pocket",
        "source": "BBC",
        "keypoints": [
            "A gas leak occurred in a residential area after a drilling company hit a natural gas pocket.",
            "Bedfordshire Fire and Rescue have been at the scene and warned nearby road closures could remain in place.",
            "The borehole has been temporarily capped to control the flow of gas."
        ]
    },
    {
        "title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts",
        "source": "NGI",
        "keypoints": [
            "August Nymex natural gas futures fell below key support.",
            "Lower 48 gas production rose to 102 Bcf/d, the highest level since March.",
            "The August contract started to trade below $2.500/MMBtu.",
            "U.S. LNG feed gas demand climbed to about 12.9 Bcf/d.",
            "NGI modeling estimates a 29 Bcf injection into Lower 48 storage for the week ending June 28."
        ]
    },
    {
        "title": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says",
        "source": "Reuters",
        "keypoints": [
            "Egypt's gas production is currently at 5.7 billion cubic feet per day.",
            "21 liquefied natural gas cargos are to arrive in Egypt during the summer.",
            "Egypt needs to import around $1.18 billion worth of natural gas and mazut fuel oil to end persistent power cuts."
        ]
    },
    {
        "title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand",
        "source": "NGI",
        "keypoints": [
            "August Nymex natural gas futures attempted to break a six-day losing streak but settled slightly negative.",
            "U.S. Energy Information Administration (EIA) storage print failed to inspire.",
            "Natural gas futures stumbled amid steady production levels and expectations for lighter mid-July demand."
        ]
    },
    {
        "title": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions",
        "source": "VIANEWS",
        "keypoints": [
            "Natural Gas (NG) has been up by 18.78% for the last 21 sessions.",
            "Natural gas sinks to pivotal level as China's demand slumps.",
            "A US judge in Louisiana issued a ruling to lift the current ban on new export licenses for Liquified Natural Gas (LNG)."
        ]
    },
    {
        "title": "Dangote Refinery to Import First Shipment of Brazilian Crude Oil",
        "source": "The Naija247news",
        "keypoints": [
            "Nigeria's Dangote refinery is set to receive its first shipment of Brazilian crude oil.",
            "The refinery is importing a one-million-barrel cargo of Brazil's Tupi crude.",
            "The Dangote refinery aims to enhance energy security and reduce import dependency."
        ]
    },
    {
        "title": "Williams project clears legal hurdle for Louisiana natural gas pipeline crossings",
        "source": "Natural Gas Intelligence",
        "keypoints": [
            "A Louisiana court ruled in favor of Williams in a dispute with Energy Transfer LP over natural gas pipeline crossings.",
            "This ruling clears an obstacle for the Louisiana Energy Gateway (LEG) system, which aims to supply LNG export terminals.",
            "Energy Transfer LP has been accused of attempting to block competitors from transporting natural gas from the Haynesville Shale."
        ]
    },
    {
        "title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets",
        "source": "Business Wire",
        "keypoints": [
            "Aethon Energy Management LLC successfully acquired Tellurian's integrated upstream and midstream assets in the Haynesville Shale.",
            "Aethon now controls approximately 375,000 net acres with a gathering and treating capacity of over 3 Bcf/d.",
            "Aethon signed a Heads of Agreement (HOA) to secure 2 metric tons per annum (mtpa) of LNG from the Driftwood LNG project.",
            "The partnership aims to provide net zero natural gas and support energy security during the global energy transition."
        ]
    },
    {
        "title": "US natural gas prices fall",
        "source": "Business Recorder",
        "keypoints": [
            "US natural gas futures remained near a seven-week low due to a mix of bullish and bearish market factors.",
            "A heat wave is expected to increase gas consumption for electricity generation.",
            "Recent storage builds have been smaller than usual, but gas output has risen in July.",
            "Next-day gas prices at the Waha hub in West Texas fell into negative territory multiple times due to pipeline constraints.",
            "Analysts forecast a smaller-than-usual storage build, leaving about 19% more gas in storage than normal for this time of year."
        ]
    },
    {
        "title": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels",
        "source": "Natural Gas Intelligence",
        "keypoints": [
            "Mexico's natural gas production increased to 3.85 Bcf/d in May from 3.76 Bcf/d in April but was down 11% year/year.",
            "Pemex accounted for 95% of total gas output, with the top five gas-producing fields all operated by Pemex.",
            "The International Energy Agency forecasts a major decline in Mexico's oil supply from 2024 to 2030 due to underinvestment.",
            "President-elect Claudia Sheinbaum intends to continue policies favoring Pemex's role in exploration and production.",
            "Gas imports from the US accounted for 72% of Mexico's total gas supply in 2024, highlighting reliance on US imports."
        ]
    },
    {
        "title": "EIA reports surge in Iraqi oil exports to the US",
        "source": "Shafaq News",
        "keypoints": [
            "Iraqi oil exports to the US increased to 217,000 barrels per day (bpd) last week, up from the previous week's 195,000 bpd.",
            "The average US crude oil imports from nine key countries reached 5.635 million bpd last week.",
            "Canada led US oil imports with 3.889 million bpd, followed by Mexico with 417,000 bpd and Saudi Arabia with 239,000 bpd."
        ]
    },
    {
        "title": "Oil prices tumble as demand worries in China",
        "source": "Al Bawaba",
        "keypoints": [
            "Oil prices fell due to weak economic data from China, indicating a slowing economy and reduced demand.",
            "Brent crude traded at $84.23 per barrel, down 0.73%, while West Texas Intermediate traded at $80.22 per barrel, down 0.77%.",
            "China's GDP growth in Q2 2024 was 4.7%, below market expectations of 5.1%.",
            "June crude oil imports by China fell on both a monthly and annual basis.",
            "The rising US dollar has also contributed to the decline in oil prices."
        ]
    },
    {
        "title": "Waha Hub focus of area natural gas industry",
        "source": "Odessa American",
        "keypoints": [
            "Waha Hub is crucial for Permian Basin's natural gas industry and global trading.",
            "High levels of production and insufficient takeaway infrastructure depress natural gas prices.",
            "Negative gas prices at Waha Hub due to low demand and storage disruptions.",
            "U.S. natural gas storage surplus has been declining, indicating improving market conditions.",
            "New pipelines are necessary to handle production growth and market access."
        ]
    },
    {
        "title": "Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline",
        "source": "Nairametrics",
        "keypoints": [
            "Dangote refinery ramping up gasoil exports to West Africa, affecting European refiners.",
            "Production of lower grade gasoil while awaiting cleaner fuel units.",
            "Significant reduction in European and Russian gasoil exports to West Africa.",
            "Potential for Dangote refinery to reduce Africa's $17 billion oil imports.",
            "West Africa became the largest recipient of Europe’s gasoline exports in 2023."
        ]
    },
    {
        "title": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot",
        "source": "Natural Gas Intelligence",
        "keypoints": [
            "August natural gas futures declined amid a bearish EIA storage report.",
            "Freeport LNG's slow restart post-Hurricane Beryl impacted market sentiment.",
            "Market dynamics influenced by weather forecasts and storage levels.",
            "Hedge funds holding net long positions in Henry Hub futures, reversing previous bearish positions."
        ]
    },
    {
        "title": "US natural gas prices ease",
        "source": "Business Recorder",
        "keypoints": [
            "US natural gas futures fell due to lower LNG feedgas and oversupply.",
            "Federal judge blocked Biden administration’s pause on LNG export applications.",
            "Waha hub prices turned negative due to pipeline constraints in the Permian Shale.",
            "Hurricane Beryl predicted to impact Jamaica and Mexico’s Yucatan Peninsula."
        ]
    },
    {
        "title": "Crude oil falls after weak Chinese growth",
        "source": "London Business News | Londonlovesbusiness.com",
        "keypoints": [
            "Crude oil prices fell due to weak Chinese economic data.",
            "China’s year-on-year growth was lower than expected, causing investor concern.",
            "China’s crude oil imports decreased by 2.3% in the first half of the year.",
            "Geopolitical factors in the US and Middle East limited the decline in oil prices."
        ]
    },
    {
        "title": "China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report",
        "source": "The North Africa Post",
        "keypoints": [
            "China's oil imports from Africa have significantly declined from over a third to about one-tenth by 2022.",
            "Major African oil suppliers like Angola, South Sudan, Sudan, and Nigeria have seen sharp declines in exports to China.",
            "China has increased its oil imports from Malaysia, UAE, Kazakhstan, and Kuwait.",
            "Geopolitical considerations, infrastructure issues, and domestic political problems in African countries are contributing factors.",
            "China is turning to more predictable suppliers in the Gulf, Russia, and other Asian countries."
        ]
    },
    {
        "title": "Katy Daily Natural Gas Price Snapshot",
        "source": "Katy Daily",
        "keypoints": [
            "Snapshot of daily natural gas prices at various hubs across the U.S.",
            "Prices show a general decline across most hubs.",
            "Notable price drops in El Paso, Waha Pool (-0.505), and SoCal Border Avg. (-0.25).",
            "Henry Hub price decreased by -0.115.",
            "Natural gas futures are impacted by production levels and market demand."
        ]
    },
    {
        "title": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong",
        "source": "Economica",
        "keypoints": [
            "The report provides comprehensive insights into the drilling engineering and technical services market from 2024 to 2031.",
            "Focus on market trends, pricing, geographical regions, technology, and supply-demand dynamics.",
            "Includes SWOT analysis, investment feasibility, and return analysis.",
            "Segmented by type (offshore/onshore drilling) and application (oil, natural gas, others).",
            "Major players include Jereh Oilfield Services Group, ZPEC, Sinopec, CNOOC, Schlumberger, Halliburton, Baker Hughes."
        ]
    },
    {
        "title": "Rystad Energy: Bullish market fundamentals are the main contributing factor to higher global oil prices",
        "source": "World Pipelines",
        "keypoints": [
            "Strong market fundamentals are pushing oil prices higher.",
            "Lower crude exports from OPEC and Russia contribute to a tighter market.",
            "Expectations of interest rate cuts by the U.S. Federal Reserve are adding to upward price pressure.",
            "Rystad Energy has lowered its forecast for U.S. oil production from August 2024 onwards.",
            "Ongoing geopolitical risks in the Middle East and Ukraine also influence prices."
        ]
    },
    {
        "title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost",
        "source": "NNPC Ltd",
        "keypoints": [
            "NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.",
            "Aim to increase crude oil production to two million barrels per day without new rigs.",
            "Challenges include delays in procurement processes and the need for collaboration to reduce production costs.",
            "Plans to replace old crude oil pipelines and introduce a rig sharing program.",
            "Investment in critical midstream gas infrastructure to boost domestic gas production."
        ]
    },
    {
        "title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory",
        "source": "NGI",
        "keypoints": [
            "August natural gas futures fell below technical support levels, indicating a lack of bullish market appetite.",
            "Nymex contract settled at $2.478/MMBtu, down 12.3 cents from the day before.",
            "Market influenced by steady production levels and lighter mid-July demand expectations.",
            "Analysts cite key support level breach as a significant market indicator.",
            "Natural gas prices affected by production, storage levels, and demand forecasts."
        ]
    },
    {
        "title": "Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says",
        "source": "Reuters",
        "keypoints": [
            "Russian natural gas exports to the European Union via pipelines increased by 24% in the first half of the year compared to the same period in 2023.",
            "The Gas Exporting Countries Forum (GECF) reported the increase without providing specific volumes.",
            "Pipeline gas imports by the EU from Russia and Azerbaijan have been higher each month in 2024 compared to 2023.",
            "Russian pipeline gas exports hit post-Soviet lows last year due to strained relations with the West.",
            "Russia's gas transit deal with Ukraine is set to expire after December 31, with uncertainties about its renewal."
        ]
    },
    {
        "title": "Oil prices surge amid political uncertainty, geopolitical tensions",
        "source": "MENAFN",
        "keypoints": [
            "Oil prices saw a modest increase due to geopolitical uncertainties in the United States and the Middle East.",
            "Brent crude futures rose to USD85.18 per barrel, while U.S. West Texas Intermediate crude increased to USD82.41 per barrel.",
            "The attempted assassination of U.S. presidential candidate Donald Trump contributed to market uncertainty.",
            "Geopolitical risks in the Middle East and ongoing supply cuts by OPEC+ members supported oil prices.",
            "Despite the increase, oil prices faced downward pressure due to weak demand in China and economic slowdown."
        ]
    },
    {
        "title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot",
        "source": "NGI",
        "keypoints": [
            "August natural gas futures declined for the sixth straight session due to cooler weather forecasts and weaker cash prices.",
            "August Nymex natural gas futures dropped to $2.439/MMBtu.",
            "Federal court ordered the U.S. Department of Energy to lift LNG permit pause, affecting the market.",
            "Natural gas futures were influenced by the slow restart of Freeport LNG and heavy EIA print.",
            "Western heat buoyed cash prices despite overall declining futures."
        ]
    },
    {
        "title": "US natgas prices ease to 6-week low on rising output, lower LNG feedgas",
        "source": "Reuters",
        "keypoints": [
            "U.S. natural gas futures fell to a six-week low due to rising output and lower LNG feedgas.",
            "August delivery gas futures on the New York Mercantile Exchange dropped to $2.454 per mmBtu.",
            "Gas flows to U.S. LNG export plants decreased due to lower feedgas at Cheniere Energy's Sabine Pass.",
            "Gas output in the Lower 48 U.S. states rose in July, contributing to oversupply.",
            "Extreme weather, such as Hurricane Beryl, also impacted the market dynamics."
        ]
    },
    {
        "title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance",
        "source": "Shafaq News",
        "keypoints": [
            "OPEC's crude oil production held steady for the third consecutive month due to non-compliance by Iraq and the UAE.",
            "OPEC produced an average of 26.98 million barrels per day in June, a slight decrease from the previous month.",
            "Iraq and the UAE did not fully comply with the agreed production cuts.",
            "Iraq's production still exceeded its quota by approximately 250,000 barrels per day.",
            "Efforts to enhance compliance with production cuts have shown limited results."
        ]
    },
    {
        "title": "Dangote Refinery to source crude oil from other African countries after imports from US, Brazil",
        "source": "Nairametrics",
        "keypoints": [
            "Dangote Refinery plans to source crude oil from other African countries following recent imports from the US and Brazil.",
            "The refinery expects feedstock from the US and Brazil in the coming months.",
            "Discussions are ongoing to secure crude from African countries like Angola, Senegal, and Libya.",
            "The refinery aims to reduce Nigeria's dependence on imported petroleum products.",
            "The unavailability of crude in Nigeria has forced Dangote to seek alternatives from other countries."
        ]
    },
    {
        "title": "ADCC natural gas pipeline in Texas enters commercial service",
        "source": "Daily Energy Insider",
        "keypoints": [
            "ADCC Pipeline in Texas began commercial service on July 1, 2024.",
            "The pipeline spans 40 miles and connects Whistler Pipeline's Agua Dulce Header to Cheniere's Corpus Christi Liquefaction facility in Texas.",
            "It has a capacity of approximately 1.7 Bcf/d, enhancing natural gas transportation in Texas.",
            "Provides direct access to Permian and Eagle Ford volumes and supports U.S. LNG exports to global markets.",
            "Owned 70% by Whistler Pipeline LLC (a joint venture between WhiteWater, MPLX LP, and Enbridge) and 30% by a subsidiary of Cheniere Energy.",
            "Whistler Pipeline is a 450-mile pipeline transporting natural gas from the Waha Header in the Permian Basin to Agua Dulce, Texas with connectivity to the Midland Basin."
        ]
    },
    {
        "title": "ICE Low Sulphur Gasoil markets hit series of OI records",
        "source": "FX News Group",
        "keypoints": [
            "ICE Low Sulphur Gasoil markets achieved a series of open interest records through June 2024, reaching 1.2 million across futures and options on July 1, 2024.",
            "This corresponds to 120 million metric tons, making it a central benchmark for refined oil products in middle distillates trading.",
            "Open interest in Gasoil futures and options increased over 40% year-over-year, with trading volumes up 30% year-over-year.",
            "Gasoil options activity saw record levels, with 234,570 contracts in open interest on July 3 and 287,421 options traded in Q2 2024.",
            "In Q2 2024, approximately 16.2 million oil options contracts were traded at ICE, including a record 13.5 million Brent options contracts.",
            "ICE Gasoil is a physically deliverable futures contract for ultra-low sulphur diesel, with an average of over 100,000 tons entering the delivery process each month since the start of 2024.",
            "ICE's global crude and refined product complex includes benchmarks like Brent crude, ICE Midland WTI, ICE WTI (Cushing), ICE Dubai (Platts), ICE Murban, NY Harbor RBOB Gasoline, and Heating Oil.",
            "Open interest in ICE's global oil complex is up over 20%, totaling 14 million contracts."
        ]
    },
    {
        "title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises",
        "source": "Daily Gas Price Index",
        "keypoints": [
            "Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures.",
            "Weather forecasts suggest a softening in heat for later in July amid storm concerns.",
            "Production levels have reached a three-month high.",
            "Natural gas futures slumped in early trading due to steady production levels and moderated heat forecasts.",
            "Energy executives forecast a $3 Henry Hub price by early 2025.",
            "Short-covering was cited as a reason for a temporary climb in natural gas prices.",
            "Forward prices falter due to strong production, hefty supplies in storage, and demand-thwarting conditions."
        ]
    },
    {
        "title": "Dangote Refinery: Crude oil supply options",
        "source": "Blueprint Newspapers Limited",
        "keypoints": [
            "International Oil Companies (IOCs) have historically resisted establishing refineries in Nigeria, citing government price controls on refined products.",
            "Aliko Dangote and international development banks secured around $9 billion to establish the Dangote Refinery, proving the viability of refining in Nigeria.",
            "The Dangote Refinery, one of the world's largest, started operations in January 2024 but faces challenges as IOCs refuse to sell crude oil at competitive prices.",
            "Dangote has had to import crude oil from the USA, despite Nigeria being Africa’s largest producer.",
            "High sulfur diesels are imported from Europe at a lower cost than diesel from Dangote Refinery, affecting local market dynamics.",
            "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) allows diesel imports but does not support local refinery supply.",
            "The Nigerian National Petroleum Company Limited (NNPCL) could theoretically supply crude to Dangote Refinery but is entangled in the petrol subsidy system, which it profits from.",
            "NNPCL owes Dangote Refinery $1.7 billion for equity and could pay this through crude oil supply, which would benefit Nigeria’s economy and reduce plastic production costs."
        ]
    },
    {
        "title": "NNPCL declares state of emergency on crude oil production",
        "source": "Champion Newspapers Limited",
        "keypoints": [
            "NNPC Ltd has declared a state of emergency on crude oil production in Nigeria to address challenges and improve production efficiency.",
            "Group Chief Executive Officer Mele Kyari emphasized the need to overcome delays in procurement and other production impediments.",
            "NNPC Ltd aims to replace old crude oil pipelines and introduce a rig sharing program to boost production.",
            "The company is committed to investing in midstream gas infrastructure to enhance domestic gas production and supply.",
            "Nigeria's oil production currently lags behind OPEC quotas, with a capacity to produce 2 million barrels per day without new rigs.",
            "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) and Independent Petroleum Producers Group (IPPG) express concerns over delays in IOC divestment transactions.",
            "OPEC forecasts a 23% increase in global energy demand by 2045, driven by economic growth and urbanization, with oil remaining a major energy source.",
            "OPEC emphasizes the need for significant investment in the oil industry to meet future energy demands, estimating $14 trillion in investment requirements from 2024 to 2045."
        ]
    },
    {
        "title": "Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes",
        "source": "Cores via Reuters",
        "keypoints": [
            "Spain's crude oil imports in May 2024 rose by 23.5% year-over-year, totaling 5.9 million tonnes.",
            "This increase in imports reflects a significant rise in crude oil demand within Spain.",
            "Cores provided the data, highlighting the shifts in crude oil import patterns."
        ]
    }
]