"India's Nayara Energy offers rare vacuum gasoil cargo Home Infrastructure Energy OIL & GAS India's Nayara Energy offers rare vacuum gasoil cargo Share OIL & GAS India's Nayara Energy offers rare vacuum gasoil cargo 15 Jul 2024 1 Min Read CW Team According to market sources, it was reported that Indian private refiner Nayara Energy had issued a rare tender offering vacuum gasoil (VGO) for loading in September. The refiner reportedly offered approximately 70,000 metric tons of VGO with a maximum 3% sulphur content. The VGO was scheduled to load from Vadinar port in the western Indian state of Gujarat between September 1 and 10. The sources mentioned that Nayara Energy typically refrains from commenting on commercial deals. VGO, a residual fuel produced after petroleum distillation, can serve as a feedstock for manufacturing transportation fuels in refining processes. Based on ship-tracking data from Kpler and LSEG, it was noted that the company had last exported a VGO cargo in December 2022, a period coinciding with maintenance activities at its Vadinar refinery. Nayara EnergyOilGasvacuum gasoil (VGO) According to market sources, it was reported that Indian private refiner Nayara Energy had issued a rare tender offering vacuum gasoil (VGO) for loading in September. The refiner reportedly offered approximately 70,000 metric tons of VGO with a maximum 3% sulphur content. The VGO was scheduled to load from Vadinar port in the western Indian state of Gujarat between September 1 and 10. The sources mentioned that Nayara Energy typically refrains from commenting on commercial deals. VGO, a residual fuel produced after petroleum distillation, can serve as a feedstock for manufacturing transportation fuels in refining processes. Based on ship-tracking data from Kpler and LSEG, it was noted that the company had last exported a VGO cargo in December 2022, a period coinciding with maintenance activities at its Vadinar refinery. Next Story Real Estate 16 Jul 2024 CBRE appoints Michael Young as Managing Director CBRE Middle East, the global leader in commercial real estate advisory services, announces the appointment of Michael Young to lead the company?s operations in the Middle East and North Africa as the Managing Director, effective 1st of July 2024. Anshuman Magazine, Chairman & CEO for India, Southeast Asia, Middle East & Africa commented: \"I am delighted to welcome Michael Young as the new Managing Director for CBRE across the MENA region. Michael is a leader with a proven track record of delivering exceptional results, fostering a culture of innovation, collaboration, and excellence across th.. Read More Next Story Infrastructure Urban 16 Jul 2024 Walplast launches new campaign for retail brand HomeSure Walplast Products, a distinguished leader in building materials production and the third-largest manufacturer of Wall Putty in India, proudly announces the launch of its new campaign for the retail brand HomeSure. The campaign amplifies robust growth within the HomeSure portfolio, which encompasses a comprehensive range of construction materials and solutions including HomeSure Wall Putty, HomeSure TileEx (Tile Adhesives), HomeSure GypEx (Gypsum-based products), HomeSure wShield (Construction Chemicals, Admixtures), HomeSure WallEx (AAC blocks, Spray Plaster, Block Jointing Mortar), HomeSure M.. Read More Next Story Real Estate 16 Jul 2024 Vestian: 65% of office space in India is green-certified Accessing any real estate company?s performance based on ESG becomes crucial as the real estate sector is the second largest employer in India, accounting for 39% of carbon emissions. The government?s constant push to achieve net zero emissions by 2070 is likely to play a pivotal role in shaping the real estate market in India. As per Vestian Research, over 65% of Grade A office space across India's top 7 cities is green-certified. Moreover, among 1,362 Grade A buildings, 805 (or 59%) boast of green certifications, highlighting India's growing commitment to sustainable construction. As India.. Read More Opinion Poll Question : Which technological advancement do you believe will most transform the real estate industry in the coming years? Virtual Reality and 3D Property Tours Smart Home and Building Automation Blockchain for Property Transactions Big Data and Predictive Analytics for Market Insights Augmented Reality for Property Staging and Design Drone Technology for Aerial Photography and Site Analysis Live Results : Virtual Reality and 3D Property Tours Smart Home and Building Automation Blockchain for Property Transactions Big Data and Predictive Analytics for Market Insights Augmented Reality for Property Staging and Design Drone Technology for Aerial Photography and Site Analysis Latest updates Real Estate 16 Jul 2024 CBRE appoints Michael Young as Managing Director ECONOMY & POLICY 16 Jul 2024 Walplast launches new campaign for retail brand HomeSure Real Estate 16 Jul 2024 Vestian: 65% of office space in India is green-certified Technology 16 Jul 2024 Cummins India launches global competency centre in Pune Equipment 16 Jul 2024 Hyundai enters the dozer market with the HD100 Real Estate 16 Jul 2024 Hindalco Sells Land to Ekamaya Properties Technology 16 Jul 2024 India's Data Center Capacity to Surge POWER & RENEWABLE ENERGY 16 Jul 2024 Sumant Sinha Appointed Global Climate Co-Chair Follow us on Hi There! \"Now get regular updates from CW Magazine on WhatsApp! Join the CW WhatsApp channel for the latest news, industry events, expert insights, and project updates from the construction and infrastructure industry. Click the link below to join\" +91 81086 03000 Join us Telegram Modal Heading x First Name * Last Name * Industry * ---Choose--- Architect Builder Developer Equipment Steel Cement Paints Chemicals Consultant Contractor Buider Contractor Manufracturer Material supplier(for any other mentioned above) Financier Government Academic Institution Other Email Address * Mobile Number * Password * Confirm Password * By creating an account, you agree to our Terms and Conditions and have read and acknowledge the Privacy Policy Register Already have an account? Login Or Email Address * Password * Forgot Password? Login Don't have an account? Register Please enter the details ---Choose--- Architect Builder Developer Equipment Steel Cement Paints Chemicals Consultant Contractor Buider Contractor Manufracturer Material supplier(for any other mentioned above) Financier Government Academic Institution Other Update Email Address Submit Back x Stay Updated on India's Construction Economy x Schedule a Call Back Call us now at +91 8108603000 Submit x x Stay updated On the latest construction news through our weekly newsletter Thank you for subscribe our newsletter Email subscribe! x subscribe to the newsletter Don't miss out on valuable insights and opportunities to connect with like minded professionals I have read and understood the privacy and cookies policy and agree to receive newsletters from Construction World by email x @ RS. 19 (Single article access) @ RS. 49 (One day full access) Pay Now"