[
  {
    "Title": "[Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC ... - economica.ma",
    "Link": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2Vjb25vbWljYS5tYS9uZXdzL3VwZGF0ZWQtZHJpbGxpbmctZW5naW5lZXJpbmctYW5kLXRlY2huaWNhbC1zZXJ2aWNlcy1tYXJrZXQtc2l6ZS1hbmFseXNpcy1qZXJlaC1vaWxmaWVsZC1zZXJ2aWNlcy1ncm91cC16cGVjLXJ1dG9uZy8zNzAzNS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:02:37 GMT",
    "Categories": [
      "Market Trends",
      "Exploration"
    ],
    "Content": "       [Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong - Economica                           Skip to content       Monday, July 15th, 2024     Home Contactez Nous Politique de confidentialite                  News      [Updated] Drilling Engineering and Technical Services Market Size Analysis | Jereh Oilfield Services Group, ZPEC, Rutong                   Ron Curren  0 Comments 3 July 2024      Press Release, July, 2024 (Orbis Research) - The 2024 Global Drilling Engineering and Technical Services Market report focuses on comprehensive industry insights and intelligence alongside prevailing and anticipated market trends from 2024 to 2031. It also conducts an exhaustive examination encompassing pricing, current geographical regions, technology, and supply and demand dynamics, potentially impacting the growth trajectory of the trade market. Commencing with an introduction to market fundamentals such as definitions, classifications, applications, and an industry chain overview, the study proceeds to delineate product specifications, business strategies, and policies, followed by illustrations of cost structures, manufacturing processes, and the like.  Subsequently, it scrutinizes market conditions across major global regions, encompassing factors like product costs, profitability, potential, manufacturing efficiency, asset utilization, supply and demand equilibrium, and industry growth rates, among others. Concluding with a project-based SWOT analysis, investment feasibility assessment, and investment return analysis, the report offers comprehensive recommendations.    Request a sample report @ https://www.orbisresearch.com/contacts/request-sample/7279388    The primary objective of the Global Drilling Engineering and Technical Services Industry Study is to facilitate sustainable growth for clients by furnishing them with a thorough analysis enabling comprehension of the market's economic potential. Through a five forces analysis of the global Drilling Engineering and Technical Services market, insights into competitive dynamics are provided. This analysis assesses the bargaining power of consumers and suppliers, the threat of new entrants and substitute products, and the intensity of rivalry within the market, aiding market participants in comprehending the competitive landscape and making informed business decisions.  The prognosis of the Drilling Engineering and Technical Services report is outlined as follows: Initiating with a market overview, it proceeds to examine industry advancement proposals. The Worldwide Industry 2020 study, a comprehensive and professional endeavor, disseminates market research data pertinent to both new entrants and established players, analyzing strategic planning of sector-involved entities. Additionally, it identifies SWOT analyses, revenue breakdowns, and company overviews of major market players. Trading activity projections over the next five years might depict an upward trajectory, offering insights into the future landscape for various players engaged in goods or services promotion, while considering the market's profit dynamics. Furthermore, the report conducts an evaluation and detailed interpretation potentially enticing consumers to acquire a significant share of the global industry.   Drilling Engineering and Technical Services market Segmentation by Type:  Offshore Drilling Onshore Drilling   Drilling Engineering and Technical Services market Segmentation by Application:  Oil Natural Gas Other  Direct Purchase the report @ https://www.orbisresearch.com/contact/purchase-single-user/7279388  Effectively segmented into top manufacturers, geographical regions, product categories, and applications, the global Drilling Engineering and Technical Services market analysis provides in-depth insights for each category, accompanied by size forecasts for the global market and each class. Moreover, it offers a comprehensive examination of numerous industry segments, including opportunities and positioning of top players. Investors can discern actual demand for specific sectors through category-wise analyses.   Numerous prominent market contenders vie within the global Drilling Engineering and Technical Services market. To attain a competitive edge, these entities employ strategies such as product innovation, strategic partnerships, acquisitions, and investments in research and development. Furthermore, they dedicate significant efforts to expanding their customer base, solidifying market positions, and delivering tailored solutions to meet individual customer needs.   Key Players in the Drilling Engineering and Technical Services market:  Jereh Oilfield Services Group ZPEC Rutong Sinopec CNOOC Anton Oilfield Services Group Schlumberger Haliburton Baker Hughes Renzhi Petrolor Sinogeo  The objective of this report is to furnish readers with a comprehensive understanding of the global Drilling Engineering and Technical Services market, encompassing key market players, growth projections, market trends, opportunities, threats, and competitive analyses. Offering insightful assessments and valuable data, this report serves to inform business strategies, financial decisions, and market entry or expansion plans.   Do You Have Any Query Or Specific Requirement? Ask to Our Industry Expert @ https://www.orbisresearch.com/contacts/enquiry-before-buying/7279388   Aids of the Global Economy Study Drilling Engineering and Technical Services:   * This study offers a comprehensive examination of current trends and future predictions, elucidating factors influencing and hindering market expansion. An in-depth industry analysis based on product type and application aids in understanding globally favored products, followed by an assessment of supplier and buyer potency. Focusing on key product orders and monitoring top rivals within the market framework completes a thorough market analysis. * The study includes financial analyses, market-winning strategies, new developments, and product offerings for major vendors in the global market. It can be instrumental for vendors, affiliated business partners, and system integrators in identifying critical investment regions and formulating strategies.   About Us  Orbis Research (orbisresearch.com) is a single point aid for all your market research requirements. We have a vast database of reports from leading publishers and authors across the globe. We specialize in delivering customized reports as per the requirements of our clients. We have complete information about our publishers and hence are sure about the accuracy of the industries and verticals of their specialization. This helps our clients to map their needs and we produce the perfect required market research study for our clients. Hector Costello Senior Manager - Client Engagements 4144N Central Expressway, Suite 600, Dallas,             Previous Post    [Trends ] Agricultural Product Processing Market Growth Drivers | COFCO, Beidahuang, Shounong Food Group        Next Post    Offshore Drilling Engineering Services Market Latest Trends &Innovations | Transocean, Petroleos De Venezuela, COSL                About the author Ron Curren            Search Search Articles recents SFP And QSFP Market Growth Factors & Key Statistics Retail Banking Software Market Size Analysis| Finastra, Temenos, Nucleus Software Planar Waveguide Coupling System Market Top Trends and 2031 Outlook PLC Coupling System Market Global and Regional Analysis Electronic Design Automation (EDA) Software Market Future Analysis | Cadence Design Systems, Inc., Synopsis  Commentaires recents No comments to show. Archives  July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 August 2023 July 2023 March 2023 February 2023 December 2022 November 2022 October 2022 September 2022 May 2022 April 2022 March 2022 February 2022  Categories  Agriculture  Eco  International  News  Non classe  Urbanisme  Worldwide            ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Norway's high rate of exploration continues with fresh approvals for new wells - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy51cHN0cmVhbW9ubGluZS5jb20vZXhwbG9yYXRpb24vbm9yd2F5cy1oaWdoLXJhdGUtb2YtZXhwbG9yYXRpb24tY29udGludWVzLXdpdGgtZnJlc2gtYXBwcm92YWxzLWZvci1uZXctd2VsbHMvMi0xLTE2NzI0MzTSAQA?oc=5",
    "Published": "Thu, 04 Jul 2024 07:19:41 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Norway's high rate of exploration continues with fresh approvals for new wells | Upstream                                                                                                                               Exploration Norway's high rate of exploration continues with fresh approvals for new wells Country on target for nearly 40 exploration wells this yearNorwegian Offshore Directorate director general Torgeir Stordal.Photo: NOD Russell Searancke Norway CorrespondentOslo   NorwayEquinorAker BPEuropeWestern Europe Published 4 July 2024, 07:16Updated 4 July 2024, 08:40  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New ... - Newsfile",
    "Link": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL3d3dy5uZXdzZmlsZWNvcnAuY29tL3JlbGVhc2UvMjE1Mjc1L05pY29sYS1NaW5pbmctQW5ub3VuY2VzLUNvbXBsZXRpb24tb2YtM0QtSVAtU3VydmV5LWFuZC1Db21tZW5jZW1lbnQtb2YtRXhwbG9yYXRpb24tRHJpbGxpbmctYXQtdGhlLU5ldy1DcmFpZ21vbnQtQ29wcGVyLVByb2plY3TSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 13:00:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "       Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project                                              Cookie Settings  We use cookies to analyze user behavior in order to constantly improve the website for you. Learn more. Accept All Accept Selection Reject All   Necessary Analytics              Login    Search       Search       en fr de es                   Vancouver, British Columbia--(Newsfile Corp. - July 3, 2024) -  Nicola Mining Inc. (TSXV: NIM)  (the \" Company \" or \" Nicola \") is pleased to announce the completion of a 3D induced polarization survey (\" 3D IP Survey \"). Based on 3D IP Survey results the Company is in the process of commencing of its 2024 diamond drilling program (\" Program \") at the New Craigmont Copper Project (\" New Craigmont \"), situated approximately 11 kilometres from Merritt, BC and adjacent to Teck Resources Ltd.'s Highland Valley Copper, Canada's largest open-pit copper mine.As previously announced in the Company's Feb. 21, 2024 and May 13, 2024 news releases, Nicola engaged Dias Geophysical of Saskatoon, SK, to conduct a 3D IP Survey. This comprehensive survey aimed to better define two principal exploration areas: the MARB-CAS Zone and the West Craigmont Zone (Figure 1). Upon reviewing the data from the approximately 6.5 square kilometer survey, the Company has commenced its 2024 diamond drilling exploration program. Figure 1 . 2024 IP Survey AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_001full.jpgA significant resistivity anomaly appears in the western section of New Craigmont, near the Lornex Fault, via the Company's 2022 ZTEM Survey. This anomaly was confirmed and refined by the 2024 3D IP Survey. Additionally, the Survey detected chargeability anomalies on the edges of the resistivity anomaly within the area, and a potential structure trending ENE, which coincides with the strongest and largest chargeability anomaly. This resistivity high could represent a felsic intrusion, as was observed in outcrop, and the chargeability high could indicate peripheral sulphidation, likely enhanced along the potential structure. The 3D IP Survey has generated multiple drilling targets focusing on the chargeability anomalies within the West Craigmont Zone.The 3D IP Survey at MARB-CAS provided valuable information regarding the lithologies and appears to clearly delineate the contact between Nicola Group rocks and the Guichon Creek Batholith. The major chargeability anomalies are primarily confined within the Nicola Group rocks in the southern portion of the survey area, with some chargeability anomalies detected between the MARB and CAS MINFILE showings.Peter Espig, Chief Executive Officer, commented, \"The 3D IP Survey both confirmed and further defined key targets. Combining numerous geological and geophysical parameters, including bedrock mapping, airborne magnetic survey, and ZTEM survey with the 3D IP Survey gives us a great confidence to have a successful Program.\"A total of 5,000 m of core drilling is planned for the 2024 exploration program. Drilling will primarily be focused on the West Craigmont Zone initially, with the possibility of also drilling at MARB/CAS later in the summer (Figure 2). Figure 2 . 2024 Drill Target AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_002full.jpg Qualified Person William Whitty, P. Geo., the Company's VP Exploration, is the Qualified Person as defined by National Instrument 43-101 -  Standards of Disclosure for Mineral Projects  and supervised the preparation of, and has reviewed and approved, the technical information in this release. About Nicola Mining Nicola Mining Inc. is a junior mining company listed on the Exchange and Frankfurt Exchange that maintains a 100% owned mill and tailings facility, located near Merritt, British Columbia It has signed Mining and Milling Profit Share Agreements with high grade gold projects. Nicola's fully permitted mill can process both gold and silver mill feed via gravity and flotation processes.The Company owns 100% of the New Craigmont Project, a high-grade copper property, which covers an area of over 10,800 hectares along the southern end of the Guichon Batholith and is adjacent to Highland Valley Copper, Canada's largest copper mine. The Company also owns 100% of the Treasure Mountain Property, which includes 30 mineral claims and a mineral lease, spanning an area exceeding 2,200 hectares.On behalf of the Board of Directors \" Peter Espig \"  Peter EspigCEO & Director For additional information Contact: Peter EspigPhone: (778) 385-1213 Email: info@nicolamining.comURL: www.nicolamining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/215275        Get News by Email  Analyst, journalist, or company stakeholder? Sign up to receive news releases by email for Nicola Mining Inc. or all companies belonging to the Mining and Metals industry.  Sign Up    Recent News  Company Profile   Articles from Newsfile        Sep 26, 2023       Mastering New Form N-PX: A 13F Filer's Guide     The Securities and Exchange Commission (SEC) adopted new rules for registered funds and institutional investment managers.          Hashtags   Subjects  Economy, Business and Finance Metal and Mineral Mining    Similar Stories               Tell Us Your Story      Learn More                    Treating you-and your story-with courtesy and care. Our commitment to delivering the best personal service defines our business and inspires our efforts every day. We're accessible and responsive to every client we serve, using cutting-edge technology and innovation makes it easier for us to focus on relationship building. The way we see it, a helpful voice on the phone is always welcomed. In addition to respecting you, Newsfile is respected as an accredited source of business news-making every story we handle become trusted for retail and institutional investment decisions.Complete the form to the right and a customer service representative will contact you to answer your questions.         x    Name *     Company *     Email *     Phone     Message *      Send Message                       x Login     Incorrect username/password.       Username     Password       Login         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Rig arrives in Canada ready to launch key exploration campaign - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9yaWctYXJyaXZlcy1pbi1jYW5hZGEtcmVhZHktdG8tbGF1bmNoLWtleS1leHBsb3JhdGlvbi1jYW1wYWlnbi8yLTEtMTY3MjAzNtIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 14:03:40 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Rig arrives in Canada ready to launch key exploration campaign | Upstream                                                                                                                              Exploration Rig arrives in Canada ready to launch key exploration campaign Hercules semisub will drill two wells for EquinorHercules drilling rig arrives in Bay Bulls in Newfoundland & Labrador, Canada.Photo: ROB STRONG Iain Esau Africa CorrespondentLondon   EquinorCanadaNewfoundland & Labrador Published 3 July 2024, 13:57Updated 3 July 2024, 16:06  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Exploration Co. Announces MRE & 2024 Drilling Program - Streetwise Reports",
    "Link": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnN0cmVldHdpc2VyZXBvcnRzLmNvbS9hcnRpY2xlLzIwMjQvMDcvMDMvZXhwbG9yYXRpb24tY28tYW5ub3VuY2VzLW1yZS1hbmQtMjAyNC1kcmlsbGluZy1wcm9ncmFtLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 13:53:54 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "          Exploration Co. Announces MRE & 2024 Drilling Program                                             Streetwise Reports   The Gold Report   The Energy Report   The Life Sciences Report   Research Reports       Streetwise Reports The Gold Report The Energy Report The Life Sciences Report Research Reports                  Don't Forget ToRate This Article      Get the Latest Investment Ideas Delivered Straight to Your Inbox.   URL       TICKERS: MMG; MMNGF  Exploration Co. Announces MRE and 2024 Drilling Program Research Report    View Important Disclosures for this Article    Close  Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.        GoldSilverBase MetalsCritical Metals    Source: Couloir Capital (7/3/24)   Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) recently announced its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program, according to a Couloir Capital report.    Couloir Capital, in a research report published on June 29, 2024, provided an update on Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) following the company's announcement of its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program. Metallic Minerals announced its first NI 43-101 MRE at the Keno Silver project, comprising four separate deposits (Formo, Fox, Caribou, and Homestake). \"The resource comprises an inferred resource of 2.5 Mt at 223 [grams per tonne silver equivalent] g/t AgEq, equating to 18.16 Moz of contained AgEq,\" Couloir Capital noted. \"These deposits remain open to lateral and depth expansion. We expect further drilling to add more resources, which should lead to an increase in the valuation.\" The analysts highlighted the company's 2024 drilling program, which has been initiated at both the La Plata and Keno Silver projects. \"This drilling initiative seeks to expand existing resources and evaluate the potential for new discoveries at the highest-priority, drill-ready targets,\" they stated. At Keno Silver, the focus will be on resource expansion at the Formo target, while at La Plata, the initial focus is on extending higher-grade mineralization at the Allard resource area. Couloir Capital also noted the recent top-up financing from  Newmont Corp. (NEM:NYSE) , viewing it as a positive development. \"We are encouraged to see additional share purchases from Newmont Corp. Newmont exercised its 'top-up right' to buy additional shares of MMG to maintain its 9.5% stake in the company,\" the analysts commented. \"We see this as a vote of confidence by a tier-1 miner in MMG's resource potential.\" Couloir Capital's fair value per share estimate of Blackwolf was updated to CA$0.47, representing a projected upside of 61.08% from the price at the time of the report of CA$0.29. Metallic Minerals' strategic plans include continuing exploration and resource expansion at both the Keno Silver and La Plata projects, as well as earning royalty monies on alluvial gold claims at its Australia Creek property near Dawson City, Yukon. With a Buy rating and a fair value estimate of CA$0.47, Couloir Capital sees significant potential in Metallic Minerals as the company advances its exploration projects and continues to expand its resource base. The analysts expect the 2024 drilling program to \"add significant ounces to the existing resources,\" potentially driving further value for shareholders.       Want to be the first to know about interesting  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Sign up to receive the  FREE  Streetwise Reports'  newsletter .         Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.       Related Articles    Copper Appears To Have Bottomed  Source: Michael Ballanger (07/05/2024)   Michael Ballanger of GGM Advisory Inc. takes a look at the current state of copper and shares his recommendations for two stocks.  read more > Expert Says Silver and Gold Stock Looking Most Attractive  Source: Clive Maund (07/03/2024)   Technical Analyst Clive Maund takes a look at Outcrop Silver & Gold Corp. (OCG:TSX.V; OCGSF:OTCQX; MRG1:DB) to explain why he believes it is a Buy. read more > Gold Popping up Once Again  Source: Michael Ballanger (07/03/2024)   Michael Ballanger of GGM Advisory Inc. shares an update on the current state of the market, and one stock he has been keeping his eye on. read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona  Source: Streetwise Reports (07/03/2024)   World Copper Ltd. (WCU:TSX.V; WCUFF:OTCQX; 7LY0:FRA) has released an update on its Zonia copper-oxide project in Arizona, revealing new potential for re-processing mineralized material from historical mine operations. What does this mean for future projects in the region? read more > Assays Find More High-Grade Lithium-Boron Results in Nevada  Source: Streetwise Reports (07/03/2024)   Canter Resources Corp. (CRC:CSE; CNRCF:OTC; 601:FRA) announced more brine assay results from its 15-hole shallow Geoprobe drill program at its Columbus Lithium-Boron Project near Tonopah, Nevada. Find out why one expert says the results so far are a hit. read more >               Want to read more about  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Get Our Streetwise Reports Newsletter Free and be the first to know!  A valid email address is required to subscribe   URL        Recommended Articles    Copper Appears To Have Bottomed Source: Michael Ballanger (07/05/2024) read more > Expert Says Silver and Gold Stock Looking Most Attractive Source: Clive Maund (07/03/2024) read more > Gold Popping up Once Again Source: Michael Ballanger (07/03/2024) read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona Source: Streetwise Reports (07/03/2024) read more > Assays Find More High-Grade Lithium-Boron Results in Nevada Source: Streetwise Reports (07/03/2024) read more >                Have You Signed Up for Our Newsletter Yet?       No Thanks          AboutDisclaimerContactSponsorshipSyndicationCareersPolicies  (c) 2024 Streetwise Reports. All rights reserved. Streetwise Reports is registered with the U.S. Patent and Trademark Office.         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly ... - StockTitan",
    "Link": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnN0b2NrdGl0YW4ubmV0L25ld3MvU0lUS0Yvc2l0a2EtZXhwYW5kcy1leHBsb3JhdGlvbi1wcm9ncmFtLWF0LWl0cy1yYy1nb2xkLXByb2plY3QtaW4teXVrb24tdG8tdGdhMzJwZnlpdGMwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 12:30:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "                                  Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property | SITKF Stock News                               Login  Please enter your login and password   Wrong username or password.     Email address     Password   Forgot password?   LOGIN Close     Don't have an account? Sign Up!                            Forgot Password  Please enter your email address   An email has been sent to your address with instructions for changing your password.     There is no user registered with this email.     Email address     RECOVER Close                            Sign Up  To create a free account, please fill out the form below.   Thank you for signing up! A confirmation email has been sent to your email address. Please check your email and follow the instructions in the message to complete the registration process. If you do not receive the email, please check your spam folder or contact us for assistance. Welcome to our platform!     Oops! Something went wrong while trying to create your new account. Please try again and if the problem persist, Email Us to receive support.     Username     Email address     Password      I accept the user agreement       Sign me up for the newsletter      CREATE ACCOUNT Close     Already have an account? Login                   Home     News    SITKF        Trending News           CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...           OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           ERIC   Ericsson and OPPO sign global patent cross license agreement           GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                       CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...                   OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           ERIC   Ericsson and OPPO sign global patent cross license agreement                   GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                     Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property          Rhea-AI Impact    (Neutral)        Rhea-AI Sentiment    (Negative)        Tags      acquisition                Rhea-AI Summary     Sitka Gold has initiated its 2024 exploration at the newly acquired Clear Creek property in Yukon, incorporating diamond drilling and additional geochemical surveys, geological mapping, and data integration. The first diamond drilling in Rhosgobel Intrusion since 1995 aims to extend findings from historical drilling. Soil sampling and geological mapping are underway to explore high-potential zones south of the Blackjack deposit and the newly acquired Clear Creek claims. Previous exploration data indicates multiple gold targets with promising results, setting the stage for potentially significant discoveries.         Positive   Initiation of the 2024 exploration program at Clear Creek, including diamond drilling. First diamond drilling at Rhosgobel Intrusion since 1995 aims to extend historical gold findings. Integration of extensive historical datasets to accelerate new gold discoveries. Geochemical surveys and geological mapping to explore high-potential zones for gold deposits. Positive historical drilling results with significant gold intersections at multiple targets.       Negative   None of the historically reported assay results from Clear Creek have been verified by Sitka.           07/03/2024 - 08:30 AM   2024 exploration has begun on the newly acquired Clear Creek property First diamond drilling program ever to be completed on the Rhosgobel Intrusion since historical shallow reverse circulation drilling in 1995 to follow up on holes 95-15 which intersected 50.3 m of 1.07 g/t gold and 95-16 which intersected 67.1 m of 1.03 g/t gold with both holes ending in strong gold mineralization. Grid geochemistry currently underway to infill gaps to the south of the Blackjack deposit on the high potential Pukelman West intrusion and G2 zone on the newly acquired Clear Creek claims. Integration of newly acquired datasets (geological, geophysical, geochemical) with Sitka Gold data. Geological mapping and prospecting following up on the high grade G2 zone, Contact zone and other highly prospective gold targets.   VANCOUVER, BC / ACCESSWIRE / July 3, 2024 / Sitka Gold Corp. (\"Sitka\" or the \"Company\") (TSXV:SIG)(FSE:1RF)(OTCQB:SITKF)  is pleased to announce that it has expanded the planned 2024 exploration program at its contiguous, 431 square kilometre RC Gold Project (\"RC Gold\" or the \"Project\") in Yukon to include diamond drilling and additional soil geochemistry surveys, geological mapping, prospecting and data integration and analysis on its newly acquired Clear Creek property (\"Clear Creek\") claims that complete the consolidation of the Clear Creek Intrusive Complex (see Figure 1). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program for 2024. \"The accumulation of data from several years of systematic exploration by previous operators on the newly acquired Clear Creek Property has generated several high-quality exploration targets,\"  said Cor Coe, Director and CEO of Sitka Gold.  \"The newly acquired claims cover at least three intrusion related gold targets that are geologically similar to our developing Blackjack gold deposit and the team is very excited to begin assessing the property by testing the Rhosgobel intrusion, where historical work strongly indicates the potential for the presence of a multi-million ounce gold deposit. Sitka's initial discovery of the Blackjack and Eiger gold deposits came about through a similar process of review and compilation of a large historical database and we see the ability to accelerate the discovery of additional gold deposits by utilizing our growing knowledge of the intrusion-related gold systems in this area in conjunction with the comprehensive Clear Creek data-set as we continue our exploration activities across this emerging mining district.\" The newly consolidated Project includes four high-priority areas that have had previous reverse circulation and/or diamond drilling that require additional drilling. These areas are the Rhosgobel intrusion where historical drilling intersected up to  1.03 g/t gold over 67.1 m  , the Contact zone with drill results up to  20.3 g/t gold over 10.7 m  , the Bear Paw Breccia which intersected up to  1.87 g/t gold over 42.6 m  and the Pukelman intrusion with results of  1.20 g/t gold over 10.0 m  (see Figure 2, Table 1). The first target area to be tested is the Rhosgobel Intrusion where shallow historical drilling in 1995 by Kennecott outlined a large area of intrusion related gold mineralization (see Figure 3). Previous drilling at Rhosgobel was limited to a vertical depth of approximately 60 metres. The gold mineralization observed at Rhosgobel is sheeted quartz veins hosted in a megacrystic quartz monzonite similar to the Blackjack deposit located 5 km to the north along the recently discovered Blackjack Mineralized Corridor. The first drill hole will be a step out to drill underneath the mineralized zone intersected in Holes 15 and 16 in shallow reverse circulation drilling (see Figure 4). This will be the first diamond drill hole ever drilled in the Rhosgobel intrusion. Geological interpretation of a steeply dipping mineralized zone is consistent with controls on mineralization observed elsewhere on the property.The Company has recently engaged GroundTruth Exploration to conduct grid based soil sampling in an area south of the Blackjack deposit where prospecting in 2015 identified a highly prospective area. The G2 zone was prospected in 2015 and 13 surface float samples were collected with a range of trace to  43.4 g/t gold  (see Figure 5) within mineralized intrusive and metasedimentary rocks. Three other samples returned values of  5.9, 7.2 and 13.6 g/t gold  . This area is located approximately 2 km south of the Blackjack gold deposit area, within the Blackjack Mineralized Corridor in proximity to the West Pukelman intrusion. Previous reconnaissance scale soil sampling encountered anomalous gold in soil in the area. The G2 zone is located approximately 1 km west of the Pukelman West intrusion within an extensional corridor containing both the Pukelman and Pukelman West intrusions and several previously reported lamprophyre dykes. The Pukelman West intrusion is located approximately 1.5 km south of the Blackjack deposit where recent drilling has intersected higher-grade mineralization associated with the N-S trending Blackjack fault. The intersection of these structural zones is interpreted by Sitka to be highly prospective for the discovery of additional gold mineralization.Prospecting in 2015 also focused on the Contact zone located at the southern margin of the Pukelman intrusion. Nineteen samples were collected ranging from trace to  166.2 g/t gold  . Seven additional samples of mainly quartz vein material taken from float and outcrop assayed above 1.0 g/t gold including  86.0, 31.8, 47.2, 27.4, 18.1, 2.8, and 1.5 g/t gold  (see Figure 5). The sampling indicates that the extent of the Contact zone could be much larger than the area previously drilled. Additional mapping and prospecting is planned to refine drill targets in anticipation of drilling this area.Geological mapping and prospecting in the G2 to Pukelman West corridor and along the Blackjack fault mineralized corridor from the Blackjack deposit south through the Pukelman West and Rhosgobel intrusion for additional areas of undiscovered gold mineralization will also be conducted with the goal of identifying additional drill targets.Recently acquired data encompassing the southern portion of the Clear Creek Intrusive Complex is being integrated within the Sitka database and plans for drilling additional known areas of mineralization are being developed.  Figure 1 -  The acquisition of the Clear Creek property now completes Sitka Gold's 100% ownership of the Clear Creek Intrusive Complex and adds several underexplored areas that have strong potential for new gold discoveries in addition to four high-quality drill targets.   Figure 2 -  The purchase of the Clear Creek Property (outlined in yellow boundary) now completes Sitka Gold's ownership of 100% of the Clear Creek Intrusive Complex, an area of approximately  8 km x 15 km  that includes several known surface intrusions with associated gold mineralization. The newly acquired property contains four highly prospective areas with limited historical drilling and several areas that have produced high-grade surface samples but remain under-explored and undrilled.   Figure 3 -  Shallow reverse circulation drilling in the Rhosgobel intrusion in 1995 produced numerous intersections of gold mineralization consisting of sheeted quartz veins with megacrystic quartz monzonite. Holes 15 and 16 were drilled in opposite directions at 60 degrees dip intersected mineralization over their entire lengths. The holes intersected  50.3 m grading 1.07 g/t gold  and  67.1m of 1.03 g/t gold  respectively with both holes ending in mineralization.   Figure 4  -  Cross-section of previous drilling at Rhosgobel along holes 15 and 16 which ended in mineralization. The first ever diamond drill hole proposed in the Rhosgobel intrusion (PROS-24-A) will step back and drill underneath holes 15 and 16 to test the width of the mineralized zone intersected in 1995.   Figure 5  -  Prospecting in 2015 was conducted in the G2 zone and the Contact Zone and produced many high-grade results. Additional grid soil sampling (shown in Figure 2) will be conducted in these areas and south where previous soil sampling has been conducted at only wide spacings. Current drilling is expanding the Blackjack deposit to the south towards this highly prospective area. Table 1: Significant drill hole results from the Clear Creek Property   *Intervals are drilled core length, as insufficient drilling has been completed at this time to determine true widths Table References  Robinson, S.D. and R. A. Doherty, 1988. Geological, Geochemical, Geophysical and Diamond Drilling 1988 Summary Report on the Rum, Rye and Roll Claims ((assessment report 092748)  Feulgen, S. and J.C. Stephen, 1989, Initial Diamond Drilling Report on the Rain, Wind, Sleet Claims, Left Clear Creek, Yukon (assessment report 092752)  Bidwell, G., 1993. Clear Creek Project, 1992 Reverse Circulation Drill Program (assessment report 093097)  Coombes, S., 1995. 1995 Assessment Report on the Clear Creek Option; prepared by Kennecott Canada Inc. (assessment report 093372).  Stammers, M.A., 2000. 1999 Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 094058)  Weeks, S. and R. Falls, 2001, 2000 Geological, Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 94165)  O'Brien, 2010;Assessment Report, 2010 Diamond Drilling Program, Clear Creek Property (Assessment report 095539)  Shutty, 2011; Assessment Report, 2011 Exploration Program, Clear Creek Property (Assessment Report 095984)  The Company cautions that none of the historically reported assay results from the newly acquired Clear Creek property have been verified by Sitka. About the Flagship RC Gold Project The RC Gold Project consists of a 431 square kilometre contiguous district-scale land package located in the heart of Yukon's Tombstone Gold Belt. The project is located approximately 100 kilometres east of Dawson City, which has a 5,000 foot paved runway, and is accessed via a secondary gravel road from the Klondike Highway which is usable year-round and is an approximate 2 hour drive from Dawson City. It is the largest consolidated land package strategically positioned mid-way between Victoria Gold's Eagle Gold Mine - Yukon's newest gold mine which reached commercial production in the summer of 2020 - and Victoria Gold's former producing Brewery Creek Gold Mine.On January 19, 2023 Sitka Gold announced an Initial Mineral Resource Estimate prepared in accordance with National Instrument 43-101 (\"NI 43-101\") guidelines for the RC Gold Property of  1,340,000  ounces of gold  (1)  . The road accessible, pit constrained Mineral Resource is classified as inferred and is contained in two zones: The Blackjack and Eiger deposits. Both of these deposits are at/near surface, are potentially open pit minable and amenable to heap leaching, with initial bottle roll tests indicating that the gold is not refractory and has  high gold recoveries of up to 94%  with minimal NaCN consumption (see News Release July 13, 2022). The Mineral Resource estimate is presented in the following table at a base case cut-off grade of 0.25 g/t Au: RC Gold Inferred Mineral Resource Estimate COG g/t Au Blackjack Zone   Eiger Zone   Combined Tonnes 000's Au g/t 0z Au 000's   Tonnes 000's Au g/t 0z Au 000's   Tonnes 000's Au g/t 0z Au 000's 0.2035,7980.80921 32,5230.45471 68,3210.631,391 0.25 33,743 0.83 900   27,362 0.50 440   61,105 0.68 1,340 0.3031,2820.88885 22,2530.55393 53,5350.741,2790.3529,0650.92860 17,8170.60344 46,8820.801,2030.4026,9750.96833 14,5060.66308 41,4810.861,140Notes  Mineral resource estimate prepared by Ronald G. Simpson of GeoSim Services Inc. with an effective date of January 19, 2023. Mineral Resources are classified using the 2014 CIM Definition Standards.  The cut-off grade of 0.25 g/t Au is believed to provide a reasonable margin over operating and sustaining costs for open-pit mining and processing  Mineral resources are constrained by an optimised pit shell using the following assumptions: US $1800/oz Au price; a 45 degrees pit slope; assumed metallurgical recovery of 85%; mining costs of US$2.00 per tonne; processing costs of US$8.00 per tonne; G&A of US$1.50/t. Mineral resources are not mineral reserves and do not have demonstrated economic viability.  Totals may not sum due to rounding.  To date, 56 diamond drill holes have been drilled into this system for a total of approximately 19,962 metres including 16 drill holes totalling 6,515 metres completed in 2023 focused on expanding the initial resource. The drilling in 2023 produced results of up to  219.0 m of 1.34 g/t gold  including  124.8 m of 2.01 g/t gold  and  55.0 m of 3.11 g/t gold  in drill hole DDRCCC-23-047 at Blackjack (see news release dated September 26, 2023). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program.  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  RC Gold Deposit Model Exploration on the Property has mainly focused on identifying an intrusion-related gold system (\"IRGS\"). The property is within the Tombstone Gold Belt which is the prominent host to IRGS deposits within the Tintina Gold Province in Yukon and Alaska. Notable deposits from the belt include: Fort Knox Mine in Alaska with current Proven and Probable Reserves of 230 million tonnes at 0.3 g/t Au (2.471 million ounces; Sims 2018)  (1)  ; Eagle Gold Mine with current Measured and Indicated Resources of 233 million tonnes at a grade of 0.57 g/t Au at the Eagle Main Zone (4.303 million ounces; Harvey et al, 2022)  (2)  ; the Brewery Creek deposit with current Indicated Mineral Resource of 22.2 million tonnes at a gold grade of 1.11 g/t (0.789 million ounces; Hulse et al. 2020)  (3)  ; the Florin Gold deposit, located adjacent to Sitka's RC Gold project, with a current Inferred Mineral Resource of 170.99 million tonnes grading 0.45 g/t (2.47 million ounces; Simpson 2021)  (4)  and the AurMac Project with an Inferred Mineral Resource of 347.49 million tonnes grading 0.63 gram per tonne gold (7.00 million ounces)  (5)  .  Sims J. Fort Knox Mine Fairbanks North Star Borough, Alaska, USA National Instrument 43-101 Technical Report. June 11, 2018. https://s2.q4cdn.com/496390694/files/doc_downloads/2018/Fort-Knox-June-2018-Technical-Report.pdf  Harvey N., Gray P., Winterton J., Jutras M., Levy M.,Technical Report for the Eagle Gold Mine, Yukon Territory, Canada. Victoria Gold Corp. December 31, 2022. https://vgcx.com/site/assets/files/6534/vgcx_-_2023_eagle_mine_technical_report_final.pdf  Hulse D, Emanuel C, Cook C. NI 43-101 Technical Report on Mineral Resources. Gustavson Associates. May 31, 2020. https://minedocs.com/22/Brewery-Creek-PEA-01182022.pdf  Simpson R. Florin Gold Project NI 43-101 Technical Report. Geosim Services Inc. April 21, 2021. https://sedar.com/GetFile.do?lang=EN&docClass=24&issuerNo=00005795&issuerType=03&projectNo=03236138&docI d=4984158  Banyan Gold News Release Dated February 7, 2023 (Technical Report to be filed within 45 days of news release) https://banyangold.com/news-releases/2024/banyan-announces-7-million-ounce-gold-updated-mineral-resource-estimate-aurmac-project-yukon-canada/  Upcoming Events Sitka Gold will be attending and/or presenting at the following events*: Takestock Investor Forum, Stampede Event, Calgary, Alberta: July 3, 2024  Kelowna Capital Events, Kelowna, BC: July 19 - 21, 2024  Precious Metals Summit, Beaver Creek, Colorado: September 10 - 13, 2024  Yukon Geoscience, Whitehorse, Yukon: November 17 - 20, 2024 *All events are subject to change. About Sitka Gold Corp. Sitka Gold Corp. is a well-funded mineral exploration company headquartered in Canada. The Company is managed by a team of experienced industry professionals and is focused on exploring for economically viable mineral deposits with its primary emphasis on gold, silver and copper mineral properties of merit. Sitka is currently exploring its 100% owned, 431 square kilometre flagship RC Gold Project within the Tombstone Gold Belt in the Yukon Territory with a 15,000 metre diamond drill program planned for 2024. The Company is also advancing the Alpha Gold Project in Nevada and currently has drill permits for its Burro Creek Gold and Silver Project in Arizona and the Coppermine River Project in Nunavut.The Company recently announced an NI 43-101 compliant  initial inferred Mineral Resource Estimate of 1,340,000 ounces of gold   (1)  beginning at surface and grading 0.68 g/t at its RC Gold Project in Yukon (see news release dated January 19, 2023).  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  *For more detailed information on the underlying properties please visit our website at www.sitkagoldcorp.comThe scientific and technical content of this news release has been reviewed and approved by Cor Coe, P.Geo., Director and CEO of the Company, and a Qualified Person (QP) as defined by National Instrument 43-101.ON BEHALF OF THE BOARD OF DIRECTORS OFSITKA GOLD CORP. \"   Donald Penner   \"  President and DirectorFor more information contact: Donald Penner  President & Director778-212-1950dpenner@sitkagoldcorp.comor Cor Coe  CEO & Director604-817-4753ccoe@sitkagoldcorp.comNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary and Forward-Looking Statements This release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". This information and these statements, referred to herein as \"forward-looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, the use of the proceeds raised under the Offering and the Company's anticipated work programs. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will complete its anticipated work programs and use the proceeds of the Offering as currently anticipated. These forward-looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, market uncertainty, the results of the Company's anticipated work programs and that the Company will not use the proceeds of the Offering as currently anticipated. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor. SOURCE:  Sitka Gold CorpView the original press release on accesswire.com     FAQ       What is Sitka Gold's 2024 exploration program at Clear Creek?    Sitka Gold's 2024 exploration program at Clear Creek includes diamond drilling, additional geochemical surveys, geological mapping, and data integration to explore high-potential gold zones.        What are the historical drilling results at Rhosgobel Intrusion?    Historical drilling at Rhosgobel Intrusion in 1995 intersected 50.3 m of 1.07 g/t gold and 67.1 m of 1.03 g/t gold, with both holes ending in strong gold mineralization.        What is the significance of the newly acquired Clear Creek property?    The newly acquired Clear Creek property consolidates Sitka Gold's ownership, adds multiple high-potential gold targets, and integrates historical data to accelerate new discoveries.        What are the key targets in Sitka Gold's 2024 drilling program?    Key targets include the Rhosgobel Intrusion, the Contact zone, the Bear Paw Breccia, and the Pukelman intrusion, all showing promising historical drilling results.        What are the expected outcomes of Sitka Gold's exploration at Clear Creek?    Sitka Gold aims to identify and expand gold deposits by leveraging historical data and conducting comprehensive exploration activities, potentially leading to significant new gold discoveries.         Sitka Gold Corp. OTC:SITKF        SITKF Rankings     N/A  Ranked by Market Cap   N/A  Ranked by Dividends         SITKF Latest News       Jun 24, 2024  Sitka Announces Expansion of RC Gold Project with Acquisition of Victoria Gold's Clear Creek Property, Yukon      Jun 13, 2024  Sitka Resumes Drilling at Its RC Gold Project, Yukon      May 23, 2024  Sitka Gold Drills 154.0 Metres of 1.47 g/t Gold Including 37.0 Metres of 3.07 g/t Gold and 8.0 Metres of 4.61 g/t Gold at its RC Gold Project, Yukon      May 1, 2024  Sitka Gold Drills 191.0 Metres of 1.16 g/t Gold Including 89.0 Metres of 2.03 g/t Gold and 11.0 Metres of 5.80 g/t Gold at its RC Gold Project, Yukon      Apr 30, 2024  Sitka to Complete Acquisition of 100% Ownership of its Flagship RC Gold Project, Yukon          SITKF Stock Data       Market Cap 29.76M     Float 214.51M     Insiders Ownership 13.48%     Institutions Ownership 4.98%     Industry Gold Ore Mining      Sector Mining, Quarrying, and Oil and Gas Extraction     Website Link     Country United States of America     City Vancouver         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "ExxonMobil lands promising pair of exploration blocks in North Africa - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9leHhvbm1vYmlsLWxhbmRzLXByb21pc2luZy1wYWlyLW9mLWV4cGxvcmF0aW9uLWJsb2Nrcy1pbi1ub3J0aC1hZnJpY2EvMi0xLTE2NzE3NjTSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 09:33:01 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    ExxonMobil lands promising pair of exploration blocks in North Africa | Upstream                                                                                                                                Exploration ExxonMobil lands promising pair of exploration blocks in North Africa US supermajor wants to assess oil and gas potential of shallow water acreage offshore MoroccoMorocco's King Mohammed VI.Photo: MOROCCAN AGENCY PRESS/AFP/SCANPIX Iain Esau Africa CorrespondentLondon   ExxonMobilMoroccoONHYMAfricaNorth Africa Published 3 July 2024, 09:26Updated 3 July 2024, 09:26  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Forge Resources Advances Exploration with Successful Drilling and Funding - TipRanks.com - TipRanks",
    "Link": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRpcHJhbmtzLmNvbS9uZXdzL2NvbXBhbnktYW5ub3VuY2VtZW50cy9mb3JnZS1yZXNvdXJjZXMtYWR2YW5jZXMtZXhwbG9yYXRpb24td2l0aC1zdWNjZXNzZnVsLWRyaWxsaW5nLWFuZC1mdW5kaW5n0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 16:00:33 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "Google NewsOpening https://www.tipranks.com/news/company-announcements/forge-resources-advances-exploration-with-successful-drilling-and-funding",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Ambitious junior finalises licences for two promising Caribbean exploration blocks - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy51cHN0cmVhbW9ubGluZS5jb20vZXhwbG9yYXRpb24vYW1iaXRpb3VzLWp1bmlvci1maW5hbGlzZXMtbGljZW5jZXMtZm9yLXR3by1wcm9taXNpbmctY2FyaWJiZWFuLWV4cGxvcmF0aW9uLWJsb2Nrcy8yLTEtMTY3MDcxM9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 08:54:09 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Ambitious junior finalises licences for two promising Caribbean exploration blocks | Upstream                                                                                                                                Exploration Ambitious junior finalises licences for two promising Caribbean exploration blocks Touchstone Exploration completes entry into a pair of onshore blocks in Trinidad & TobagoCanada's Touchstone Exploration chief executive Paul Baay.Photo: TOUCHSTONE EXPLORATION Vladimir Afanasiev European Correspondent   Touchstone ExplorationCascaduraTrinidad and TobagoPrimera Oil and Gas LimitedAmericas Published 2 July 2024, 08:46Updated 2 July 2024, 13:14  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Alaska Native tribes sue feds over limits on drilling in National Petroleum Reserve - Courthouse News Service",
    "Link": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvdXJ0aG91c2VuZXdzLmNvbS9uYXRpdmUtYWxhc2thLXRyaWJlcy1zdWUtZmVkcy1vdmVyLWxpbWl0cy1vbi1kcmlsbGluZy1pbi1uYXRpb25hbC1wZXRyb2xldW0tcmVzZXJ2ZS_SAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 23:21:02 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "Google NewsOpening https://www.courthousenews.com/native-alaska-tribes-sue-feds-over-limits-on-drilling-in-national-petroleum-reserve/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "ExxonMobil lands promising pair of exploration blocks in North Africa - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9leHhvbm1vYmlsLWxhbmRzLXByb21pc2luZy1wYWlyLW9mLWV4cGxvcmF0aW9uLWJsb2Nrcy1pbi1ub3J0aC1hZnJpY2EvMi0xLTE2NzE3NjTSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 09:33:01 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    ExxonMobil lands promising pair of exploration blocks in North Africa | Upstream                                                                                                                                Exploration ExxonMobil lands promising pair of exploration blocks in North Africa US supermajor wants to assess oil and gas potential of shallow water acreage offshore MoroccoMorocco's King Mohammed VI.Photo: MOROCCAN AGENCY PRESS/AFP/SCANPIX Iain Esau Africa CorrespondentLondon   ExxonMobilMoroccoONHYMAfricaNorth Africa Published 3 July 2024, 09:26Updated 3 July 2024, 09:26  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Rig arrives in Canada ready to launch key exploration campaign - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9yaWctYXJyaXZlcy1pbi1jYW5hZGEtcmVhZHktdG8tbGF1bmNoLWtleS1leHBsb3JhdGlvbi1jYW1wYWlnbi8yLTEtMTY3MjAzNtIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 14:28:06 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Rig arrives in Canada ready to launch key exploration campaign | Upstream                                                                                                                              Exploration Rig arrives in Canada ready to launch key exploration campaign Hercules semisub will drill two wells for EquinorHercules drilling rig arrives in Bay Bulls in Newfoundland & Labrador, Canada.Photo: ROB STRONG Iain Esau Africa CorrespondentLondon   EquinorCanadaNewfoundland & Labrador Published 3 July 2024, 13:57Updated 3 July 2024, 16:06  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Ambitious junior finalises licences for two promising Caribbean exploration blocks - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy51cHN0cmVhbW9ubGluZS5jb20vZXhwbG9yYXRpb24vYW1iaXRpb3VzLWp1bmlvci1maW5hbGlzZXMtbGljZW5jZXMtZm9yLXR3by1wcm9taXNpbmctY2FyaWJiZWFuLWV4cGxvcmF0aW9uLWJsb2Nrcy8yLTEtMTY3MDcxM9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 08:54:09 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Ambitious junior finalises licences for two promising Caribbean exploration blocks | Upstream                                                                                                                                Exploration Ambitious junior finalises licences for two promising Caribbean exploration blocks Touchstone Exploration completes entry into a pair of onshore blocks in Trinidad & TobagoCanada's Touchstone Exploration chief executive Paul Baay.Photo: TOUCHSTONE EXPLORATION Vladimir Afanasiev European Correspondent   Touchstone ExplorationCascaduraTrinidad and TobagoPrimera Oil and Gas LimitedAmericas Published 2 July 2024, 08:46Updated 2 July 2024, 13:14  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Drilling barge ready for Eni's Caspian Sea wildcat - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9kcmlsbGluZy1iYXJnZS1yZWFkeS1mb3ItZW5pcy1jYXNwaWFuLXNlYS13aWxkY2F0LzItMS0xNjcwMjM40gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:43:31 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Drilling barge ready for Eni's Caspian Sea wildcat | Upstream                                                                                                                                 Exploration Drilling barge ready for Eni's Caspian Sea wildcat Caspian Explorer barge owner hopes drilling success might be opportunity to trade the unit for a minority interest in offshore Kazakhstan developmentThe Caspian Explorer drilling barge, owned by UK-listed Caspian Sunrise, in the Kazakh port of Aktau on the Caspian Sea.Photo: CASPIAN SUNRISE Vladimir Afanasiev European Correspondent   Caspian SunriseKazakhstanEniKazMunayGazAsia & Oceania Published 2 July 2024, 07:25Updated 2 July 2024, 13:48  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field - WorldOil",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy53b3JsZG9pbC5jb20vbmV3cy8yMDI0LzcvMy9hZG5vYy1kcmlsbGluZy1zZWN1cmVzLTczMy1taWxsaW9uLWluLW9mZnNob3JlLWRyaWxsaW5nLWNvbnRyYWN0cy1mb3ItbWFzc2l2ZS16YWt1bS1vaWwtZmllbGQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:01:50 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "        ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field                                           Advertise | | Contact WO        Menu       Topics          Onshore    Exploration Drilling Completion Production Shale Hydraulic Fracturing Conventional        Digital Transformation    Automation & Control Data Storage Artificial Intelligence        Offshore    Exploration Drilling Production Deepwater Subsea Decommissioning        Energy Transition    LNG Sustainability Offshore Wind Hydrogen Carbon Capture        Industry & Analysis    Economics/statistics Regulatory ESG/Investment        Regions    North America South America Europe Eastern Mediterranean Russia & FSU Africa Middle East Far East South Asia South Pacific Arctic East Asia Australasia             Magazine     Current Issue Archive Free Trial Subscription Full Access Subscription Renew Subscription Supplements Forecast Reprints & Back Issues       News     Latest News Company News Newsletter Sign-Up       Resources     Webcasts Whitepapers eBooks Podcasts Videos Upstream365 Event Presentations Maps Store       Events     World Oil Events Gulf Energy Information Excellence Awards Women's Global Leadership Conference World Oil Forecast Breakfast       Project Data     Global Energy Infrastructure         Login                  Offshore Drilling Middle East UAE         ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field      July 03, 2024     (WO) - ADNOC Drilling Company PJSC has won $733 million in total contracts, by ADNOC Offshore, for three island drilling rigs to support growing operations at the offshore Zakum oil field. The three new island rigs will operate on existing and newly constructed innovative artificial islands at the offshore Zakum field for drilling and completion of wells. The rigs, which will be constructed by Honghua Group (HH), will incorporate industry leading technology and automation. Delivery of the rigs and commencement of operations is expected during 2026. The rigs will be designed and built as part of a partnership between ADNOC Drilling and HH. This partnership has been specifically formed to harness the transformative nature of AI, digitization, and advanced technology in the design and operation of these next generation drilling rigs. ADNOC Drilling and HH will look to also collaborate with AIQ, an Abu Dhabi based artificial intelligence (AI) pioneer contributing to the energy sector globally. The design of the rig operating systems will look to utilize real-time condition, performance and utilization data to create actionable insights, enhancing rig performance and increasing efficiency, leading to improvements in safety and well delivery times. Additionally, drilling operations on ADNOC's innovative artificial islands create the ideal conditions for extended reach drilling (ERD) with the top five longest wells in the world being delivered from these islands off the coast of Abu Dhabi, the most recently delivered being over 52,000 feet.  The rigs will be built to deliver ERD as well as having the state-of-the-art capability of walking between wells eliminating the need for the rigs to be dismantled to be moved. These capabilities dramatically improve efficiency and safety while vastly reducing costs and emissions. The ADNOC Drilling fleet is now expected to total at least 148 by 2026, including these three new rigs, as well as the previously announced three land rigs for the initial phase of unconventional development. Abdulrahman Abdulla Al Seiari, Chief Executive Officer of ADNOC Drilling, said, \"ADNOC Drilling is honored to receive this substantial award, which marks a significant milestone in our company's accelerated growth journey. These new island rigs will be the most advanced in the world, embracing artificial intelligence, the most transformative technology of our generation. \"Our partnership with HH will amplify the creativity and ingenuity of our industry as we design and build these rigs of the future that drive efficiency and safety and deliver exceptional value for our customer ADNOC Offshore.\" Commenting on the award, Tayba Abdul Rahim Al Hashemi, Chief Executive Officer of ADNOC Offshore, said: \"ADNOC Drilling's technical expertise and enhanced capabilities are key enablers as we safely and sustainably accelerate to meet the world's growing energy demands. This award will strengthen our partnership in the future as we work together to harness AI and innovation to maximise energy, minimize emissions and unlock significant value for stakeholders.\"                   (c)2024 World Oil, (c) 2024 Gulf Publishing Company LLC.market data is provided by Barchart Solutions. Futures: at least 10 minute delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. To see all exchange delays and terms of use, please see disclaimer.          All material subject to strictly enforced copyright laws   Please read our Terms & Conditions, Cookies Policy and Privacy Policy before using the site.               Connect with  World Oil               Connect with  World Oil , the upstream industry's most trusted source of forecast data, industry trends, and insights into operational and technological advances.       Newsletter Sign Up            ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling - Surfrider Foundation",
    "Link": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnN1cmZyaWRlci5vcmcvbmV3cy9mZWRlcmFsLWJpbGxzLWNhbGwtZm9yLWRhbWFnaW5nLWZ1bmRpbmctY3V0cy1hbmQtaGFybWZ1bC1vZmZzaG9yZS1kcmlsbGluZ9IBdWh0dHBzOi8vd3d3LnN1cmZyaWRlci5vcmcvbmV3cy9mZWRlcmFsLWJpbGxzLWNhbGwtZm9yLWRhbWFnaW5nLWZ1bmRpbmctY3V0cy1hbmQtaGFybWZ1bC1vZmZzaG9yZS1kcmlsbGluZz9oc19hbXA9dHJ1ZQ?oc=5",
    "Published": "Tue, 02 Jul 2024 21:11:15 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "   Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling                                       Skip to content (press enter)           07.02.24   Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling   By Katie Day              Each year, Congress must draft and agree upon a budget to fund the federal government. The intent of these appropriation bills is to provide funding that federal agencies need to accomplish their mandates and fund important programs. However, the first round of the Fiscal Year (FY) 2025 budget bills to pass out of House Committees last week are riddled with extensive budget cuts to ocean and coastal management programs that the public rely on for clean water and healthy beaches. The bills also include harmful policy provisions, known as \"policy riders\", that have no business being in a budget bill!  Some of the most concerning policy riders in the House Fiscal Year 2025 budget bills include  mandates for new oil and gas leasing, prohibitions on the establishment of important protected areas for wildlife and natural ecosystems , and  limitations that hinder federal agency ability to regulate polluters ; putting water quality, air quality, and the climate at risk. For decades, Surfrider has fought to protect annual funding levels for important ocean and coastal programs. These include programs to support ocean research, protect ocean and coastal habitats, help communities prepare for coastal hazards, test water quality to keep people safe at the beach, and more. Two of the key federal agencies that administer these programs are the Environmental Protection Agency (EPA) and National Oceanic and Atmospheric Administration (NOAA), yet the House budget bills call for a  20 percent funding cut to the EPA , and a  12 percent funding cut to NOAA . While this is a very concerning way to start off the 2025 appropriations process, all is not lost.   Your voice can make a difference!   Click here to contact your federal representatives  and urge them to oppose these funding cuts and dangerous policy riders in order to protect communities, wildlife, the environment, and our ocean and coasts!  FY 2025 House Appropriation Bills: The Bad   Coastal water quality at risk to more sewage spills.  Funding levels for each program administered by the EPA have yet to be released, but a reduction in topline funding of 20 percent (not accounting for inflation!) does not bode well for EPA programs that are critical for protecting water quality, coastlines, and beachgoers in light of increasing climate change impacts. For instance, the  Interior, Environment and Related Agencies Appropriations bill  allocates just $1.2 billion to the Clean Water State Revolving Fund, roughly one third of the authorized level. Accounting for the hefty earmarks to specific projects, that's just $649 million to the actual fund, which is a  critical EPA program  that states rely on to fund wastewater infrastructure upgrades in order to prevent sewage spills.    Ocean ecosystems, community resilience, and coastal hazard preparedness threatened.  The  Commerce, Justice, Science and Related Agencies Appropriations bill  cuts funding to NOAA by 12 percent. While we don't have all the details of funding levels for each NOAA-administered program just yet, a notable topline funding cut means important programs like Coastal Zone Management, Sea Grant, Marine Sanctuaries and Protected Areas, and more could be at risk. These programs are designed to fund ocean and coastal research that keep communities safe, enhance coastal resilience, and help prepare against severe weather events.    Marine wildlife and coastal communities exposed to dangerous offshore oil and gas drilling.   Offshore oil and gas drilling  exacerbates climate change by producing fossil fuels, pollutes coastal waters with heavy metals and chemicals, and ultimately results in heart-wrenching oil spills that harm marine wildlife and coastal communities. The Interior, Environment and Related Agencies Appropriations bill includes requirements for new oil and gas lease sales and limits much needed protections for marine mammals from harm caused by offshore energy leasing.    Protections limited for at risk wildlife and ecosystems.  The Interior, Environment and Related Agencies Appropriations bill stops the Biden Administration's effort to protect 30 percent of our nation's lands and waters by 2030, known as the 30x30 Initiative, and weakens the Endangered Species Act.    The nation's ability to regulate polluters and respond to the climate crisis hindered.  The Interior, Environment and Related Agencies Appropriations bill blocks the EPA from enforcing the recently established methane fee on fossil fuel producers and prevents federal agencies from accounting for climate change impacts by blocking the use of the Social Cost of Carbon in cost benefit analyses. The bill also removes the ability of the National Environmental Protection Act to require the consideration of climate change efforts in permitting. Finally, the bill minimizes the ability of agencies to oversee and limit pollution from chemical and pesticide manufacturers.    National environmental justice initiatives blocked.  The Interior, Environment and Related Agencies Appropriations bill defunds important environmental justice programs, including the American Climate Corps, Climate Justice Alliance, and eco grief counseling. The bill also prohibits the Biden Administration's executive orders on diversity, equity, and inclusion from being implemented.   FY 2025 House Appropriation Bills: The Hopeful   Funding to address to the Tijuana River Valley water quality and environmental justice crisis.  The  State, Foreign Operations, and Related Programs Appropriations bill  includes record funding for the International Boundary and Water Commission, which will support essential maintenance and infrastructure upgrades at the International Wastewater Treatment plant at the US/Mexico border. This is a  priority campaign  for the Surfrider Foundation and our San Diego Chapter.    Full funding to the Land and Water Conservation Fund . While permanent, full funding to the Land and Water Conservation Fund is required thanks to the Great Americans Outdoors Act (a bill  Surfrider helped pass  in 2020!), last year millions of dollars were \"rescinded\" from the program during the appropriations process. We're grateful to see House Committee members include full funding to this important program.    There are still many steps to go before becoming final!  These bills have only passed their various House Committees. Each of these appropriation bills will also need to be voted on by the full House of Representatives and confer with the Senate before the budget is finalized. The Senate versions are still in development but are expected to be more protective of funding levels and not include these harmful policy riders.    The fight isn't over.  Surfrider will continue to fight back to get funding levels restored for critical ocean and coastal programs in the Fiscal Year 2025 budget. Surfrider will also work diligently to prevent these harmful policy riders from becoming law.   Surfrider will continue to advocate for federal protections, funding and support for our ocean and coasts.  From  hosting fly-ins to Washington, D.C . to arranging in district field visits so Congressmembers and their staff can see the issues first hand, to submitting testimony to Congressional Committees throughout the year; Surfrider will not stop until these funding levels are restored and dangerous policies are avoided.  Not a Surfrider member? Become one today and join the movement!       ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvYWRub2MtZXhwYW5kcy16YWt1bS1vZmZzaG9yZS1kcmlsbGluZy1mbGVldC1vdXRwdXQtYm9vc3QtZnJvbS0yMDI2LTI2NTEwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 11:41:44 GMT",
    "Categories": [
      "Production Updates",
      "Exploration"
    ],
    "Content": "      Adnoc expands Zakum offshore drilling fleet, output boost from 2026             Adnoc expands Zakum offshore drilling fleet, output boost from 2026   Crude Oil   3 Jul 2024   The UAE's energy giant Adnoc is set to boost production from the giant offshore Zakum field with a further ramp up...    Please Register or Sign in to view this content. Quantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon and ammonia markets. Quantum Oil service subscribers have access to:  Daily price assessments Market news and price commentary Fundamental trade data Quantum Energy Daily - market report sent to your email  Get in touch with us for subscription information on all Quantum platforms, or help with the service.      Related         Adnoc lifts Murban exports, Ruwais refinery processes more Upper Zakum   Crude Oil Refined Products   1 Apr 2024   UAE oil company Adnoc has boosted volumes of the medium sour Upper Zakum crude supplied into its giant Ruwais refining complex...           Adnoc L&S awarded contract for new Lower Zakum island   Crude Oil   8 Jun 2023   The recently listed Adnoc Logistics and Services has been awarded its first major contract...           Adnoc awards $412m drilling contract for Upper Zakum expansion   Crude Oil   14 Apr 2023   The UAE's energy powerhouse Adnoc has awarded a contract to its subsidiary, Adnoc Drilling, to provide...              ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Offshore Drilling Market Size Set to Surge, Forecasted to Reach USD 89.61 Billion by 2032 - openPR",
    "Link": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm9wZW5wci5jb20vbmV3cy8zNTYxNzQ2L29mZnNob3JlLWRyaWxsaW5nLW1hcmtldC1zaXplLXNldC10by1zdXJnZS1mb3JlY2FzdGVkLXRvLXJlYWNo0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:16:00 GMT",
    "Categories": [
      "Market Trends",
      "Exploration"
    ],
    "Content": "Google NewsOpening https://www.openpr.com/news/3561746/offshore-drilling-market-size-set-to-surge-forecasted-to-reach",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Environmental coalition opposes Challenger Energy's bid to renew offshore drilling licenses - EyeWitness News",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZXduZXdzLmNvbS9lbnZpcm9ubWVudGFsLWNvYWxpdGlvbi1vcHBvc2VzLWNoYWxsZW5nZXItZW5lcmd5cy1iaWQtdG8tcmVuZXctb2Zmc2hvcmUtZHJpbGxpbmctbGljZW5zZXPSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 08:15:41 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "        Environmental coalition opposes Challenger Energy's bid to renew offshore drilling licenses - Eye Witness News                                                                                                              NASSAU, BAHAMAS - A coalition of environmental organizations and businesses has strongly opposed Challenger Energy Group's attempt to renew its offshore drilling licenses. \"Our Islands, Our Future (OIOF),\" a coalition of over 150 businesses, environmental groups, tourism advocates, and other Bahamian and international leaders, stated yesterday that it strongly opposes Challenger Energy Group's recent suggestion that the Bahamian government may renew offshore drilling licenses that expired over three years ago. The coalition stressed that the government's previous decision to halt consideration of these renewals sends a clear message that The Bahamas is shifting away from fossil fuels and embracing a sustainable energy future. Challenger Energy Group, formerly known as The Bahamas Petroleum Company (BPC), continues its efforts to secure the renewal of its licenses for a third three-year exploration period. The company is currently engaged in ongoing discussions with the Government regarding the renewal terms. Eytan Uliel, Chief Executive of Challenger Energy, noted in the company's 2023 annual report and financial statement: \"In relation to the Company's licenses in The Bahamas, throughout 2023 we continued to pursue a renewal of the licenses into a third exploration period. In parallel, we explored various alternative strategies to monetize those assets. The process has been frustratingly slow, but we expect to make better progress in the coming 12 months.\" The report also noted that under its Bahamian exploration licenses, the company must pay the government in advance for annual rentals in the licensed areas. Following the Environmental Authorization for the Perseverance-1 well on February 27, 2020, discussions between the company and the Government of The Bahamas seeking a final agreement on the amount of license fees payable for the remainder of the second exploration period (including the extension due to force majeure) have lacked substantive progress to date. \"The fact that the government has not renewed or considered these licenses is a positive indication that The Bahamas is looking toward a cleaner, greener future,\" said Andurah Daxon, Executive Director of Waterkeepers Bahamas. \"We cannot afford to jeopardize our marine environment and coastal ecosystems for uncertain oil prospects.\" Earlier this year, OIOF commissioned a nationwide poll revealing overwhelming public support for a permanent ban on oil drilling in Bahamian waters. The extensive survey showed that 86 percent of respondents support legislative action to prevent further fossil fuel exploration, with 74 percent advocating for a transition to renewable energy. Of the more than 400 respondents, only four percent opposed a ban on oil drilling, and nine percent were undecided. \"The Bahamian people have spoken loud and clear. They want to protect our pristine waters and vibrant marine life, which are the lifeblood of our tourism and fishing industries,\" said Casuarina McKinney-Lambert, Executive Director of the Bahamas Reef Environment Educational Foundation (BREEF). \"The path forward for the Bahamas is not through fossil fuels but through sustainable energy solutions. The recent oil spill off Clifton underscores the urgency to clean up existing sources of marine pollution and transition to a renewable future.\" According to OIOF, the exploration licenses referenced in Challenger Energy Group's 2023 annual report expired in 2021, and based on available information, the company still owes government fees associated with those licenses. Therefore, the groups emphasize that it is dangerously misleading to state, \"Challenger Energy holds four exploration licenses offshore in The Bahamas.\" This discrepancy further underscores the need for the government to take decisive action and permanently deny these renewal requests. \"The government's refusal to consider renewal based on non-payment of license fees was an important step, and three years have now gone by since those licenses expired,\" said Chris Wilke of Waterkeeper Alliance. \"With Challenger still knocking at the door, a permanent ban on oil drilling would provide the strongest possible assurance of the Bahamian commitment to safeguarding the marine environment and embracing a clean energy future.\" OIOF asserts that The Bahamas has a unique opportunity to lead the Caribbean region to reject dirty fossil fuel proliferation, transition to renewable energy, and set an example for sustainable development and environmental stewardship. OIOF urges the government to prioritize the long-term health and prosperity of the nation by formally denying exploration renewal requests, rejecting any further oil exploration licenses, and committing to a future powered by clean, renewable energy.                                Tags  Always a headline ahead, ewnews, ewnews.com, Eyewitness News, Eyewitness News Online, Nassau Bahamas, www.ewnews.com          About Natario McKenzie  View all posts by Natario McKenzie →         Related                   Watch Live at 7pm   Watch ILTV Live                       By clicking \"Accept\" you agree to Eye Witness News Comment Policy, Terms and Conditions and Privacy Policy | Terms & Conditions |  Comment Policy |  Privacy Policy  ACCEPT Terms & Privacy Policy       Close            Privacy Overview    This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.               Necessary    Necessary   Always Enabled         Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.              Non-necessary    Non-necessary           Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.                           SAVE & ACCEPT                  Translate >>    Hide picture    ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Equinor's (EQNR) Argentina Offshore Drilling Hits Dry Well - MSN",
    "Link": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5tc24uY29tL2VuLXVzL21vbmV5L21hcmtldHMvZXF1aW5vci1zLWVxbnItYXJnZW50aW5hLW9mZnNob3JlLWRyaWxsaW5nLWhpdHMtZHJ5LXdlbGwvYXItQkIxcDQycjM_aXRlbT1mbGlnaHRzcHJnLXRpcHN1YnNjLXYxYT9zZWFzb27SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 03:46:42 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "      MSN      ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Offshore drilling surge creates turnaround for Australian exploration - Energy News Bulletin",
    "Link": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmVuZXJneW5ld3NidWxsZXRpbi5uZXQvZXhwbG9yYXRpb24vbmV3cy80MzMwMzc2L29mZnNob3JlLWRyaWxsaW5nLXN1cmdlLWNyZWF0ZXMtdHVybmFyb3VuZC1hdXN0cmFsaWFuLWV4cGxvcmF0aW9u0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 08:37:55 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "                 Offshore drilling surge creates turnaround for Australian exploration                                               About CONTACT US                Sign In Log out  Newsletter signup              HOME   OIL & GAS   Operations   Exploration   Policy     ENERGY TRANSITION   MARKETS   OPINION   GLOBAL   RESEARCH     PARTNER CONTENT      x             Search             CLOSE Sign In Log out     ✖      HOME     OIL & GAS    Operations Exploration Policy      ENERGY TRANSITION     MARKETS     OPINION     GLOBAL     RESEARCH    LATEST HEADLINES   News Analysis    Events    Tags    Partner Content      ABOUT   About ENB Newsletter signup Frequently Asked Questions       SOLUTIONS   Advertise       LEGAL   Terms and Conditions  Privacy Policy  Cookie Policy       SOCIAL    LINKEDIN   X   YOUTUBE  FACEBOOK                       EXPLORATION  Offshore drilling surge creates turnaround for Australian exploration  Petroleum exploration expenditure hits $337 million in March quarter  Colin Sandell-Hay        Australian offshore petroleum drilling has increased.          02 July 2024            After a number of years in the doldrums, Australia's petroleum exploration sector achieved a welcome turnaround in the March quarter, with expenditure hitting $337 million. Up from $254 million in 2023,...       Start a free trial to continue reading this article  Already have an account?  Sign in here       Navigate the Future of Energy with Premier Intelligence Energy News Bulletin (ENB) is the Asia Pacific region's most comprehensive source of daily energy news, providing unparalleled insight into the Energy sector through expert commentary and researched features.             RELATED ARTICLES  New Greenpeace boat permanently in APAC region to lead the charge  Slugcatcher: Yes, no, maybe.  Predicted NZ gas shortages \"very concerning\" New research projects southeast Asia offshore gas set to boom       MORE ON THIS TOPIC  NEXT: First Kumul O&G exploration to start in PNG PREVIOUS: Tamboran's NYSE IPO fails to impress               Get the Energy News Bulletin Newsletter delivered free each day                         MOST POPULAR          1      OPERATIONS New Greenpeace boat permanently in APAC region to lead the charge           2      EXPLORATION Top End uncovers significant gas potential South Nicholson Basin          3      OPINION Slugcatcher: Yes, no, maybe.           4      ENERGY TRANSITION Snowy Hydro secures vital 25-year gas storage deal                     RESEARCH    Premium subscribers only View more      A growing series of reports, each focused on a key discussion point for the energy sector, brought to you by the Energy News Bulletin Intelligence team.     A growing series of reports, each focused on a key discussion point for the energy sector, brought to you by the Energy News Bulletin Intelligence team.       ENB CCS Report 2024 ENB's CCS Report 2024 finds that CCS could be the much-needed magic bullet for Australia's decarbonisation drive             ENB Cost Report 2023 ENB's latest Cost Report findings provide optimism as investments in oil and gas, as well as new energy rise.             ENB Future of Energy Report 2023 ENB's inaugural Future of Energy Report details the industry outlook on the medium-to-long-term future for the sector in the Asia Pacific region.             ENB Cost Report 2021 This industry-wide report aims to understand current cost levels across the energy industry                             LINKEDIN   X   YOUTUBE  FACEBOOK                  Content       Oil & Gas Energy Transition Markets Opinion Global Research Events News Analysis Tags Partner Content            About       About ENB Newsletter Signup Frequently Asked Questions            Solutions       Advertise            Legal       Terms And Conditions Privacy Policy Cookie Policy                     THE ASPERMONT BRAND PORTFOLIO             Login           Invalid username or password    Log in    Username     Password        Remember me Lost password?               ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field - WorldOil",
    "Link": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy53b3JsZG9pbC5jb20vbmV3cy8yMDI0LzcvMy9hZG5vYy1kcmlsbGluZy1zZWN1cmVzLTczMy1taWxsaW9uLWluLW9mZnNob3JlLWRyaWxsaW5nLWNvbnRyYWN0cy1mb3ItbWFzc2l2ZS16YWt1bS1vaWwtZmllbGQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:01:50 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "        ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field                                           Advertise | | Contact WO        Menu       Topics          Onshore    Exploration Drilling Completion Production Shale Hydraulic Fracturing Conventional        Digital Transformation    Automation & Control Data Storage Artificial Intelligence        Offshore    Exploration Drilling Production Deepwater Subsea Decommissioning        Energy Transition    LNG Sustainability Offshore Wind Hydrogen Carbon Capture        Industry & Analysis    Economics/statistics Regulatory ESG/Investment        Regions    North America South America Europe Eastern Mediterranean Russia & FSU Africa Middle East Far East South Asia South Pacific Arctic East Asia Australasia             Magazine     Current Issue Archive Free Trial Subscription Full Access Subscription Renew Subscription Supplements Forecast Reprints & Back Issues       News     Latest News Company News Newsletter Sign-Up       Resources     Webcasts Whitepapers eBooks Podcasts Videos Upstream365 Event Presentations Maps Store       Events     World Oil Events Gulf Energy Information Excellence Awards Women's Global Leadership Conference World Oil Forecast Breakfast       Project Data     Global Energy Infrastructure         Login                  Offshore Drilling Middle East UAE         ADNOC Drilling secures $733 million in offshore drilling contracts for massive Zakum oil field      July 03, 2024     (WO) - ADNOC Drilling Company PJSC has won $733 million in total contracts, by ADNOC Offshore, for three island drilling rigs to support growing operations at the offshore Zakum oil field. The three new island rigs will operate on existing and newly constructed innovative artificial islands at the offshore Zakum field for drilling and completion of wells. The rigs, which will be constructed by Honghua Group (HH), will incorporate industry leading technology and automation. Delivery of the rigs and commencement of operations is expected during 2026. The rigs will be designed and built as part of a partnership between ADNOC Drilling and HH. This partnership has been specifically formed to harness the transformative nature of AI, digitization, and advanced technology in the design and operation of these next generation drilling rigs. ADNOC Drilling and HH will look to also collaborate with AIQ, an Abu Dhabi based artificial intelligence (AI) pioneer contributing to the energy sector globally. The design of the rig operating systems will look to utilize real-time condition, performance and utilization data to create actionable insights, enhancing rig performance and increasing efficiency, leading to improvements in safety and well delivery times. Additionally, drilling operations on ADNOC's innovative artificial islands create the ideal conditions for extended reach drilling (ERD) with the top five longest wells in the world being delivered from these islands off the coast of Abu Dhabi, the most recently delivered being over 52,000 feet.  The rigs will be built to deliver ERD as well as having the state-of-the-art capability of walking between wells eliminating the need for the rigs to be dismantled to be moved. These capabilities dramatically improve efficiency and safety while vastly reducing costs and emissions. The ADNOC Drilling fleet is now expected to total at least 148 by 2026, including these three new rigs, as well as the previously announced three land rigs for the initial phase of unconventional development. Abdulrahman Abdulla Al Seiari, Chief Executive Officer of ADNOC Drilling, said, \"ADNOC Drilling is honored to receive this substantial award, which marks a significant milestone in our company's accelerated growth journey. These new island rigs will be the most advanced in the world, embracing artificial intelligence, the most transformative technology of our generation. \"Our partnership with HH will amplify the creativity and ingenuity of our industry as we design and build these rigs of the future that drive efficiency and safety and deliver exceptional value for our customer ADNOC Offshore.\" Commenting on the award, Tayba Abdul Rahim Al Hashemi, Chief Executive Officer of ADNOC Offshore, said: \"ADNOC Drilling's technical expertise and enhanced capabilities are key enablers as we safely and sustainably accelerate to meet the world's growing energy demands. This award will strengthen our partnership in the future as we work together to harness AI and innovation to maximise energy, minimize emissions and unlock significant value for stakeholders.\"                   (c)2024 World Oil, (c) 2024 Gulf Publishing Company LLC.market data is provided by Barchart Solutions. Futures: at least 10 minute delayed. Information is provided 'as is' and solely for informational purposes, not for trading purposes or advice. To see all exchange delays and terms of use, please see disclaimer.          All material subject to strictly enforced copyright laws   Please read our Terms & Conditions, Cookies Policy and Privacy Policy before using the site.               Connect with  World Oil               Connect with  World Oil , the upstream industry's most trusted source of forecast data, industry trends, and insights into operational and technological advances.       Newsletter Sign Up            ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Bedford gas leak after drilling company hits natural gas pocket - BBC.com",
    "Link": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jeHcybnc0M3A0cm_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:47:08 GMT",
    "Categories": [
      "Company News",
      "Exploration"
    ],
    "Content": " Bedford gas leak after drilling company hits natural gas pocket Skip to content HomeNewsIsrael-Gaza WarWar in UkraineUS & CanadaUKUK PoliticsEnglandN. IrelandN. Ireland PoliticsScotlandScotland PoliticsWalesWales PoliticsAfricaAsiaChinaIndiaAustraliaEuropeLatin AmericaMiddle EastIn PicturesBBC VerifySportBusinessExecutive LoungeTechnology of BusinessWomen at the HelmFuture of BusinessInnovationTechnologyScience & HealthArtificial IntelligenceAI v the MindCultureFilm & TVMusicArt & DesignStyleBooksEntertainment NewsTravelDestinationsAfricaAntarcticaAsiaAustralia and PacificCaribbean & BermudaCentral AmericaEuropeMiddle EastNorth AmericaSouth AmericaWorld's TableCulture & ExperiencesAdventuresThe SpeciaListEarthNatural WondersWeather & ScienceClimate SolutionsSustainable BusinessGreen LivingVideoLiveLive NewsLive Sport Home News Sport Business Innovation Culture Travel Earth Video Live Audio Weather Newsletters Gas leak: Roads could be closed for two days  3 July 2024 Share Google Road closures are in place at Cleat Hill, Kimbolton Road, Glenrose Avenue and Wagstaffe Close A drilling company caused a gas leak in a residential area after hitting a pocket of natural gas.Bedfordshire Fire and Rescue have been at the scene in Cleat Hill, Bedford, since 15:00 BST on Tuesday and warned nearby road closures could remain in place until Thursday.Nicholls Boreholes and Ground Source said they had been drilling a borehole for a heat pump when they \"encountered a pocket of naturally occurring gas at approximately 100 meters below ground level\". It added: \"The borehole has been temporarily capped to control the flow of gas whilst we work with the emergency services to permanently close the borehole. Bedfordshire Police put a cordon in place and assisted with road closures. Follow Beds, Herts and Bucks news on  Facebook ,  Instagram  and  X . Got a story? Email  eastofenglandnews@bbc.co.uk  or WhatsApp us on 0800 169 1830 More on this story Homes evacuated after builder dug into gas pipe Homes evacuated and roads closed due to gas leak Homes evacuated over gas leak fire Related internet links Bedfordshire Fire and Rescue Service Bedfordshire Police Bedford Bedfordshire and Luton Fire and Rescue Service",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Exploration Co. Announces MRE & 2024 Drilling Program - Streetwise Reports",
    "Link": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnN0cmVldHdpc2VyZXBvcnRzLmNvbS9hcnRpY2xlLzIwMjQvMDcvMDMvZXhwbG9yYXRpb24tY28tYW5ub3VuY2VzLW1yZS1hbmQtMjAyNC1kcmlsbGluZy1wcm9ncmFtLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 13:53:54 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "          Exploration Co. Announces MRE & 2024 Drilling Program                                             Streetwise Reports   The Gold Report   The Energy Report   The Life Sciences Report   Research Reports       Streetwise Reports The Gold Report The Energy Report The Life Sciences Report Research Reports                  Don't Forget ToRate This Article      Get the Latest Investment Ideas Delivered Straight to Your Inbox.   URL       TICKERS: MMG; MMNGF  Exploration Co. Announces MRE and 2024 Drilling Program Research Report    View Important Disclosures for this Article    Close  Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.        GoldSilverBase MetalsCritical Metals    Source: Couloir Capital (7/3/24)   Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) recently announced its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program, according to a Couloir Capital report.    Couloir Capital, in a research report published on June 29, 2024, provided an update on Metallic Minerals Corp. (MMG:TSX.V; MMNGF:OTCQB) following the company's announcement of its maiden NI 43-101 mineral resource estimate (MRE) at the Keno Silver project and the initiation of its 2024 drilling program. Metallic Minerals announced its first NI 43-101 MRE at the Keno Silver project, comprising four separate deposits (Formo, Fox, Caribou, and Homestake). \"The resource comprises an inferred resource of 2.5 Mt at 223 [grams per tonne silver equivalent] g/t AgEq, equating to 18.16 Moz of contained AgEq,\" Couloir Capital noted. \"These deposits remain open to lateral and depth expansion. We expect further drilling to add more resources, which should lead to an increase in the valuation.\" The analysts highlighted the company's 2024 drilling program, which has been initiated at both the La Plata and Keno Silver projects. \"This drilling initiative seeks to expand existing resources and evaluate the potential for new discoveries at the highest-priority, drill-ready targets,\" they stated. At Keno Silver, the focus will be on resource expansion at the Formo target, while at La Plata, the initial focus is on extending higher-grade mineralization at the Allard resource area. Couloir Capital also noted the recent top-up financing from  Newmont Corp. (NEM:NYSE) , viewing it as a positive development. \"We are encouraged to see additional share purchases from Newmont Corp. Newmont exercised its 'top-up right' to buy additional shares of MMG to maintain its 9.5% stake in the company,\" the analysts commented. \"We see this as a vote of confidence by a tier-1 miner in MMG's resource potential.\" Couloir Capital's fair value per share estimate of Blackwolf was updated to CA$0.47, representing a projected upside of 61.08% from the price at the time of the report of CA$0.29. Metallic Minerals' strategic plans include continuing exploration and resource expansion at both the Keno Silver and La Plata projects, as well as earning royalty monies on alluvial gold claims at its Australia Creek property near Dawson City, Yukon. With a Buy rating and a fair value estimate of CA$0.47, Couloir Capital sees significant potential in Metallic Minerals as the company advances its exploration projects and continues to expand its resource base. The analysts expect the 2024 drilling program to \"add significant ounces to the existing resources,\" potentially driving further value for shareholders.       Want to be the first to know about interesting  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Sign up to receive the  FREE  Streetwise Reports'  newsletter .         Important Disclosures:  Metallic Minerals Corp. is a billboard sponsor of Streetwise Reports and pays SWR a monthly sponsorship fee between US$4,000 and US$5,000.  This article does not constitute investment advice and is not a solicitation for any investment. Streetwise Reports does not render general or specific investment advice and the information on Streetwise Reports should not be considered a recommendation to buy or sell any security. Each reader is encouraged to consult with his or her personal financial adviser and perform their own comprehensive investment research. By opening this page, each reader accepts and agrees to Streetwise Reports' terms of use and full legal disclaimer. Streetwise Reports does not endorse or recommend the business, products, services or securities of any company.    For additional disclosures, please click here.  Disclosures for Couloir Capital, Metallic Minerals Corp., June 29, 2024  This report has been prepared by an analyst on contract with or employed by Couloir Capital Ltd. The analyst certifies that the views expressed in this report which include the rating assigned to the issuer's shares as well as the analytical substance and tone of the report accurately reflect his or her personal views about the subject securities and the issuer. No part of his / her compensation was, is, or will be directly or indirectly related to the specific recommendations. Couloir Capital Ltd. is affiliated with Couloir Securities Ltd., an Exempt Market Dealer. They shall be referred to interchangeably as Couloir Capital herein. Part of Couloir Capital's business is to connect mining compa- nies with suitable investors that qualify under available regulatory exemptions. Couloir Capital, its affiliates, and their respective officers, directors, representatives, researchers, and members of their families may hold positions in the companies mentioned in this document and may buy and/or sell their securities. Ad- ditionally, Couloir Capital may have provided in the past and may provide in the future, certain advisory or corporate finance services and receive financial and other incentives from issuers as consideration for the provision of such services. Couloir Capital has prepared this document for general information purposes only. This document should not be considered a solicitation to purchase or sell securities or a recommendation to buy or sell securities. The information provided has been derived from sources believed to be accurate but cannot be guaranteed. This document does not consider the particular investment objectives, financial situations, or needs of individual recipients and other issues (e.g. prohibitions to investments due to law, jurisdiction issues, etc.) which may exist for certain persons. Recipients should rely on their own investigations and take their own professional advice before making an investment. Couloir Capital will not treat recipients of this document as clients by virtue of having viewed this document. Company specific disclosures, if any  In the last 24 months, Couloir Capital Ltd. HAS been retained under a service agreement by the sub- ject  This service agreement includes analyst research coverage.  The views of the Analyst are No part of the Analyst's compensation was directly or indirectly related to the specific ratings as used by the research Analyst in the Reports. The Analyst DOES NOT maintain a financial interest in the securities or options of the Couloir Capital DOES NOT maintain a financial interest in the securities or options of the The information contained in the Reports is based upon publicly available information that the Analyst believes to be correct but has not independently verified with respect to truth or correctness.       Related Articles    Copper Appears To Have Bottomed  Source: Michael Ballanger (07/05/2024)   Michael Ballanger of GGM Advisory Inc. takes a look at the current state of copper and shares his recommendations for two stocks.  read more > Expert Says Silver and Gold Stock Looking Most Attractive  Source: Clive Maund (07/03/2024)   Technical Analyst Clive Maund takes a look at Outcrop Silver & Gold Corp. (OCG:TSX.V; OCGSF:OTCQX; MRG1:DB) to explain why he believes it is a Buy. read more > Gold Popping up Once Again  Source: Michael Ballanger (07/03/2024)   Michael Ballanger of GGM Advisory Inc. shares an update on the current state of the market, and one stock he has been keeping his eye on. read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona  Source: Streetwise Reports (07/03/2024)   World Copper Ltd. (WCU:TSX.V; WCUFF:OTCQX; 7LY0:FRA) has released an update on its Zonia copper-oxide project in Arizona, revealing new potential for re-processing mineralized material from historical mine operations. What does this mean for future projects in the region? read more > Assays Find More High-Grade Lithium-Boron Results in Nevada  Source: Streetwise Reports (07/03/2024)   Canter Resources Corp. (CRC:CSE; CNRCF:OTC; 601:FRA) announced more brine assay results from its 15-hole shallow Geoprobe drill program at its Columbus Lithium-Boron Project near Tonopah, Nevada. Find out why one expert says the results so far are a hit. read more >               Want to read more about  Gold ,  Silver ,  Base Metals  and  Critical Metals  investment ideas? Get Our Streetwise Reports Newsletter Free and be the first to know!  A valid email address is required to subscribe   URL        Recommended Articles    Copper Appears To Have Bottomed Source: Michael Ballanger (07/05/2024) read more > Expert Says Silver and Gold Stock Looking Most Attractive Source: Clive Maund (07/03/2024) read more > Gold Popping up Once Again Source: Michael Ballanger (07/03/2024) read more > Copper Company Touts Potential for Re-Processing at Zonia Project in Arizona Source: Streetwise Reports (07/03/2024) read more > Assays Find More High-Grade Lithium-Boron Results in Nevada Source: Streetwise Reports (07/03/2024) read more >                Have You Signed Up for Our Newsletter Yet?       No Thanks          AboutDisclaimerContactSponsorshipSyndicationCareersPolicies  (c) 2024 Streetwise Reports. All rights reserved. Streetwise Reports is registered with the U.S. Patent and Trademark Office.         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling - Surfrider Foundation",
    "Link": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnN1cmZyaWRlci5vcmcvbmV3cy9mZWRlcmFsLWJpbGxzLWNhbGwtZm9yLWRhbWFnaW5nLWZ1bmRpbmctY3V0cy1hbmQtaGFybWZ1bC1vZmZzaG9yZS1kcmlsbGluZ9IBdWh0dHBzOi8vd3d3LnN1cmZyaWRlci5vcmcvbmV3cy9mZWRlcmFsLWJpbGxzLWNhbGwtZm9yLWRhbWFnaW5nLWZ1bmRpbmctY3V0cy1hbmQtaGFybWZ1bC1vZmZzaG9yZS1kcmlsbGluZz9oc19hbXA9dHJ1ZQ?oc=5",
    "Published": "Tue, 02 Jul 2024 21:11:15 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "   Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling                                       Skip to content (press enter)           07.02.24   Federal Bills Call for Damaging Funding Cuts and Harmful Offshore Drilling   By Katie Day              Each year, Congress must draft and agree upon a budget to fund the federal government. The intent of these appropriation bills is to provide funding that federal agencies need to accomplish their mandates and fund important programs. However, the first round of the Fiscal Year (FY) 2025 budget bills to pass out of House Committees last week are riddled with extensive budget cuts to ocean and coastal management programs that the public rely on for clean water and healthy beaches. The bills also include harmful policy provisions, known as \"policy riders\", that have no business being in a budget bill!  Some of the most concerning policy riders in the House Fiscal Year 2025 budget bills include  mandates for new oil and gas leasing, prohibitions on the establishment of important protected areas for wildlife and natural ecosystems , and  limitations that hinder federal agency ability to regulate polluters ; putting water quality, air quality, and the climate at risk. For decades, Surfrider has fought to protect annual funding levels for important ocean and coastal programs. These include programs to support ocean research, protect ocean and coastal habitats, help communities prepare for coastal hazards, test water quality to keep people safe at the beach, and more. Two of the key federal agencies that administer these programs are the Environmental Protection Agency (EPA) and National Oceanic and Atmospheric Administration (NOAA), yet the House budget bills call for a  20 percent funding cut to the EPA , and a  12 percent funding cut to NOAA . While this is a very concerning way to start off the 2025 appropriations process, all is not lost.   Your voice can make a difference!   Click here to contact your federal representatives  and urge them to oppose these funding cuts and dangerous policy riders in order to protect communities, wildlife, the environment, and our ocean and coasts!  FY 2025 House Appropriation Bills: The Bad   Coastal water quality at risk to more sewage spills.  Funding levels for each program administered by the EPA have yet to be released, but a reduction in topline funding of 20 percent (not accounting for inflation!) does not bode well for EPA programs that are critical for protecting water quality, coastlines, and beachgoers in light of increasing climate change impacts. For instance, the  Interior, Environment and Related Agencies Appropriations bill  allocates just $1.2 billion to the Clean Water State Revolving Fund, roughly one third of the authorized level. Accounting for the hefty earmarks to specific projects, that's just $649 million to the actual fund, which is a  critical EPA program  that states rely on to fund wastewater infrastructure upgrades in order to prevent sewage spills.    Ocean ecosystems, community resilience, and coastal hazard preparedness threatened.  The  Commerce, Justice, Science and Related Agencies Appropriations bill  cuts funding to NOAA by 12 percent. While we don't have all the details of funding levels for each NOAA-administered program just yet, a notable topline funding cut means important programs like Coastal Zone Management, Sea Grant, Marine Sanctuaries and Protected Areas, and more could be at risk. These programs are designed to fund ocean and coastal research that keep communities safe, enhance coastal resilience, and help prepare against severe weather events.    Marine wildlife and coastal communities exposed to dangerous offshore oil and gas drilling.   Offshore oil and gas drilling  exacerbates climate change by producing fossil fuels, pollutes coastal waters with heavy metals and chemicals, and ultimately results in heart-wrenching oil spills that harm marine wildlife and coastal communities. The Interior, Environment and Related Agencies Appropriations bill includes requirements for new oil and gas lease sales and limits much needed protections for marine mammals from harm caused by offshore energy leasing.    Protections limited for at risk wildlife and ecosystems.  The Interior, Environment and Related Agencies Appropriations bill stops the Biden Administration's effort to protect 30 percent of our nation's lands and waters by 2030, known as the 30x30 Initiative, and weakens the Endangered Species Act.    The nation's ability to regulate polluters and respond to the climate crisis hindered.  The Interior, Environment and Related Agencies Appropriations bill blocks the EPA from enforcing the recently established methane fee on fossil fuel producers and prevents federal agencies from accounting for climate change impacts by blocking the use of the Social Cost of Carbon in cost benefit analyses. The bill also removes the ability of the National Environmental Protection Act to require the consideration of climate change efforts in permitting. Finally, the bill minimizes the ability of agencies to oversee and limit pollution from chemical and pesticide manufacturers.    National environmental justice initiatives blocked.  The Interior, Environment and Related Agencies Appropriations bill defunds important environmental justice programs, including the American Climate Corps, Climate Justice Alliance, and eco grief counseling. The bill also prohibits the Biden Administration's executive orders on diversity, equity, and inclusion from being implemented.   FY 2025 House Appropriation Bills: The Hopeful   Funding to address to the Tijuana River Valley water quality and environmental justice crisis.  The  State, Foreign Operations, and Related Programs Appropriations bill  includes record funding for the International Boundary and Water Commission, which will support essential maintenance and infrastructure upgrades at the International Wastewater Treatment plant at the US/Mexico border. This is a  priority campaign  for the Surfrider Foundation and our San Diego Chapter.    Full funding to the Land and Water Conservation Fund . While permanent, full funding to the Land and Water Conservation Fund is required thanks to the Great Americans Outdoors Act (a bill  Surfrider helped pass  in 2020!), last year millions of dollars were \"rescinded\" from the program during the appropriations process. We're grateful to see House Committee members include full funding to this important program.    There are still many steps to go before becoming final!  These bills have only passed their various House Committees. Each of these appropriation bills will also need to be voted on by the full House of Representatives and confer with the Senate before the budget is finalized. The Senate versions are still in development but are expected to be more protective of funding levels and not include these harmful policy riders.    The fight isn't over.  Surfrider will continue to fight back to get funding levels restored for critical ocean and coastal programs in the Fiscal Year 2025 budget. Surfrider will also work diligently to prevent these harmful policy riders from becoming law.   Surfrider will continue to advocate for federal protections, funding and support for our ocean and coasts.  From  hosting fly-ins to Washington, D.C . to arranging in district field visits so Congressmembers and their staff can see the issues first hand, to submitting testimony to Congressional Committees throughout the year; Surfrider will not stop until these funding levels are restored and dangerous policies are avoided.  Not a Surfrider member? Become one today and join the movement!       ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New ... - Newsfile",
    "Link": "https://news.google.com/rss/articles/CBMiqwFodHRwczovL3d3dy5uZXdzZmlsZWNvcnAuY29tL3JlbGVhc2UvMjE1Mjc1L05pY29sYS1NaW5pbmctQW5ub3VuY2VzLUNvbXBsZXRpb24tb2YtM0QtSVAtU3VydmV5LWFuZC1Db21tZW5jZW1lbnQtb2YtRXhwbG9yYXRpb24tRHJpbGxpbmctYXQtdGhlLU5ldy1DcmFpZ21vbnQtQ29wcGVyLVByb2plY3TSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 13:00:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "       Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project                                              Cookie Settings  We use cookies to analyze user behavior in order to constantly improve the website for you. Learn more. Accept All Accept Selection Reject All   Necessary Analytics              Login    Search       Search       en fr de es                   Vancouver, British Columbia--(Newsfile Corp. - July 3, 2024) -  Nicola Mining Inc. (TSXV: NIM)  (the \" Company \" or \" Nicola \") is pleased to announce the completion of a 3D induced polarization survey (\" 3D IP Survey \"). Based on 3D IP Survey results the Company is in the process of commencing of its 2024 diamond drilling program (\" Program \") at the New Craigmont Copper Project (\" New Craigmont \"), situated approximately 11 kilometres from Merritt, BC and adjacent to Teck Resources Ltd.'s Highland Valley Copper, Canada's largest open-pit copper mine.As previously announced in the Company's Feb. 21, 2024 and May 13, 2024 news releases, Nicola engaged Dias Geophysical of Saskatoon, SK, to conduct a 3D IP Survey. This comprehensive survey aimed to better define two principal exploration areas: the MARB-CAS Zone and the West Craigmont Zone (Figure 1). Upon reviewing the data from the approximately 6.5 square kilometer survey, the Company has commenced its 2024 diamond drilling exploration program. Figure 1 . 2024 IP Survey AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_001full.jpgA significant resistivity anomaly appears in the western section of New Craigmont, near the Lornex Fault, via the Company's 2022 ZTEM Survey. This anomaly was confirmed and refined by the 2024 3D IP Survey. Additionally, the Survey detected chargeability anomalies on the edges of the resistivity anomaly within the area, and a potential structure trending ENE, which coincides with the strongest and largest chargeability anomaly. This resistivity high could represent a felsic intrusion, as was observed in outcrop, and the chargeability high could indicate peripheral sulphidation, likely enhanced along the potential structure. The 3D IP Survey has generated multiple drilling targets focusing on the chargeability anomalies within the West Craigmont Zone.The 3D IP Survey at MARB-CAS provided valuable information regarding the lithologies and appears to clearly delineate the contact between Nicola Group rocks and the Guichon Creek Batholith. The major chargeability anomalies are primarily confined within the Nicola Group rocks in the southern portion of the survey area, with some chargeability anomalies detected between the MARB and CAS MINFILE showings.Peter Espig, Chief Executive Officer, commented, \"The 3D IP Survey both confirmed and further defined key targets. Combining numerous geological and geophysical parameters, including bedrock mapping, airborne magnetic survey, and ZTEM survey with the 3D IP Survey gives us a great confidence to have a successful Program.\"A total of 5,000 m of core drilling is planned for the 2024 exploration program. Drilling will primarily be focused on the West Craigmont Zone initially, with the possibility of also drilling at MARB/CAS later in the summer (Figure 2). Figure 2 . 2024 Drill Target AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_002full.jpg Qualified Person William Whitty, P. Geo., the Company's VP Exploration, is the Qualified Person as defined by National Instrument 43-101 -  Standards of Disclosure for Mineral Projects  and supervised the preparation of, and has reviewed and approved, the technical information in this release. About Nicola Mining Nicola Mining Inc. is a junior mining company listed on the Exchange and Frankfurt Exchange that maintains a 100% owned mill and tailings facility, located near Merritt, British Columbia It has signed Mining and Milling Profit Share Agreements with high grade gold projects. Nicola's fully permitted mill can process both gold and silver mill feed via gravity and flotation processes.The Company owns 100% of the New Craigmont Project, a high-grade copper property, which covers an area of over 10,800 hectares along the southern end of the Guichon Batholith and is adjacent to Highland Valley Copper, Canada's largest copper mine. The Company also owns 100% of the Treasure Mountain Property, which includes 30 mineral claims and a mineral lease, spanning an area exceeding 2,200 hectares.On behalf of the Board of Directors \" Peter Espig \"  Peter EspigCEO & Director For additional information Contact: Peter EspigPhone: (778) 385-1213 Email: info@nicolamining.comURL: www.nicolamining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/215275        Get News by Email  Analyst, journalist, or company stakeholder? Sign up to receive news releases by email for Nicola Mining Inc. or all companies belonging to the Mining and Metals industry.  Sign Up    Recent News  Company Profile   Articles from Newsfile        Apr 23, 2024       PR and Climate ESG: How to Adapt Your Press Releases to New SEC Rules     Learn how to adapt your SEC Climate ESG press releases to comply with new regulations using our essential guide.          Hashtags   Subjects  Economy, Business and Finance Metal and Mineral Mining    Similar Stories               Tell Us Your Story      Learn More                    Treating you-and your story-with courtesy and care. Our commitment to delivering the best personal service defines our business and inspires our efforts every day. We're accessible and responsive to every client we serve, using cutting-edge technology and innovation makes it easier for us to focus on relationship building. The way we see it, a helpful voice on the phone is always welcomed. In addition to respecting you, Newsfile is respected as an accredited source of business news-making every story we handle become trusted for retail and institutional investment decisions.Complete the form to the right and a customer service representative will contact you to answer your questions.         x    Name *     Company *     Email *     Phone     Message *      Send Message                       x Login     Incorrect username/password.       Username     Password       Login         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Alaska Native tribes sue feds over limits on drilling in National Petroleum Reserve - Courthouse News Service",
    "Link": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvdXJ0aG91c2VuZXdzLmNvbS9uYXRpdmUtYWxhc2thLXRyaWJlcy1zdWUtZmVkcy1vdmVyLWxpbWl0cy1vbi1kcmlsbGluZy1pbi1uYXRpb25hbC1wZXRyb2xldW0tcmVzZXJ2ZS_SAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 23:21:02 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "Google NewsOpening https://www.courthousenews.com/native-alaska-tribes-sue-feds-over-limits-on-drilling-in-national-petroleum-reserve/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvYWRub2MtZXhwYW5kcy16YWt1bS1vZmZzaG9yZS1kcmlsbGluZy1mbGVldC1vdXRwdXQtYm9vc3QtZnJvbS0yMDI2LTI2NTEwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 11:41:44 GMT",
    "Categories": [
      "Production Updates",
      "Exploration"
    ],
    "Content": "      Adnoc expands Zakum offshore drilling fleet, output boost from 2026             Adnoc expands Zakum offshore drilling fleet, output boost from 2026   Crude Oil   3 Jul 2024   The UAE's energy giant Adnoc is set to boost production from the giant offshore Zakum field with a further ramp up...    Please Register or Sign in to view this content. Quantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon and ammonia markets. Quantum Oil service subscribers have access to:  Daily price assessments Market news and price commentary Fundamental trade data Quantum Energy Daily - market report sent to your email  Get in touch with us for subscription information on all Quantum platforms, or help with the service.      Related         Adnoc lifts Murban exports, Ruwais refinery processes more Upper Zakum   Crude Oil Refined Products   1 Apr 2024   UAE oil company Adnoc has boosted volumes of the medium sour Upper Zakum crude supplied into its giant Ruwais refining complex...           Adnoc L&S awarded contract for new Lower Zakum island   Crude Oil   8 Jun 2023   The recently listed Adnoc Logistics and Services has been awarded its first major contract...           Adnoc awards $412m drilling contract for Upper Zakum expansion   Crude Oil   14 Apr 2023   The UAE's energy powerhouse Adnoc has awarded a contract to its subsidiary, Adnoc Drilling, to provide...              ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly ... - StockTitan",
    "Link": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnN0b2NrdGl0YW4ubmV0L25ld3MvU0lUS0Yvc2l0a2EtZXhwYW5kcy1leHBsb3JhdGlvbi1wcm9ncmFtLWF0LWl0cy1yYy1nb2xkLXByb2plY3QtaW4teXVrb24tdG8tdGdhMzJwZnlpdGMwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 12:30:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "                                  Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property | SITKF Stock News                               Login  Please enter your login and password   Wrong username or password.     Email address     Password   Forgot password?   LOGIN Close     Don't have an account? Sign Up!                            Forgot Password  Please enter your email address   An email has been sent to your address with instructions for changing your password.     There is no user registered with this email.     Email address     RECOVER Close                            Sign Up  To create a free account, please fill out the form below.   Thank you for signing up! A confirmation email has been sent to your email address. Please check your email and follow the instructions in the message to complete the registration process. If you do not receive the email, please check your spam folder or contact us for assistance. Welcome to our platform!     Oops! Something went wrong while trying to create your new account. Please try again and if the problem persist, Email Us to receive support.     Username     Email address     Password      I accept the user agreement       Sign me up for the newsletter      CREATE ACCOUNT Close     Already have an account? Login                   Home     News    SITKF        Trending News           CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...           OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program           ERIC   Ericsson and OPPO sign global patent cross license agreement           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                       CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...                   OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program                   ERIC   Ericsson and OPPO sign global patent cross license agreement           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                     Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property          Rhea-AI Impact    (Neutral)        Rhea-AI Sentiment    (Negative)        Tags      acquisition                Rhea-AI Summary     Sitka Gold has initiated its 2024 exploration at the newly acquired Clear Creek property in Yukon, incorporating diamond drilling and additional geochemical surveys, geological mapping, and data integration. The first diamond drilling in Rhosgobel Intrusion since 1995 aims to extend findings from historical drilling. Soil sampling and geological mapping are underway to explore high-potential zones south of the Blackjack deposit and the newly acquired Clear Creek claims. Previous exploration data indicates multiple gold targets with promising results, setting the stage for potentially significant discoveries.         Positive   Initiation of the 2024 exploration program at Clear Creek, including diamond drilling. First diamond drilling at Rhosgobel Intrusion since 1995 aims to extend historical gold findings. Integration of extensive historical datasets to accelerate new gold discoveries. Geochemical surveys and geological mapping to explore high-potential zones for gold deposits. Positive historical drilling results with significant gold intersections at multiple targets.       Negative   None of the historically reported assay results from Clear Creek have been verified by Sitka.           07/03/2024 - 08:30 AM   2024 exploration has begun on the newly acquired Clear Creek property First diamond drilling program ever to be completed on the Rhosgobel Intrusion since historical shallow reverse circulation drilling in 1995 to follow up on holes 95-15 which intersected 50.3 m of 1.07 g/t gold and 95-16 which intersected 67.1 m of 1.03 g/t gold with both holes ending in strong gold mineralization. Grid geochemistry currently underway to infill gaps to the south of the Blackjack deposit on the high potential Pukelman West intrusion and G2 zone on the newly acquired Clear Creek claims. Integration of newly acquired datasets (geological, geophysical, geochemical) with Sitka Gold data. Geological mapping and prospecting following up on the high grade G2 zone, Contact zone and other highly prospective gold targets.   VANCOUVER, BC / ACCESSWIRE / July 3, 2024 / Sitka Gold Corp. (\"Sitka\" or the \"Company\") (TSXV:SIG)(FSE:1RF)(OTCQB:SITKF)  is pleased to announce that it has expanded the planned 2024 exploration program at its contiguous, 431 square kilometre RC Gold Project (\"RC Gold\" or the \"Project\") in Yukon to include diamond drilling and additional soil geochemistry surveys, geological mapping, prospecting and data integration and analysis on its newly acquired Clear Creek property (\"Clear Creek\") claims that complete the consolidation of the Clear Creek Intrusive Complex (see Figure 1). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program for 2024. \"The accumulation of data from several years of systematic exploration by previous operators on the newly acquired Clear Creek Property has generated several high-quality exploration targets,\"  said Cor Coe, Director and CEO of Sitka Gold.  \"The newly acquired claims cover at least three intrusion related gold targets that are geologically similar to our developing Blackjack gold deposit and the team is very excited to begin assessing the property by testing the Rhosgobel intrusion, where historical work strongly indicates the potential for the presence of a multi-million ounce gold deposit. Sitka's initial discovery of the Blackjack and Eiger gold deposits came about through a similar process of review and compilation of a large historical database and we see the ability to accelerate the discovery of additional gold deposits by utilizing our growing knowledge of the intrusion-related gold systems in this area in conjunction with the comprehensive Clear Creek data-set as we continue our exploration activities across this emerging mining district.\" The newly consolidated Project includes four high-priority areas that have had previous reverse circulation and/or diamond drilling that require additional drilling. These areas are the Rhosgobel intrusion where historical drilling intersected up to  1.03 g/t gold over 67.1 m  , the Contact zone with drill results up to  20.3 g/t gold over 10.7 m  , the Bear Paw Breccia which intersected up to  1.87 g/t gold over 42.6 m  and the Pukelman intrusion with results of  1.20 g/t gold over 10.0 m  (see Figure 2, Table 1). The first target area to be tested is the Rhosgobel Intrusion where shallow historical drilling in 1995 by Kennecott outlined a large area of intrusion related gold mineralization (see Figure 3). Previous drilling at Rhosgobel was limited to a vertical depth of approximately 60 metres. The gold mineralization observed at Rhosgobel is sheeted quartz veins hosted in a megacrystic quartz monzonite similar to the Blackjack deposit located 5 km to the north along the recently discovered Blackjack Mineralized Corridor. The first drill hole will be a step out to drill underneath the mineralized zone intersected in Holes 15 and 16 in shallow reverse circulation drilling (see Figure 4). This will be the first diamond drill hole ever drilled in the Rhosgobel intrusion. Geological interpretation of a steeply dipping mineralized zone is consistent with controls on mineralization observed elsewhere on the property.The Company has recently engaged GroundTruth Exploration to conduct grid based soil sampling in an area south of the Blackjack deposit where prospecting in 2015 identified a highly prospective area. The G2 zone was prospected in 2015 and 13 surface float samples were collected with a range of trace to  43.4 g/t gold  (see Figure 5) within mineralized intrusive and metasedimentary rocks. Three other samples returned values of  5.9, 7.2 and 13.6 g/t gold  . This area is located approximately 2 km south of the Blackjack gold deposit area, within the Blackjack Mineralized Corridor in proximity to the West Pukelman intrusion. Previous reconnaissance scale soil sampling encountered anomalous gold in soil in the area. The G2 zone is located approximately 1 km west of the Pukelman West intrusion within an extensional corridor containing both the Pukelman and Pukelman West intrusions and several previously reported lamprophyre dykes. The Pukelman West intrusion is located approximately 1.5 km south of the Blackjack deposit where recent drilling has intersected higher-grade mineralization associated with the N-S trending Blackjack fault. The intersection of these structural zones is interpreted by Sitka to be highly prospective for the discovery of additional gold mineralization.Prospecting in 2015 also focused on the Contact zone located at the southern margin of the Pukelman intrusion. Nineteen samples were collected ranging from trace to  166.2 g/t gold  . Seven additional samples of mainly quartz vein material taken from float and outcrop assayed above 1.0 g/t gold including  86.0, 31.8, 47.2, 27.4, 18.1, 2.8, and 1.5 g/t gold  (see Figure 5). The sampling indicates that the extent of the Contact zone could be much larger than the area previously drilled. Additional mapping and prospecting is planned to refine drill targets in anticipation of drilling this area.Geological mapping and prospecting in the G2 to Pukelman West corridor and along the Blackjack fault mineralized corridor from the Blackjack deposit south through the Pukelman West and Rhosgobel intrusion for additional areas of undiscovered gold mineralization will also be conducted with the goal of identifying additional drill targets.Recently acquired data encompassing the southern portion of the Clear Creek Intrusive Complex is being integrated within the Sitka database and plans for drilling additional known areas of mineralization are being developed.  Figure 1 -  The acquisition of the Clear Creek property now completes Sitka Gold's 100% ownership of the Clear Creek Intrusive Complex and adds several underexplored areas that have strong potential for new gold discoveries in addition to four high-quality drill targets.   Figure 2 -  The purchase of the Clear Creek Property (outlined in yellow boundary) now completes Sitka Gold's ownership of 100% of the Clear Creek Intrusive Complex, an area of approximately  8 km x 15 km  that includes several known surface intrusions with associated gold mineralization. The newly acquired property contains four highly prospective areas with limited historical drilling and several areas that have produced high-grade surface samples but remain under-explored and undrilled.   Figure 3 -  Shallow reverse circulation drilling in the Rhosgobel intrusion in 1995 produced numerous intersections of gold mineralization consisting of sheeted quartz veins with megacrystic quartz monzonite. Holes 15 and 16 were drilled in opposite directions at 60 degrees dip intersected mineralization over their entire lengths. The holes intersected  50.3 m grading 1.07 g/t gold  and  67.1m of 1.03 g/t gold  respectively with both holes ending in mineralization.   Figure 4  -  Cross-section of previous drilling at Rhosgobel along holes 15 and 16 which ended in mineralization. The first ever diamond drill hole proposed in the Rhosgobel intrusion (PROS-24-A) will step back and drill underneath holes 15 and 16 to test the width of the mineralized zone intersected in 1995.   Figure 5  -  Prospecting in 2015 was conducted in the G2 zone and the Contact Zone and produced many high-grade results. Additional grid soil sampling (shown in Figure 2) will be conducted in these areas and south where previous soil sampling has been conducted at only wide spacings. Current drilling is expanding the Blackjack deposit to the south towards this highly prospective area. Table 1: Significant drill hole results from the Clear Creek Property   *Intervals are drilled core length, as insufficient drilling has been completed at this time to determine true widths Table References  Robinson, S.D. and R. A. Doherty, 1988. Geological, Geochemical, Geophysical and Diamond Drilling 1988 Summary Report on the Rum, Rye and Roll Claims ((assessment report 092748)  Feulgen, S. and J.C. Stephen, 1989, Initial Diamond Drilling Report on the Rain, Wind, Sleet Claims, Left Clear Creek, Yukon (assessment report 092752)  Bidwell, G., 1993. Clear Creek Project, 1992 Reverse Circulation Drill Program (assessment report 093097)  Coombes, S., 1995. 1995 Assessment Report on the Clear Creek Option; prepared by Kennecott Canada Inc. (assessment report 093372).  Stammers, M.A., 2000. 1999 Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 094058)  Weeks, S. and R. Falls, 2001, 2000 Geological, Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 94165)  O'Brien, 2010;Assessment Report, 2010 Diamond Drilling Program, Clear Creek Property (Assessment report 095539)  Shutty, 2011; Assessment Report, 2011 Exploration Program, Clear Creek Property (Assessment Report 095984)  The Company cautions that none of the historically reported assay results from the newly acquired Clear Creek property have been verified by Sitka. About the Flagship RC Gold Project The RC Gold Project consists of a 431 square kilometre contiguous district-scale land package located in the heart of Yukon's Tombstone Gold Belt. The project is located approximately 100 kilometres east of Dawson City, which has a 5,000 foot paved runway, and is accessed via a secondary gravel road from the Klondike Highway which is usable year-round and is an approximate 2 hour drive from Dawson City. It is the largest consolidated land package strategically positioned mid-way between Victoria Gold's Eagle Gold Mine - Yukon's newest gold mine which reached commercial production in the summer of 2020 - and Victoria Gold's former producing Brewery Creek Gold Mine.On January 19, 2023 Sitka Gold announced an Initial Mineral Resource Estimate prepared in accordance with National Instrument 43-101 (\"NI 43-101\") guidelines for the RC Gold Property of  1,340,000  ounces of gold  (1)  . The road accessible, pit constrained Mineral Resource is classified as inferred and is contained in two zones: The Blackjack and Eiger deposits. Both of these deposits are at/near surface, are potentially open pit minable and amenable to heap leaching, with initial bottle roll tests indicating that the gold is not refractory and has  high gold recoveries of up to 94%  with minimal NaCN consumption (see News Release July 13, 2022). The Mineral Resource estimate is presented in the following table at a base case cut-off grade of 0.25 g/t Au: RC Gold Inferred Mineral Resource Estimate COG g/t Au Blackjack Zone   Eiger Zone   Combined Tonnes 000's Au g/t 0z Au 000's   Tonnes 000's Au g/t 0z Au 000's   Tonnes 000's Au g/t 0z Au 000's 0.2035,7980.80921 32,5230.45471 68,3210.631,391 0.25 33,743 0.83 900   27,362 0.50 440   61,105 0.68 1,340 0.3031,2820.88885 22,2530.55393 53,5350.741,2790.3529,0650.92860 17,8170.60344 46,8820.801,2030.4026,9750.96833 14,5060.66308 41,4810.861,140Notes  Mineral resource estimate prepared by Ronald G. Simpson of GeoSim Services Inc. with an effective date of January 19, 2023. Mineral Resources are classified using the 2014 CIM Definition Standards.  The cut-off grade of 0.25 g/t Au is believed to provide a reasonable margin over operating and sustaining costs for open-pit mining and processing  Mineral resources are constrained by an optimised pit shell using the following assumptions: US $1800/oz Au price; a 45 degrees pit slope; assumed metallurgical recovery of 85%; mining costs of US$2.00 per tonne; processing costs of US$8.00 per tonne; G&A of US$1.50/t. Mineral resources are not mineral reserves and do not have demonstrated economic viability.  Totals may not sum due to rounding.  To date, 56 diamond drill holes have been drilled into this system for a total of approximately 19,962 metres including 16 drill holes totalling 6,515 metres completed in 2023 focused on expanding the initial resource. The drilling in 2023 produced results of up to  219.0 m of 1.34 g/t gold  including  124.8 m of 2.01 g/t gold  and  55.0 m of 3.11 g/t gold  in drill hole DDRCCC-23-047 at Blackjack (see news release dated September 26, 2023). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program.  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  RC Gold Deposit Model Exploration on the Property has mainly focused on identifying an intrusion-related gold system (\"IRGS\"). The property is within the Tombstone Gold Belt which is the prominent host to IRGS deposits within the Tintina Gold Province in Yukon and Alaska. Notable deposits from the belt include: Fort Knox Mine in Alaska with current Proven and Probable Reserves of 230 million tonnes at 0.3 g/t Au (2.471 million ounces; Sims 2018)  (1)  ; Eagle Gold Mine with current Measured and Indicated Resources of 233 million tonnes at a grade of 0.57 g/t Au at the Eagle Main Zone (4.303 million ounces; Harvey et al, 2022)  (2)  ; the Brewery Creek deposit with current Indicated Mineral Resource of 22.2 million tonnes at a gold grade of 1.11 g/t (0.789 million ounces; Hulse et al. 2020)  (3)  ; the Florin Gold deposit, located adjacent to Sitka's RC Gold project, with a current Inferred Mineral Resource of 170.99 million tonnes grading 0.45 g/t (2.47 million ounces; Simpson 2021)  (4)  and the AurMac Project with an Inferred Mineral Resource of 347.49 million tonnes grading 0.63 gram per tonne gold (7.00 million ounces)  (5)  .  Sims J. Fort Knox Mine Fairbanks North Star Borough, Alaska, USA National Instrument 43-101 Technical Report. June 11, 2018. https://s2.q4cdn.com/496390694/files/doc_downloads/2018/Fort-Knox-June-2018-Technical-Report.pdf  Harvey N., Gray P., Winterton J., Jutras M., Levy M.,Technical Report for the Eagle Gold Mine, Yukon Territory, Canada. Victoria Gold Corp. December 31, 2022. https://vgcx.com/site/assets/files/6534/vgcx_-_2023_eagle_mine_technical_report_final.pdf  Hulse D, Emanuel C, Cook C. NI 43-101 Technical Report on Mineral Resources. Gustavson Associates. May 31, 2020. https://minedocs.com/22/Brewery-Creek-PEA-01182022.pdf  Simpson R. Florin Gold Project NI 43-101 Technical Report. Geosim Services Inc. April 21, 2021. https://sedar.com/GetFile.do?lang=EN&docClass=24&issuerNo=00005795&issuerType=03&projectNo=03236138&docI d=4984158  Banyan Gold News Release Dated February 7, 2023 (Technical Report to be filed within 45 days of news release) https://banyangold.com/news-releases/2024/banyan-announces-7-million-ounce-gold-updated-mineral-resource-estimate-aurmac-project-yukon-canada/  Upcoming Events Sitka Gold will be attending and/or presenting at the following events*: Takestock Investor Forum, Stampede Event, Calgary, Alberta: July 3, 2024  Kelowna Capital Events, Kelowna, BC: July 19 - 21, 2024  Precious Metals Summit, Beaver Creek, Colorado: September 10 - 13, 2024  Yukon Geoscience, Whitehorse, Yukon: November 17 - 20, 2024 *All events are subject to change. About Sitka Gold Corp. Sitka Gold Corp. is a well-funded mineral exploration company headquartered in Canada. The Company is managed by a team of experienced industry professionals and is focused on exploring for economically viable mineral deposits with its primary emphasis on gold, silver and copper mineral properties of merit. Sitka is currently exploring its 100% owned, 431 square kilometre flagship RC Gold Project within the Tombstone Gold Belt in the Yukon Territory with a 15,000 metre diamond drill program planned for 2024. The Company is also advancing the Alpha Gold Project in Nevada and currently has drill permits for its Burro Creek Gold and Silver Project in Arizona and the Coppermine River Project in Nunavut.The Company recently announced an NI 43-101 compliant  initial inferred Mineral Resource Estimate of 1,340,000 ounces of gold   (1)  beginning at surface and grading 0.68 g/t at its RC Gold Project in Yukon (see news release dated January 19, 2023).  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  *For more detailed information on the underlying properties please visit our website at www.sitkagoldcorp.comThe scientific and technical content of this news release has been reviewed and approved by Cor Coe, P.Geo., Director and CEO of the Company, and a Qualified Person (QP) as defined by National Instrument 43-101.ON BEHALF OF THE BOARD OF DIRECTORS OFSITKA GOLD CORP. \"   Donald Penner   \"  President and DirectorFor more information contact: Donald Penner  President & Director778-212-1950dpenner@sitkagoldcorp.comor Cor Coe  CEO & Director604-817-4753ccoe@sitkagoldcorp.comNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary and Forward-Looking Statements This release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". This information and these statements, referred to herein as \"forward-looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, the use of the proceeds raised under the Offering and the Company's anticipated work programs. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will complete its anticipated work programs and use the proceeds of the Offering as currently anticipated. These forward-looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, market uncertainty, the results of the Company's anticipated work programs and that the Company will not use the proceeds of the Offering as currently anticipated. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor. SOURCE:  Sitka Gold CorpView the original press release on accesswire.com     FAQ       What is Sitka Gold's 2024 exploration program at Clear Creek?    Sitka Gold's 2024 exploration program at Clear Creek includes diamond drilling, additional geochemical surveys, geological mapping, and data integration to explore high-potential gold zones.        What are the historical drilling results at Rhosgobel Intrusion?    Historical drilling at Rhosgobel Intrusion in 1995 intersected 50.3 m of 1.07 g/t gold and 67.1 m of 1.03 g/t gold, with both holes ending in strong gold mineralization.        What is the significance of the newly acquired Clear Creek property?    The newly acquired Clear Creek property consolidates Sitka Gold's ownership, adds multiple high-potential gold targets, and integrates historical data to accelerate new discoveries.        What are the key targets in Sitka Gold's 2024 drilling program?    Key targets include the Rhosgobel Intrusion, the Contact zone, the Bear Paw Breccia, and the Pukelman intrusion, all showing promising historical drilling results.        What are the expected outcomes of Sitka Gold's exploration at Clear Creek?    Sitka Gold aims to identify and expand gold deposits by leveraging historical data and conducting comprehensive exploration activities, potentially leading to significant new gold discoveries.         Sitka Gold Corp. OTC:SITKF        SITKF Rankings     N/A  Ranked by Market Cap   N/A  Ranked by Dividends         SITKF Latest News       Jun 24, 2024  Sitka Announces Expansion of RC Gold Project with Acquisition of Victoria Gold's Clear Creek Property, Yukon      Jun 13, 2024  Sitka Resumes Drilling at Its RC Gold Project, Yukon      May 23, 2024  Sitka Gold Drills 154.0 Metres of 1.47 g/t Gold Including 37.0 Metres of 3.07 g/t Gold and 8.0 Metres of 4.61 g/t Gold at its RC Gold Project, Yukon      May 1, 2024  Sitka Gold Drills 191.0 Metres of 1.16 g/t Gold Including 89.0 Metres of 2.03 g/t Gold and 11.0 Metres of 5.80 g/t Gold at its RC Gold Project, Yukon      Apr 30, 2024  Sitka to Complete Acquisition of 100% Ownership of its Flagship RC Gold Project, Yukon          SITKF Stock Data       Market Cap 29.76M     Float 214.51M     Insiders Ownership 13.48%     Institutions Ownership 4.98%     Industry Gold Ore Mining      Sector Mining, Quarrying, and Oil and Gas Extraction     Website Link     Country United States of America     City Vancouver         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Forge Resources Advances Exploration with Successful Drilling and Funding - TipRanks.com - TipRanks",
    "Link": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRpcHJhbmtzLmNvbS9uZXdzL2NvbXBhbnktYW5ub3VuY2VtZW50cy9mb3JnZS1yZXNvdXJjZXMtYWR2YW5jZXMtZXhwbG9yYXRpb24td2l0aC1zdWNjZXNzZnVsLWRyaWxsaW5nLWFuZC1mdW5kaW5n0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 16:00:33 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "Google NewsOpening https://www.tipranks.com/news/company-announcements/forge-resources-advances-exploration-with-successful-drilling-and-funding",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Rig arrives in Canada ready to ignite key exploration campaign - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMidGh0dHA6Ly93d3cudXBzdHJlYW1vbmxpbmUuY29tL2V4cGxvcmF0aW9uL3JpZy1hcnJpdmVzLWluLWNhbmFkYS1yZWFkeS10by1pZ25pdGUta2V5LWV4cGxvcmF0aW9uLWNhbXBhaWduLzItMS0xNjcyMDM20gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 14:02:46 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Rig arrives in Canada ready to launch key exploration campaign | Upstream                                                                                                                              Exploration Rig arrives in Canada ready to launch key exploration campaign Hercules semisub will drill two wells for EquinorHercules drilling rig arrives in Bay Bulls in Newfoundland & Labrador, Canada.Photo: ROB STRONG Iain Esau Africa CorrespondentLondon   EquinorCanadaNewfoundland & Labrador Published 3 July 2024, 13:57Updated 3 July 2024, 16:06  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New ... - StockTitan",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnN0b2NrdGl0YW4ubmV0L25ld3MvSFVTSUYvbmljb2xhLW1pbmluZy1hbm5vdW5jZXMtY29tcGxldGlvbi1vZi0zZC1pcC1zdXJ2ZXktYW5kLWNvbW1lbmNlbWVudC1wZnc1Nnd1bXJoNDAuaHRtbNIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 13:00:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "                                  Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project | HUSIF Stock News                               Login  Please enter your login and password   Wrong username or password.     Email address     Password   Forgot password?   LOGIN Close     Don't have an account? Sign Up!                            Forgot Password  Please enter your email address   An email has been sent to your address with instructions for changing your password.     There is no user registered with this email.     Email address     RECOVER Close                            Sign Up  To create a free account, please fill out the form below.   Thank you for signing up! A confirmation email has been sent to your email address. Please check your email and follow the instructions in the message to complete the registration process. If you do not receive the email, please check your spam folder or contact us for assistance. Welcome to our platform!     Oops! Something went wrong while trying to create your new account. Please try again and if the problem persist, Email Us to receive support.     Username     Email address     Password      I accept the user agreement       Sign me up for the newsletter      CREATE ACCOUNT Close     Already have an account? Login                   Home     News    HUSIF        Trending News           CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...           OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program           ERIC   Ericsson and OPPO sign global patent cross license agreement           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                       CAMX   Camurus announces positive Phase 3 results from the ACROINNOVA 2 ...           DJT   Trump Media CEO Devin Nunes Issues Statement in Response to the A...                   OPT   Opthea Announces Results of the A$55.9m (US$36.9m1) Retail Entitl...           GRAL   GRAIL Advances the Galleri(r) Registrational Clinical Trial Program                   ERIC   Ericsson and OPPO sign global patent cross license agreement           CMLS   Westwood One & Cumulus Podcast Network Provide Special Programmin...                     Nicola Mining Announces Completion of 3D IP Survey and Commencement of Exploration Drilling at the New Craigmont Copper Project          Rhea-AI Impact    (No impact)        Rhea-AI Sentiment    (Neutral)        Tags             Rhea-AI Summary     Nicola Mining has completed a 3D induced polarization (IP) survey at its New Craigmont Copper Project near Merritt, BC. The survey, conducted by Dias Geophysical, covered approximately 6.5 square kilometers and focused on the MARB-CAS and West Craigmont Zones. Key findings include significant resistivity and chargeability anomalies that indicate potential copper-rich areas. Based on these results, Nicola has commenced its 2024 diamond drilling program, targeting 5,000 meters of core drilling. Initial drilling will focus on the West Craigmont Zone, with possible expansion to the MARB/CAS areas later in the summer.         Positive   None.       Negative   None.           07/03/2024 - 09:00 AM  Vancouver, British Columbia--(Newsfile Corp. - July 3, 2024) -  Nicola Mining Inc. (TSXV: NIM)  (the \" Company \" or \" Nicola \") is pleased to announce the completion of a 3D induced polarization survey (\" 3D IP Survey \"). Based on 3D IP Survey results the Company is in the process of commencing of its 2024 diamond drilling program (\" Program \") at the New Craigmont Copper Project (\" New Craigmont \"), situated approximately 11 kilometres from Merritt, BC and adjacent to Teck Resources Ltd.'s Highland Valley Copper, Canada's largest open-pit copper mine.As previously announced in the Company's Feb. 21, 2024 and May 13, 2024 news releases, Nicola engaged Dias Geophysical of Saskatoon, SK, to conduct a 3D IP Survey. This comprehensive survey aimed to better define two principal exploration areas: the MARB-CAS Zone and the West Craigmont Zone (Figure 1). Upon reviewing the data from the approximately 6.5 square kilometer survey, the Company has commenced its 2024 diamond drilling exploration program. Figure 1 . 2024 IP Survey AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_001full.jpgA significant resistivity anomaly appears in the western section of New Craigmont, near the Lornex Fault, via the Company's 2022 ZTEM Survey. This anomaly was confirmed and refined by the 2024 3D IP Survey. Additionally, the Survey detected chargeability anomalies on the edges of the resistivity anomaly within the area, and a potential structure trending ENE, which coincides with the strongest and largest chargeability anomaly. This resistivity high could represent a felsic intrusion, as was observed in outcrop, and the chargeability high could indicate peripheral sulphidation, likely enhanced along the potential structure. The 3D IP Survey has generated multiple drilling targets focusing on the chargeability anomalies within the West Craigmont Zone.The 3D IP Survey at MARB-CAS provided valuable information regarding the lithologies and appears to clearly delineate the contact between Nicola Group rocks and the Guichon Creek Batholith. The major chargeability anomalies are primarily confined within the Nicola Group rocks in the southern portion of the survey area, with some chargeability anomalies detected between the MARB and CAS MINFILE showings.Peter Espig, Chief Executive Officer, commented, \"The 3D IP Survey both confirmed and further defined key targets. Combining numerous geological and geophysical parameters, including bedrock mapping, airborne magnetic survey, and ZTEM survey with the 3D IP Survey gives us a great confidence to have a successful Program.\"A total of 5,000 m of core drilling is planned for the 2024 exploration program. Drilling will primarily be focused on the West Craigmont Zone initially, with the possibility of also drilling at MARB/CAS later in the summer (Figure 2). Figure 2 . 2024 Drill Target AreasTo view an enhanced version of this graphic, please visit:https://images.newsfilecorp.com/files/4873/215275_f85b0bd1b41c7bd0_002full.jpg Qualified Person William Whitty, P. Geo., the Company's VP Exploration, is the Qualified Person as defined by National Instrument 43-101 -  Standards of Disclosure for Mineral Projects  and supervised the preparation of, and has reviewed and approved, the technical information in this release. About Nicola Mining Nicola Mining Inc. is a junior mining company listed on the Exchange and Frankfurt Exchange that maintains a 100% owned mill and tailings facility, located near Merritt, British Columbia It has signed Mining and Milling Profit Share Agreements with high grade gold projects. Nicola's fully permitted mill can process both gold and silver mill feed via gravity and flotation processes.The Company owns 100% of the New Craigmont Project, a high-grade copper property, which covers an area of over 10,800 hectares along the southern end of the Guichon Batholith and is adjacent to Highland Valley Copper, Canada's largest copper mine. The Company also owns 100% of the Treasure Mountain Property, which includes 30 mineral claims and a mineral lease, spanning an area exceeding 2,200 hectares.On behalf of the Board of Directors \" Peter Espig \"  Peter EspigCEO & Director For additional information Contact: Peter EspigPhone: (778) 385-1213 Email: info@nicolamining.comURL: www.nicolamining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/215275     FAQ       What is the significance of Nicola Mining's 3D IP Survey at New Craigmont?    The 3D IP Survey identified significant resistivity and chargeability anomalies, indicating potential copper-rich areas, which guide the 2024 drilling program.        When did Nicola Mining announce the completion of the 3D IP Survey at New Craigmont?    Nicola Mining announced the completion of the 3D IP Survey on July 3, 2024.        What zones are targeted in Nicola Mining's 2024 drilling program at New Craigmont?    The 2024 drilling program targets the West Craigmont Zone initially, with possible expansion to the MARB/CAS areas later in the summer.        Who conducted the 3D IP Survey for Nicola Mining?    Dias Geophysical conducted the 3D IP Survey for Nicola Mining.        How large is the survey area for Nicola Mining's 3D IP Survey at New Craigmont?    The 3D IP Survey covered approximately 6.5 square kilometers at New Craigmont.        What is the planned drilling depth for Nicola Mining's 2024 exploration program at New Craigmont?    Nicola Mining plans to drill a total of 5,000 meters of core drilling in its 2024 exploration program.        What anomalies were found in the 3D IP Survey at New Craigmont?    The 3D IP Survey identified significant resistivity and chargeability anomalies, suggesting potential copper mineralization.         Nicola Mining Inc. OTC:HUSIF        HUSIF Rankings     N/A  Ranked by Market Cap   N/A  Ranked by Dividends         HUSIF Latest News       Jun 3, 2024  Nicola Mining and High Range Exploration Commence Work at Dominion Creek High Grade Gold / Silver Project      May 13, 2024  Nicola Mining Announces Commencement of 3D IP Survey at New Craigmont Copper Project      Apr 9, 2024  Nicola Mining Inc. and Talisker Resources Ltd. Enter into Milling Agreement      Apr 5, 2024  Nicola Mining and Lower Nicola Site Services Commence Construction of Cement Plant to Service Infrastructure Projects      Feb 21, 2024  Nicola Mining Inc. Engages Dias Geophysical to Conduct IP Survey at New Craigmont Copper Project          HUSIF Stock Data       Market Cap 36.67M     Float 131.13M     Insiders Ownership 21.63%     Institutions Ownership 12.66%     Industry Dimension Stone Mining and Quarrying      Sector Mining, Quarrying, and Oil and Gas Extraction     Website Link     Country United States of America     City Lower Nicola         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly ... - Yahoo Finance",
    "Link": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zaXRrYS1leHBhbmRzLWV4cGxvcmF0aW9uLXByb2dyYW0tcmMtMTIzMDAwMzQ2Lmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 12:30:00 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": " Sitka Expands Exploration Program at its RC Gold Project in Yukon to Include Drilling and Surface Work on the Newly Acquired Clear Creek Property    Read full article Sitka Gold Corp Wed, Jul 3, 2024, 5:30 AM12 min read Link Copied 0 In this article:    2024 exploration has begun on the newly acquired Clear Creek property First diamond drilling program ever to be completed on the Rhosgobel Intrusion since historical shallow reverse circulation drilling in 1995 to follow up on holes 95-15 which intersected 50.3 m of 1.07 g/t gold and 95-16 which intersected 67.1 m of 1.03 g/t gold with both holes ending in strong gold mineralization. Grid geochemistry currently underway to infill gaps to the south of the Blackjack deposit on the high potential Pukelman West intrusion and G2 zone on the newly acquired Clear Creek claims. Integration of newly acquired datasets (geological, geophysical, geochemical) with Sitka Gold data. Geological mapping and prospecting following up on the high grade G2 zone, Contact zone and other highly prospective gold targets. VANCOUVER, BC / ACCESSWIRE / July 3, 2024 / Sitka Gold Corp. (\"Sitka\" or the \"Company\") (TSXV:SIG)(FSE:1RF)(OTCQB:SITKF)  is pleased to announce that it has expanded the planned 2024 exploration program at its contiguous, 431 square kilometre RC Gold Project (\"RC Gold\" or the \"Project\") in Yukon to include diamond drilling and additional soil geochemistry surveys, geological mapping, prospecting and data integration and analysis on its newly acquired Clear Creek property (\"Clear Creek\") claims that complete the consolidation of the Clear Creek Intrusive Complex (see Figure 1). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program for 2024. \"The accumulation of data from several years of systematic exploration by previous operators on the newly acquired Clear Creek Property has generated several high-quality exploration targets,\"  said Cor Coe, Director and CEO of Sitka Gold.  \"The newly acquired claims cover at least three intrusion related gold targets that are geologically similar to our developing Blackjack gold deposit and the team is very excited to begin assessing the property by testing the Rhosgobel intrusion, where historical work strongly indicates the potential for the presence of a multi-million ounce gold deposit. Sitka's initial discovery of the Blackjack and Eiger gold deposits came about through a similar process of review and compilation of a large historical database and we see the ability to accelerate the discovery of additional gold deposits by utilizing our growing knowledge of the intrusion-related gold systems in this area in conjunction with the comprehensive Clear Creek data-set as we continue our exploration activities across this emerging mining district.\" Story continues The newly consolidated Project includes four high-priority areas that have had previous reverse circulation and/or diamond drilling that require additional drilling. These areas are the Rhosgobel intrusion where historical drilling intersected up to  1.03 g/t gold over 67.1 m  , the Contact zone with drill results up to  20.3 g/t gold over 10.7 m  , the Bear Paw Breccia which intersected up to  1.87 g/t gold over 42.6 m  and the Pukelman intrusion with results of  1.20 g/t gold over 10.0 m  (see Figure 2, Table 1). The first target area to be tested is the Rhosgobel Intrusion where shallow historical drilling in 1995 by Kennecott outlined a large area of intrusion related gold mineralization (see Figure 3). Previous drilling at Rhosgobel was limited to a vertical depth of approximately 60 metres. The gold mineralization observed at Rhosgobel is sheeted quartz veins hosted in a megacrystic quartz monzonite similar to the Blackjack deposit located 5 km to the north along the recently discovered Blackjack Mineralized Corridor. The first drill hole will be a step out to drill underneath the mineralized zone intersected in Holes 15 and 16 in shallow reverse circulation drilling (see Figure 4). This will be the first diamond drill hole ever drilled in the Rhosgobel intrusion. Geological interpretation of a steeply dipping mineralized zone is consistent with controls on mineralization observed elsewhere on the property.The Company has recently engaged GroundTruth Exploration to conduct grid based soil sampling in an area south of the Blackjack deposit where prospecting in 2015 identified a highly prospective area. The G2 zone was prospected in 2015 and 13 surface float samples were collected with a range of trace to  43.4 g/t gold  (see Figure 5) within mineralized intrusive and metasedimentary rocks. Three other samples returned values of  5.9, 7.2 and 13.6 g/t gold  . This area is located approximately 2 km south of the Blackjack gold deposit area, within the Blackjack Mineralized Corridor in proximity to the West Pukelman intrusion. Previous reconnaissance scale soil sampling encountered anomalous gold in soil in the area. The G2 zone is located approximately 1 km west of the Pukelman West intrusion within an extensional corridor containing both the Pukelman and Pukelman West intrusions and several previously reported lamprophyre dykes. The Pukelman West intrusion is located approximately 1.5 km south of the Blackjack deposit where recent drilling has intersected higher-grade mineralization associated with the N-S trending Blackjack fault. The intersection of these structural zones is interpreted by Sitka to be highly prospective for the discovery of additional gold mineralization.Prospecting in 2015 also focused on the Contact zone located at the southern margin of the Pukelman intrusion. Nineteen samples were collected ranging from trace to  166.2 g/t gold  . Seven additional samples of mainly quartz vein material taken from float and outcrop assayed above 1.0 g/t gold including  86.0, 31.8, 47.2, 27.4, 18.1, 2.8, and 1.5 g/t gold  (see Figure 5). The sampling indicates that the extent of the Contact zone could be much larger than the area previously drilled. Additional mapping and prospecting is planned to refine drill targets in anticipation of drilling this area.Geological mapping and prospecting in the G2 to Pukelman West corridor and along the Blackjack fault mineralized corridor from the Blackjack deposit south through the Pukelman West and Rhosgobel intrusion for additional areas of undiscovered gold mineralization will also be conducted with the goal of identifying additional drill targets.Recently acquired data encompassing the southern portion of the Clear Creek Intrusive Complex is being integrated within the Sitka database and plans for drilling additional known areas of mineralization are being developed. Figure 1 -  The acquisition of the Clear Creek property now completes Sitka Gold's 100% ownership of the Clear Creek Intrusive Complex and adds several underexplored areas that have strong potential for new gold discoveries in addition to four high-quality drill targets. Figure 2 -  The purchase of the Clear Creek Property (outlined in yellow boundary) now completes Sitka Gold's ownership of 100% of the Clear Creek Intrusive Complex, an area of approximately  8 km x 15 km  that includes several known surface intrusions with associated gold mineralization. The newly acquired property contains four highly prospective areas with limited historical drilling and several areas that have produced high-grade surface samples but remain under-explored and undrilled. Figure 3 -  Shallow reverse circulation drilling in the Rhosgobel intrusion in 1995 produced numerous intersections of gold mineralization consisting of sheeted quartz veins with megacrystic quartz monzonite. Holes 15 and 16 were drilled in opposite directions at 60 degrees dip intersected mineralization over their entire lengths. The holes intersected  50.3 m grading 1.07 g/t gold  and  67.1m of 1.03 g/t gold  respectively with both holes ending in mineralization. Figure 4  -  Cross-section of previous drilling at Rhosgobel along holes 15 and 16 which ended in mineralization. The first ever diamond drill hole proposed in the Rhosgobel intrusion (PROS-24-A) will step back and drill underneath holes 15 and 16 to test the width of the mineralized zone intersected in 1995. Figure 5  -  Prospecting in 2015 was conducted in the G2 zone and the Contact Zone and produced many high-grade results. Additional grid soil sampling (shown in Figure 2) will be conducted in these areas and south where previous soil sampling has been conducted at only wide spacings. Current drilling is expanding the Blackjack deposit to the south towards this highly prospective area. Table 1: Significant drill hole results from the Clear Creek Property *Intervals are drilled core length, as insufficient drilling has been completed at this time to determine true widths Table References  Robinson, S.D. and R. A. Doherty, 1988. Geological, Geochemical, Geophysical and Diamond Drilling 1988 Summary Report on the Rum, Rye and Roll Claims ((assessment report 092748)  Feulgen, S. and J.C. Stephen, 1989, Initial Diamond Drilling Report on the Rain, Wind, Sleet Claims, Left Clear Creek, Yukon (assessment report 092752)  Bidwell, G., 1993. Clear Creek Project, 1992 Reverse Circulation Drill Program (assessment report 093097)  Coombes, S., 1995. 1995 Assessment Report on the Clear Creek Option; prepared by Kennecott Canada Inc. (assessment report 093372).  Stammers, M.A., 2000. 1999 Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 094058)  Weeks, S. and R. Falls, 2001, 2000 Geological, Geochemical and Diamond Drilling Assessment Report on the Clear Creek Property (assessment report 94165)  O'Brien, 2010;Assessment Report, 2010 Diamond Drilling Program, Clear Creek Property (Assessment report 095539)  Shutty, 2011; Assessment Report, 2011 Exploration Program, Clear Creek Property (Assessment Report 095984)  The Company cautions that none of the historically reported assay results from the newly acquired Clear Creek property have been verified by Sitka. About the Flagship RC Gold Project The RC Gold Project consists of a 431 square kilometre contiguous district-scale land package located in the heart of Yukon's Tombstone Gold Belt. The project is located approximately 100 kilometres east of Dawson City, which has a 5,000 foot paved runway, and is accessed via a secondary gravel road from the Klondike Highway which is usable year-round and is an approximate 2 hour drive from Dawson City. It is the largest consolidated land package strategically positioned mid-way between Victoria Gold's Eagle Gold Mine - Yukon's newest gold mine which reached commercial production in the summer of 2020 - and Victoria Gold's former producing Brewery Creek Gold Mine.On January 19, 2023 Sitka Gold announced an Initial Mineral Resource Estimate prepared in accordance with National Instrument 43-101 (\"NI 43-101\") guidelines for the RC Gold Property of  1,340,000  ounces of gold  (1)  . The road accessible, pit constrained Mineral Resource is classified as inferred and is contained in two zones: The Blackjack and Eiger deposits. Both of these deposits are at/near surface, are potentially open pit minable and amenable to heap leaching, with initial bottle roll tests indicating that the gold is not refractory and has  high gold recoveries of up to 94%  with minimal NaCN consumption (see News Release July 13, 2022). The Mineral Resource estimate is presented in the following table at a base case cut-off grade of 0.25 g/t Au: RC Gold Inferred Mineral Resource Estimate COG g/t Au Blackjack Zone Eiger Zone Combined Tonnes 000's Au g/t 0z Au 000's Tonnes 000's Au g/t 0z Au 000's Tonnes 000's Au g/t 0z Au 000's 0.2035,7980.8092132,5230.4547168,3210.631,391 0.25 33,743 0.83 900 27,362 0.50 440 61,105 0.68 1,340 0.3031,2820.8888522,2530.5539353,5350.741,2790.3529,0650.9286017,8170.6034446,8820.801,2030.4026,9750.9683314,5060.6630841,4810.861,140 Notes  Mineral resource estimate prepared by Ronald G. Simpson of GeoSim Services Inc. with an effective date of January 19, 2023. Mineral Resources are classified using the 2014 CIM Definition Standards.  The cut-off grade of 0.25 g/t Au is believed to provide a reasonable margin over operating and sustaining costs for open-pit mining and processing  Mineral resources are constrained by an optimised pit shell using the following assumptions: US$1800/oz Au price; a 45 degrees pit slope; assumed metallurgical recovery of 85%; mining costs of US$2.00 per tonne; processing costs of US$8.00 per tonne; G&A of US$1.50/t.  Mineral resources are not mineral reserves and do not have demonstrated economic viability.  Totals may not sum due to rounding.  To date, 56 diamond drill holes have been drilled into this system for a total of approximately 19,962 metres including 16 drill holes totalling 6,515 metres completed in 2023 focused on expanding the initial resource. The drilling in 2023 produced results of up to  219.0 m of 1.34 g/t gold  including  124.8 m of 2.01 g/t gold  and  55.0 m of 3.11 g/t gold  in drill hole DDRCCC-23-047 at Blackjack (see news release dated September 26, 2023). The Company is currently diamond drilling at RC Gold in conjunction with a planned 15,000 metre drilling program.  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  RC Gold Deposit Model Exploration on the Property has mainly focused on identifying an intrusion-related gold system (\"IRGS\"). The property is within the Tombstone Gold Belt which is the prominent host to IRGS deposits within the Tintina Gold Province in Yukon and Alaska. Notable deposits from the belt include: Fort Knox Mine in Alaska with current Proven and Probable Reserves of 230 million tonnes at 0.3 g/t Au (2.471 million ounces; Sims 2018)  (1)  ; Eagle Gold Mine with current Measured and Indicated Resources of 233 million tonnes at a grade of 0.57 g/t Au at the Eagle Main Zone (4.303 million ounces; Harvey et al, 2022)  (2)  ; the Brewery Creek deposit with current Indicated Mineral Resource of 22.2 million tonnes at a gold grade of 1.11 g/t (0.789 million ounces; Hulse et al. 2020)  (3)  ; the Florin Gold deposit, located adjacent to Sitka's RC Gold project, with a current Inferred Mineral Resource of 170.99 million tonnes grading 0.45 g/t (2.47 million ounces; Simpson 2021)  (4)  and the AurMac Project with an Inferred Mineral Resource of 347.49 million tonnes grading 0.63 gram per tonne gold (7.00 million ounces)  (5)  .  Sims J. Fort Knox Mine Fairbanks North Star Borough, Alaska, USA National Instrument 43-101 Technical Report. June 11, 2018. https://s2.q4cdn.com/496390694/files/doc_downloads/2018/Fort-Knox-June-2018-Technical-Report.pdf  Harvey N., Gray P., Winterton J., Jutras M., Levy M.,Technical Report for the Eagle Gold Mine, Yukon Territory, Canada. Victoria Gold Corp. December 31, 2022. https://vgcx.com/site/assets/files/6534/vgcx_-_2023_eagle_mine_technical_report_final.pdf  Hulse D, Emanuel C, Cook C. NI 43-101 Technical Report on Mineral Resources. Gustavson Associates. May 31, 2020. https://minedocs.com/22/Brewery-Creek-PEA-01182022.pdf  Simpson R. Florin Gold Project NI 43-101 Technical Report. Geosim Services Inc. April 21, 2021. https://sedar.com/GetFile.do?lang=EN&docClass=24&issuerNo=00005795&issuerType=03&projectNo=03236138&docI d=4984158  Banyan Gold News Release Dated February 7, 2023 (Technical Report to be filed within 45 days of news release) https://banyangold.com/news-releases/2024/banyan-announces-7-million-ounce-gold-updated-mineral-resource-estimate-aurmac-project-yukon-canada/  Upcoming Events Sitka Gold will be attending and/or presenting at the following events*: Takestock Investor Forum, Stampede Event, Calgary, Alberta: July 3, 2024  Kelowna Capital Events, Kelowna, BC: July 19 - 21, 2024  Precious Metals Summit, Beaver Creek, Colorado: September 10 - 13, 2024  Yukon Geoscience, Whitehorse, Yukon: November 17 - 20, 2024 *All events are subject to change. About Sitka Gold Corp. Sitka Gold Corp. is a well-funded mineral exploration company headquartered in Canada. The Company is managed by a team of experienced industry professionals and is focused on exploring for economically viable mineral deposits with its primary emphasis on gold, silver and copper mineral properties of merit. Sitka is currently exploring its 100% owned, 431 square kilometre flagship RC Gold Project within the Tombstone Gold Belt in the Yukon Territory with a 15,000 metre diamond drill program planned for 2024. The Company is also advancing the Alpha Gold Project in Nevada and currently has drill permits for its Burro Creek Gold and Silver Project in Arizona and the Coppermine River Project in Nunavut.The Company recently announced an NI 43-101 compliant  initial inferred Mineral Resource Estimate of 1,340,000 ounces of gold   (1)  beginning at surface and grading 0.68 g/t at its RC Gold Project in Yukon (see news release dated January 19, 2023).  Simpson, R. January 19, 2023. Clear Creek Property, RC Gold Project, NI 43-101 Technical Report, Dawson Mining District, Yukon Territory  *For more detailed information on the underlying properties please visit our website at www.sitkagoldcorp.comThe scientific and technical content of this news release has been reviewed and approved by Cor Coe, P.Geo., Director and CEO of the Company, and a Qualified Person (QP) as defined by National Instrument 43-101.ON BEHALF OF THE BOARD OF DIRECTORS OFSITKA GOLD CORP. \"   Donald Penner   \"  President and DirectorFor more information contact: Donald Penner  President & Director778-212-1950dpenner@sitkagoldcorp.comor Cor Coe  CEO & Director604-817-4753ccoe@sitkagoldcorp.comNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary and Forward-Looking Statements This release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". This information and these statements, referred to herein as \"forward-looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, the use of the proceeds raised under the Offering and the Company's anticipated work programs. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will complete its anticipated work programs and use the proceeds of the Offering as currently anticipated. These forward-looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, market uncertainty, the results of the Company's anticipated work programs and that the Company will not use the proceeds of the Offering as currently anticipated. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor. SOURCE:  Sitka Gold CorpView the original press release on accesswire.com View comments Advertisement Up next  Advertisement  Up next  Advertisement  Up next  Advertisement  Up next  Advertisement  Up next  Advertisement  Up next  Advertisement  Up next  Advertisement   ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy51cHN0cmVhbW9ubGluZS5jb20vcmlncy1hbmQtdmVzc2Vscy9taWRkbGUtZWFzdC1wbGF5ZXItYmFncy1tdWx0aW1pbGxpb24tZG9sbGFyLXJpZy1kZWFscy10by1leHBhbmQtZHJpbGxpbmctZmxlZXQtdG8tMTQ4LWJ5LTIwMjYvMi0xLTE2NzEyNTLSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 07:45:01 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 | Upstream                                                                                                                                   Rigs and Vessels Middle East player bags multimillion-dollar rig deals, to expand drilling fleet to 148 by 2026 Island rigs will be constructed by China's Honghua GroupAdnoc Drilling chief executive Abdulrahman Abdulla Al Seiari.Photo: ADNOC DRILLING Nishant Ugal Middle East and South Asia EditorNew Delhi   ADNOCAdnoc DrillingUnited Arab EmiratesMiddle EastHonghua Published 3 July 2024, 07:22Updated 3 July 2024, 07:22  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Drilling barge ready for Eni's Caspian Sea wildcat - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9leHBsb3JhdGlvbi9kcmlsbGluZy1iYXJnZS1yZWFkeS1mb3ItZW5pcy1jYXNwaWFuLXNlYS13aWxkY2F0LzItMS0xNjcwMjM40gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:43:31 GMT",
    "Categories": [
      "Exploration"
    ],
    "Content": "    Drilling barge ready for Eni's Caspian Sea wildcat | Upstream                                                                                                                                 Exploration Drilling barge ready for Eni's Caspian Sea wildcat Caspian Explorer barge owner hopes drilling success might be opportunity to trade the unit for a minority interest in offshore Kazakhstan developmentThe Caspian Explorer drilling barge, owned by UK-listed Caspian Sunrise, in the Kazakh port of Aktau on the Caspian Sea.Photo: CASPIAN SUNRISE Vladimir Afanasiev European Correspondent   Caspian SunriseKazakhstanEniKazMunayGazAsia & Oceania Published 2 July 2024, 07:25Updated 2 July 2024, 13:48  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]