[
  {
    "Title": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited",
    "Link": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmx1ZXByaW50Lm5nL2RhbmdvdGUtcmVmaW5lcnktY3J1ZGUtb2lsLXN1cHBseS1vcHRpb25zL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:23:30 GMT",
    "Categories": [
      "Production Updates",
      "Supply and Demand"
    ],
    "Content": " Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited      Skip to content   The international corporations drilling oil in Nigeria are the country's greatest enemies. They have never hidden their condescension for Nigeria even as they are allowed to operate the industry on their own terms. In fact, the IOCs are partially responsible for Nigeria's total dependence on imported refined petroleum products.The international oil companies (IOCs) are compelled to operate refineries in most of the countries they drill oil. In Nigeria they defiantly snubbed the federal government's directives that they should establish refineries. Their excuse was that no refinery could succeed in Nigeria because the federal government stands around to fix unacceptable pump prices for refined petroleum products.Aliko Dangote, president of the Dangote Group, and some development banks in the international money market came together to prove that the treacherous oil firms exploiting crude oil in Nigeria were telling transparent lies when they refused to establish refineries in Nigeria on the grounds that the pump prices of refined petroleum products were controlled by the federal government. The international money market advanced loans close to $9 billion to Dangote for the establishment of what is now acknowledged as one of the world's largest refineries.No one would advance such a colossal sum as a loan for a venture known to have no means of repaying the loan. The fact that the international development banks were willing to fund Dangote Refinery is a clear indication that the venture was viable and could not be bugged down by government regulation of the pump prices of refined petroleum products.The lies of the IOCs were exposed by the success in sourcing for funds to build a giant refinery in Nigeria.The mischievous oil firms were disgraced as their lies were exposed. They gnashed their teeth and proceeded to wait for Dangote and the Nigerian people down the road.The refinery they were determined to truncate came on stream in January 2024 and in apparent frustration they drew up fresh plans to sabotage the business of the refinery and keep Nigeria as a perpetual importer of refined petroleum products.They know that if Dangote Refinery succeeds, the refineries in Europe that were supplying refined petroleum products to Nigeria at a catastrophic cost of well over $20 billion annually could be out of businessThey decided to use the last weapon in their armoury to frustrate Dangote Refinery. They defiantly refused to sell crude oil to Dangote. Those who reluctantly offer to sell the feedstock put their price tag at $6 above what obtains in the international market.Consequently, Dangote has been compelled to import crude oil for his refinery from the United States of America (USA) when Nigeria remains the highest producer of crude oil in Africa.The treacherous international oil companies operating in Nigeria have finally held Dangote Refinery and the Nigerian people in the jugular.Diesel from Dangote Refinery is more expensive than the high sulfur diesels imported by independent petroleum marketers from Europe into Nigeria.The most painful aspect of the sabotage by the IOCs is that the regulator of the industry sees nothing wrong with collaborating with foreigners to frustrate a Nigerian venture designed to ease the merciless grip of European petroleum refiners on Nigerians.The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) apathetically issues licences to independent petroleum marketers to import diesel from Europe with a weak naira and torment Nigerian consumers with high energy cost that escalates the country's catastrophic inflationary trend.When newsmen confronted the agency on the illogicality of encouraging diesel imports when a Nigerian refinery is ready to supply, NMDPRA retorted that in a deregulated market, marketers are free to source diesel from anywhere.NMDPRA is the regulatory arm of the Nigerian National Petroleum Company Limited (NNPCL). The company is more or less an appendage of the mischievous international oil companies battling to protect the interest of European crude oil refiners patronised by NNPCL.NNPCL, as industry regulator, could order the deceitful IOCs to sell crude oil to Dangote Refinery at international market price. But it could only do so to the detriment of its own selfish interest.NNPCL would lose trillions of naira if Dangote Refinery gets crude oil from Nigeria and sells refined petroleum products locally at reduced pump prices.That would mean the end of the petrol subsidy scandal through which the company rakes in trillions of naira annually. That explains why NNPCL allows foreign exploiters to frustrate Dangote Refinery.NNPCL has unrestrained powers to supply crude oil to Dangote Refinery which at the moment is the only way to ease the asphyxiating hold of high energy cost on Nigeria's economy.If the treacherous IOCs defy NNPCL's directive to supply crude oil to Dangote Refinery at international market rate, the company could do the job by itself.NNPCL allocates 445,000 barrels of crude oil daily to Nigeria's moribund refineries. Nigeria's four refineries have not refined a barrel of crude oil in the last three years.Consequently, NNPCL exports the 445,000 barrels of crude oil daily to foreign refineries that feed Nigeria with refined petroleum products in return. If NNPCL reroutes the crude oil to Dangote Refinery, Nigeria would benefit extensively.The foreign refineries use the residue of the crude oil supplied by NNPCL for their petrochemical products and export them to Nigeria. If Dangote Refinery gets the crude oil, the residue would be used to produce resins that would be used to ease the escalating cost of producing plastic containers in the soft drink and brewery industries.Besides, NNPCL owes Dangote Refinery the sum of $1.7 billion as part of the 20 per cent equity it bought. It was expected to pay back with 300,000 barrels of crude oil daily. Its refusal to supply borders on betrayal of trust.It is rather saddening that Mele Kyari, the man who navigated NNPCL through the horrendous petrol subsidy scandal and crude oil theft, is still its group managing director. The man should do the right thing.   WhatsApp Email LinkedIn Twitter  Facebook   Related Posts     Soyinka: The icon for whom apologies are unnecessary  July 14, 2024July 14, 2024     FACT CHECK: Ekpa's false claims of foreign backing debunked  July 14, 2024July 14, 2024     The rumblings in Plateau over move to recall Lalong, 2 others  July 13, 2024July 13, 2024 About Jerry Uwah  View all posts by Jerry Uwah →   ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record.   Expand    At A Glance:  Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure      Related Tags    Hurricance   NYMEX   matterhorn express pipeline   natural gas prices   Natural gas futures   California   Plaquemines LNG            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "    August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high.   Expand    Here's the latest:   August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48       Related Tags    natural gas prices   Mountain Valley Pipeline   Natural gas futures   Mvp   Sabine Pass   Midday   Transco Zone 5   Freeport Lng            Chris Newman     Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021.      X  Natgasnewman   Email  chris.newman@naturalgasintel.com                    Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 12, 2024   Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend.        Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 11, 2024   August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels.        Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 10, 2024   Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region.        Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 09, 2024   Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks.        Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 08, 2024   Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.        Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 03, 2024   August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "US natgas prices ease to 6-week low on rising output, lower LNG feedgas - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vdXMtbmF0Z2FzLXByaWNlcy1kcm9wLXRvLTYtd2Vlay1sb3ctb24tcmlzaW5nLW91dHB1dC1sb3dlci1sbmctZmVlZGdhcy0xMTE5NDDSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 14:51:41 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    US natgas prices ease to 6-week low on rising output, lower LNG feedgas                                          US natgas prices ease to 6-week low on rising output, lower LNG feedgas  July 2 (Reuters) - U.S. natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row.       Advertisement:  The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt           In other news, a federal judge dealt U.S. President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave. In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again. That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023. In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest U.S. National Hurricane Center (NHC) outlook. After marching across the Yucatan, the NHC projected Beryl will weaken into a tropical storm by the time it enters the Bay of Campeche in the Gulf of Mexico, where Mexico produces much of its oil, on Saturday before approaching the Texas-Mexico border on Sunday. SUPPLY AND DEMAND Financial firm LSEG said gas output in the Lower 48 U.S. states rose to an average of 101.5 billion cubic feet per day (bcfd) so far in July. That was up from an average of 100.1 bcfd in June and a 17-month low of 99.5 bcfd in May as many producers reduced drilling activities after prices fell to 3-1/2-year lows in February and March. U.S. output hit a monthly record high of 105.5 bcfd in December 2023. Meteorologists projected weather across the Lower 48 states would remain hotter than normal through at least July 17. With hotter weather expected next week, LSEG forecast average gas demand in the Lower 48, including exports, will rise from 98.5 bcfd this week to 104.5 bcfd next week. Those forecasts were lower than LSEG's outlook on Monday. Gas flows to the seven big U.S. LNG export plants fell to 12.2 bcfd so far in July, down from 12.8 bcfd in June and a monthly record high of 14.7 bcfd in December 2023. That decline was due mostly to an expected drop in feedgas at Cheniere Energy's 4.5-bcfd Sabine Pass in Louisiana to a one-week low of 3.7 bcfd on Tuesday, down from 4.1 bcfd on Monday and an average of 4.0 bcfd over the prior seven days.  (Reporting by Scott DiSavino; editing by Barbara Lewis)       Related Articles      Jul 15, 2024 11:15:am  Longboat completes sale of shares in Longboat Japex Norge to Japex       Jul 15, 2024 10:00:am  Jade Gas partners with DWK for Red Lake CBM project in Mongolia      Jul 15, 2024 9:10:am  Kuwait announces oil, gas discovery       ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMib2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbWV4aWNvLW5hdHVyYWwtZ2FzLXByb2R1Y3Rpb24tc2Vlcy11cHRpY2staW4tbWF5LWJ1dC1zdGlsbC1vZmYteWVhci1hZ28tbGV2ZWxzL9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:09:56 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    Mexico Natural Gas Production Sees Uptick in May, But Still Off Year-Ago Levels                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Mexico's natural gas production ticked upward to 3.85 Bcf/d in May from a three-year low of 3.76 Bcf/d in April, but was down 11% year/year, government data show. State oil company Petróleos Mexicanos (Pemex) produced 3.65 Bcf/d, or 95% of total gas output last month, with private sector operators accounting for the remainder, according to upstream regulator Comisión Nacional de Hidrocarburos (CNH). The top five gas producing fields, all operated by Pemex, were Quesqui (570 MMcf/d), Ixachi (507 MMcf/d), Akal (355 MMcf/d), Maloob (138 MMcf/d) and Onel (133 MMcf/d).      Related Tags    Mexico   Exploration And Production   natural gas            Andrew Baker     Andrew joined NGI in 2018 to support coverage of Mexico's newly liberalized oil and gas sector, and his role has since expanded to include the rest of North America. Before joining NGI, Andrew covered Latin America's hydrocarbon and electric power industries from 2014 to 2018 for Business News Americas in Santiago, Chile. He speaks fluent Spanish, and holds a B.A. in journalism and mass communications from the University of Minnesota.      X  AbakerNGI   Email  andrew.baker@naturalgasintel.com                    Storm Season Hitting Demand in Texas, Mexico as Natural Gas Prices Slump - Spotlight     Mexico Gas Price Index Mexico Natural Gas Prices     July 11, 2024   The Atlantic storm season has come on strong early this year and with great force, leading to reduced demand for natural gas on both sides of the U.S.-Mexico border.        Morena Landslide Could Allow Major Energy Reforms Before Mexico's AMLO Leaves Office     Mexico Gas Price Index Mexico     July 10, 2024   Mexico's outgoing president Andres Manuel López Obrador could still push through a regulatory overhaul of the energy sector before his successor Claudia Sheinbaum is sworn in this October, according to the Baker Institute for Public Policy's David Gantz.        Eni Notches Another Mexico Upstream Discovery as Natural Gas Prices Forecast to Rise     Mexico Gas Price Index E&P Natural Gas Prices     July 09, 2024   Italy's Eni SpA, one of Mexico's leading private sector producers, has found more oil and associated natural gas in shallow waters offshore Mexico.        Billionaire Slim's Grupo Carso to Develop Lakach Deepwater Natural Gas Field with Pemex     Mexico Gas Price Index E&P Mexico     July 08, 2024   Mexico's Grupo Carso, SAB de CV, a conglomerate owned by billionaire Carlos Slim, signed a services contract with state oil company Petróleos Mexicanos (Pemex) to help develop the Lakach deepwater natural gas field off Mexico's southeastern coast.        Mexico Importing Record Levels of U.S. Natural Gas, but Resolving Trade Disputes Said Crucial     Mexico Gas Price Index Mexico Regulatory     July 03, 2024   Mexico is importing around 7 Bcf/d of natural gas from the United States this summer, but unresolved issues related to a trade treaty binding the two economies could complicate this relationship.        China Driving Asian LNG Import Surge as Mexico Liquefaction Projects Advance     Mexico Gas Price Index LNG Mexico     July 02, 2024   Asian LNG imports rose by 10.5 million metric tons (mmt) in 2023 versus 2022, the largest year/year change for any market, according to the International Gas Union's (IGU) newly published 2024 World LNG Report.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vZWd5cHRzLWdhcy1vdXRwdXQtYXQtNS43LWJsbi1jdWJpYy1mZWV0LXBlci1kYXktcGV0cm9sZXVtLW1pbmlzdHJ5LXNwb2tlc3BlcnNvbi1zYXlzLTExMTkzNtIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:48:14 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says                                          Egypt's gas production at 5.7 bln cubic feet per day, petroleum ministry spokesperson says  CAIRO, July 1 (Reuters) - Egypt's gas production is currently at 5.7 billion cubic feet per day, the state news agency MENA quoted the spokesperson of the petroleum ministry as saying on Monday. The spokesperson also said that it was agreed that 21 liquefied natural gas cargos are to arrive in Egypt during the summer, in addition to shipments of mazut fuel.       Advertisement:  The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt           The first gas shipment arrived on Monday, and it is currently being discharged for supply into the national gas grid, the ministry spokesperson said. \"With the third week of July...the national gas grid's supply will be sufficient,\" he added. In June, Egypt fully awarded 20 cargoes of LNG in its biggest purchase of the seaborne fuel, aimed to cover heavy summer demand from July through September. Supplies of the natural gas that helps Egypt generate electricity have been dwindling at a time when an expanding population and urban development have been pushing up electricity demand. When temperatures rise, air conditioning use drives up power consumption. Egypt needs to import around $1.18 billion worth of natural gas and mazut fuel oil to end persistent power cuts exacerbated by consecutive heatwaves, Prime Minister Mostafa Madbouly said last month. (Reporting by Jaidaa Taha and Muhammad Al GebalyEditing by Chris Reese and Leslie Adler)       Related Articles      Jul 10, 2024 8:00:am  Africa is missing the LNG boat [Gas in Transition]      Jul 8, 2024 8:15:am  Botala reports 42% increase in resources for Botswana CBM project      Jul 5, 2024 7:19:am  Nigeria beats rivals for bid to host new Africa Energy Bank      ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "NNPC Declares State of Emergency on Crude Oil Production - News Diary",
    "Link": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vbmV3c2RpYXJ5b25saW5lLmNvbS9ubnBjLWRlY2xhcmVzLXN0YXRlLW9mLWVtZXJnZW5jeS1vbi1jcnVkZS1vaWwtcHJvZHVjdGlvbi_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:58:13 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "Google NewsOpening https://newsdiaryonline.com/nnpc-declares-state-of-emergency-on-crude-oil-production/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Ukraine state gas player boosts gas production | Upstream - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9lbmVyZ3ktc2VjdXJpdHkvdWtyYWluZS1zdGF0ZS1nYXMtcGxheWVyLWJvb3N0cy1nYXMtcHJvZHVjdGlvbi1hbmQtc3RvcmFnZS8yLTEtMTY3MTA0N9IBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 04:37:11 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    Ukraine state gas player boosts gas production and storage | Upstream                                                                                                                                 Energy Security Ukraine state gas player boosts gas production and storage State-run Naftogaz reveals new advance in challenging environment for country's gas playersUkraine's Naftogaz executive chairman Oleksiy Chernyshov.Photo: AP/SCANPIX Vladimir Afanasiev European Correspondent   NaftogazRussiaUkrtransgazUkraineEurope Published 3 July 2024, 04:34Updated 3 July 2024, 09:27  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost - NNPC Ltd",
    "Link": "https://news.google.com/rss/articles/CBMijQFodHRwczovL25ucGNncm91cC5jb20vaW5zaWdodHMvbm5wYy1sdGQtZGVjbGFyZXMtc3RhdGUtb2YtZW1lcmdlbmN5LW9uLWNydWRlLW9pbC1wcm9kdWN0aW9uLWNhbGxzLWZvci1jb2xsYWJvcmF0aW9uLXRvLXJlZHVjZS1wcm9kdWN0aW9uLWNvc3TSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 15:54:36 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "   NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost       Who we are   Investors   Sustainability   Our Businesses   Insights   contact us        JULY 2, 2024     NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost    PRESS RELEASE In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners, and we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner.He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry.On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country.On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\"  Olufemi O. Soneye Chief Corporate Communications OfficerNNPC Ltd.Abuja. July 2 nd , 2024 GCEO, NNPC Ltd, Mallam Mele Kyari, delivers a Keynote Address at the second day of the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.GCEO, NNPC Ltd, Mallam Mele Kyari (standing 7 th  from left) in a group photograph with participants at the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.   Other Posts      News     JULY 5, 2024     NNPC/SPDC JV Committed to Impacting Lives Through Sustainable Development Projects ...Donates Ultra-M...     News     JULY 4, 2024     Nigeria's CNG Journey Has Commenced and is Irreversible, Says Kyari ...As NNPC Plans to Build Three L...     News     JULY 8, 2024     Logistics Challenges, Flooding Cause of Fuel Queues ...As NNPC, Stakeholders Vow To Restore Normalcy      Energy for Today, Energy for Tomorrow    (c) 2024 NNPC Limited.    Never miss out on what we're up to     Thank you! Your submission has been received!   Oops! Something went wrong while submitting the form.   NNPC   Who we are   Investors   Contact   Terms Of Use   Privacy Policy   Documents   Careers    SERVICES    Upstream     Downstream     Gas & Power     Non-Energy     New Energy    SOCIAL MEDIA   X   Facebook   Instagram   Linkedin   Youtube   Threads    (c) 2024 NNPC Limited.       ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper",
    "Link": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vdGhld2hpc3RsZXIubmcvcXVpY2stcmVzb2x1dGlvbi1vZi1pb2NzLWRpdmVzdG1lbnQtd2lsbC1ib29zdC1jcnVkZS1vaWwtcHJvZHVjdGlvbi1pbmRlcGVuZGVudC1wcm9kdWNlcnMtdGVsbHMtZmcv0gF-aHR0cHM6Ly90aGV3aGlzdGxlci5uZy9xdWljay1yZXNvbHV0aW9uLW9mLWlvY3MtZGl2ZXN0bWVudC13aWxsLWJvb3N0LWNydWRlLW9pbC1wcm9kdWN0aW9uLWluZGVwZW5kZW50LXByb2R1Y2Vycy10ZWxscy1mZy9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 12:13:48 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "                               Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper                                                                         Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG     Oil & Gas   By  Kasarahchi ANIAGOLU   On  Jul 2, 2024         File Photo : Crude Oil        The Chairman, Independent Petroleum Producers Group (IPPG) Abdulrazaq Isa on Tuesday called for speedy resolution of divestment involving International Oil Companies so as to unlock crude oil productions to about 2.5 million barrels per day. Isa made the call at the Nigerian Oil and Gas (NOG) Energy Week 2024 in Abuja with the theme, \"Showcasing opportunities, driving investment and meeting energy demand.\"   Advertisement  He told the participants at the event that the approval of IOCs divestment will also restore global investor confidence in Nigeria at a time of huge competition for investments in the energy sector. The IPPG Chairman stated further that despite huge hydrocarbon resource base, with over 37 billion barrels of proven crude oil reserves and 207 tcf and 600 tcf of proven gas reserves, the country is currently in a situation where the daily production has significantly dropped to about 1.3 million barrels of crude oil per day and 8.5 billion standard cubic feet of gas per day respectively. This, he noted, is far below the nation's capacity, noting that Nigeria now runs the risk of partial implementation of its national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. He said, \"IPPG strongly advocates that our member companies - Seplat, the Renaissance Consortium and Oando - have the proven track record to successfully take over and manage these onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5 billion SCF of gas per day within 24 months and well over 500,000 barrels of oil per day in the long term.  Advertisement  \"IPPG believes the timely approval of these IOC divestment transactions will also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. \"The urgent need to address deepwater development and production by untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, Total Energies, ExxonMobil and Chevron, has the potential to unlock incremental production of 700,000 barrels per day from this terrain in the short to medium term.     RELATED            Economy   Nigeria's Push To Attract Investments May Be Frustrated By CBN's Cash Repatriation Restriction- Analyst     Jun 14, 2024            Oil & Gas   Host Communities: Blocking Of IOCs Divestment Will Stifle Investments Into Nigeria's Oil & Gas Sector- NUPRC...     Jun 6, 2024           \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource bases.\" Isa also the hairman and Co-Founder of Waltersmith Group of Companies called for the adoption of a national value-retention strategy, stating that Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from its domestic crude oil and gas production. He noted that this would transform the country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy.  Advertisement  \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we can meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability. \"The development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive as Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed LNG capacity and expanding production (FLNG). \"In addition, we must expand domestic gas utilization (Gas-to-Power; Gas-Based Industries) by investing heavily to address the gas infrastructure deficit facing us today. The International Oil Companies will lead the charge on export gas while IPPG members will drive the domestic gas agenda led by NNPCL,\" he added. Isa noted that the priorities would provide the most realistic and sustainable pathway towards meeting the national long-term production aspiration of four million barrels of oil per day and 13 billion cubic feet of gas per day.     IOCIPPG        Share         Prev Post  LP Guber Candidate Akpata Campaign In Disarray As Edo Obidient Movement Switches Support For APC     Next Post  Ex-Senate President Wabara Bombs Obasanjo, Says I Turned Down N250m Bribe To Support Third Term Agenda       Leave a comment    Advertisement                   Sign in       Home News  Nigeria World News   Politics Business  Economy Oil & Gas Company Consumer Money & Markets   Entertainment  Celebrities Fashion & Style Movies Music   Sports  Football Athletics Tennis Other Sports   Technology  Hardware Mobile Software   SPECIAL PUBLICATION Opinion & Interviews Lifestyle  Health & Fitness Travel Fashion & Style Relationships   Special Reports                   Welcome, Login to your account.     Forget password?  Remember me         Sign in     Recover your password. A password will be e-mailed to you.                 ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "    August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high.   Expand    Here's the latest:   August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48       Related Tags    natural gas prices   Mountain Valley Pipeline   Natural gas futures   Mvp   Sabine Pass   Midday   Transco Zone 5   Freeport Lng            Chris Newman     Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021.      X  Natgasnewman   Email  chris.newman@naturalgasintel.com                    Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 12, 2024   Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend.        Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 11, 2024   August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels.        Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 10, 2024   Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region.        Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 09, 2024   Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks.        Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 08, 2024   Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.        Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 03, 2024   August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper",
    "Link": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vdGhld2hpc3RsZXIubmcvcXVpY2stcmVzb2x1dGlvbi1vZi1pb2NzLWRpdmVzdG1lbnQtd2lsbC1ib29zdC1jcnVkZS1vaWwtcHJvZHVjdGlvbi1pbmRlcGVuZGVudC1wcm9kdWNlcnMtdGVsbHMtZmcv0gF-aHR0cHM6Ly90aGV3aGlzdGxlci5uZy9xdWljay1yZXNvbHV0aW9uLW9mLWlvY3MtZGl2ZXN0bWVudC13aWxsLWJvb3N0LWNydWRlLW9pbC1wcm9kdWN0aW9uLWluZGVwZW5kZW50LXByb2R1Y2Vycy10ZWxscy1mZy9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 12:13:48 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "                               Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG - The Whistler Newspaper                                                                         Quick Resolution Of IOCs Divestment Will Boost Crude Oil Production, Independent Producers Tells FG     Oil & Gas   By  Kasarahchi ANIAGOLU   On  Jul 2, 2024         File Photo : Crude Oil        The Chairman, Independent Petroleum Producers Group (IPPG) Abdulrazaq Isa on Tuesday called for speedy resolution of divestment involving International Oil Companies so as to unlock crude oil productions to about 2.5 million barrels per day. Isa made the call at the Nigerian Oil and Gas (NOG) Energy Week 2024 in Abuja with the theme, \"Showcasing opportunities, driving investment and meeting energy demand.\"   Advertisement  He told the participants at the event that the approval of IOCs divestment will also restore global investor confidence in Nigeria at a time of huge competition for investments in the energy sector. The IPPG Chairman stated further that despite huge hydrocarbon resource base, with over 37 billion barrels of proven crude oil reserves and 207 tcf and 600 tcf of proven gas reserves, the country is currently in a situation where the daily production has significantly dropped to about 1.3 million barrels of crude oil per day and 8.5 billion standard cubic feet of gas per day respectively. This, he noted, is far below the nation's capacity, noting that Nigeria now runs the risk of partial implementation of its national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. He said, \"IPPG strongly advocates that our member companies - Seplat, the Renaissance Consortium and Oando - have the proven track record to successfully take over and manage these onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5 billion SCF of gas per day within 24 months and well over 500,000 barrels of oil per day in the long term.  Advertisement  \"IPPG believes the timely approval of these IOC divestment transactions will also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. \"The urgent need to address deepwater development and production by untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, Total Energies, ExxonMobil and Chevron, has the potential to unlock incremental production of 700,000 barrels per day from this terrain in the short to medium term.     RELATED            Economy   Nigeria's Push To Attract Investments May Be Frustrated By CBN's Cash Repatriation Restriction- Analyst     Jun 14, 2024            Oil & Gas   Host Communities: Blocking Of IOCs Divestment Will Stifle Investments Into Nigeria's Oil & Gas Sector- NUPRC...     Jun 6, 2024           \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource bases.\" Isa also the hairman and Co-Founder of Waltersmith Group of Companies called for the adoption of a national value-retention strategy, stating that Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from its domestic crude oil and gas production. He noted that this would transform the country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy.  Advertisement  \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we can meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability. \"The development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive as Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed LNG capacity and expanding production (FLNG). \"In addition, we must expand domestic gas utilization (Gas-to-Power; Gas-Based Industries) by investing heavily to address the gas infrastructure deficit facing us today. The International Oil Companies will lead the charge on export gas while IPPG members will drive the domestic gas agenda led by NNPCL,\" he added. Isa noted that the priorities would provide the most realistic and sustainable pathway towards meeting the national long-term production aspiration of four million barrels of oil per day and 13 billion cubic feet of gas per day.     IOCIPPG        Share         Prev Post  LP Guber Candidate Akpata Campaign In Disarray As Edo Obidient Movement Switches Support For APC     Next Post  Ex-Senate President Wabara Bombs Obasanjo, Says I Turned Down N250m Bribe To Support Third Term Agenda       Leave a comment    Advertisement                   Sign in       Home News  Nigeria World News   Politics Business  Economy Oil & Gas Company Consumer Money & Markets   Entertainment  Celebrities Fashion & Style Movies Music   Sports  Football Athletics Tennis Other Sports   Technology  Hardware Mobile Software   SPECIAL PUBLICATION Opinion & Interviews Lifestyle  Health & Fitness Travel Fashion & Style Relationships   Special Reports                   Welcome, Login to your account.     Forget password?  Remember me         Sign in     Recover your password. A password will be e-mailed to you.                 ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "NNPCL declares state of emergency on crude oil production - Champion Newspapers",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY2hhbXBpb25uZXdzLmNvbS5uZy9ubnBjbC1kZWNsYXJlcy1zdGF0ZS1vZi1lbWVyZ2VuY3ktb24tY3J1ZGUtb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 00:09:15 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "              NNPCL declares state of emergency on crude oil production - Champion Newspapers LTD                                                        Champion Newspapers Limited   For a better society        The media gateway to the East. For inquiries: Phone:  +234 81 8616 6160 Email:  editor.championnews@gmail.com     Likes      Followers      Followers                               NNPCL declares state of emergency on crude oil production   .Calls for collaboration to reduce cost .FG determined to improve oil production, says Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC      EnergyLatest News           42       Share           UGO AMADI  In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry. Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared. According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes. He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels. He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" However, with Nigeria's oil production lagging significantly behind OPEC oil production quota, the Minister for State Petroleum Resources (Oil), Senator Heineken Lokpobiri has expressed the Federal Government's determination to improve production in the coming months. The Minister stated this when he gave his ministerial address at the ongoing 2024 NOG week Lokpobiri emphasized Nigeria's commitment to increasing oil production, adding that while Nigeria \"is not in a rush to transition away from oil, the country is actively seeking to enhance its production capabilities\". According to him, \"We are focused on ramping up our oil production . When we came to office the president was concerned in increasing production in every way. I can confidently tell you that most of the deals like Seplat -ExxonMobil deal and other issues like Malabu deal are being resolved. He highlighted the benefits of the Petroleum Industry Act (PIA), which provides a robust legal framework that guarantees returns on investments and has significantly reshaped the oil and gas sector. \"The PIA ensures a secure and profitable investment climate, making Nigeria an attractive location for investors,\" he noted.  .IPPG laments delays in concluding IOCs' divestment transactions  The Independent Petroleum Producers Group (IPPG) has expressed concerns over the continuos delays in concluding ongoing divestment transactions by the international oil companies (IOCs). Chairman of IPPG, Mr. Abdulrazaq Isa, raised his members' concerns yesterday in Abuja at the ongoing Nigeria Oil and Gas (NOG) Energy Week 2024, with the theme: \"Showcasing Opportunities, Driving Investment and Meeting Energy Demand\". In his industry address at the event, Isa specifically said that the long-overdrawn delays in concluding the IOCs divestment deals were costly to the Nigerian petroleum industry and extremely detrimental to the country as a whole. He appreciated President Bola Tinubu for the transformative reforms being undertaken by his administratio, pointing out specifically that the recent presidential executive orders and directives were a welcome development for the industry. \"Also of note is His Excellency's direct intervention in untangling issues in some of the long-overdrawn IOC divestment transactions - these delays have been costly to the industry and extremely detrimental to the nation as a whole. \"We are encouraged to see swift progress on implementation and some tangible results within a relatively short period of time. \"Such progressive and impactful policies are exactly what the industry has consistently clamoured for to sustainably develop and move the industry forward\", Isa stated. Notwithstanding those laudable policies and the gradual positive turnarounds being experienced, he maintained that the industry was in dire need of extraordinary focus to mitigate the genuine concerns on its long-term sustainability. According to him, despite Nigeria's world class hydrocarbon resource base of over 37 billion barrels of proven crude oil reserves and 207 trillion cubic feet (tcf) and 600 tcf of proven and contingent gas reserves respectively, we find ourselves in a situation where our daily production has significantly dropped and lies at about 1.3 million barrels of oil and 8.5 bcf of gas today. He noted that the current oil and gas production was way below Nigeria's capacity as a nation. He added that by all globally acceptable standards, this reserves to production ratio was extremely low and a clear indicator that the industry was in a dire situation. In addition, Isa noted that \"we now run the risk of partial implementation of our national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. This trend in production, according to the IPPG chair, \"portends another frightening dimension when we consider that in the not-too-distant future, our overall installed domestic refining capacity, currently closing in on about 1.2 million barrels per day, may soon outstrip our current crude oil production level with the risk of Nigeria finding itself in a position where it is unable to meet its domestic refinery crude demand or even become a net importer of crude oil, God forbid! \"It is against this scary backdrop that IPPG is calling for urgent measures to be undertaken by all relevant stakeholders to immediately arrest this dwindling production level and under-investment by focusing on the following priority areas.\" On the first priority area, he called for immediate conclusion of all pending IOC divestment transactions. Isa posited that IPPG strongly advocates that their member companies such as Seplat, the Renaissance Consortium and Oando have the proven track record to successfully take over and manage those onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5bcf of gas per day within 24 months, and well over 500,000bpd in the long term. He maintained that IPPG believes the timely approval of these IOC divestment transactions would also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. On the second priority area, Isa stressed the urgent need to address deepwater development and production in Nigeria. He said untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, TotalEnergies, ExxonMobil and Chevron has the potential to unlock incremental production of 700,000 bpd from this terrain in the short to medium term. Isa stated, \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource base. \"Priority Area 3: The adoption of a national value-retention strategy: Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from our domestic crude oil and gas production in order to transform our country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we are able to meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability.\" On the fourth priority area, the IPPG boss called for the development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive. He stressed that Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed Liquefied Natural Gas (LNG) capacity and expanding production (FLNG).  .We see energy demand rising by 23% by 2045 - OPEC  Meanwhile, The Organisation of the Petroleum Exporting Countries (OPEC) says energy demand will rise by an estimated 23 per cent by 2025. OPEC says the rise will be fueled by a world economy that is expected to double in size, growing from $138 trillion dollars in 2023 to $270 trillion dollars in 2045. The OPEC Secretary-General, Haitham Al Ghais, made this known on Tuesday at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition, holding in Abuja. The conference, which holds from June 30 to July 4, has its theme as \"Showcasing Opportunities, Driving Investment, Meeting Energy Demand\". Addressing the Strategic Conference via teleconference, Al Ghais explained that it forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. \"This data tells us that the world will require all forms of energy to meet long-term energy needs. \"Oil and gas will remain the predominant fuels in the energy mix. \"In fact, oil alone will retain its share at almost 30 per cent in 2045 as world demand for oil soars to an estimated 116 million barrels per day (mb/d) by that time,\" he said. To meet this rapid and robust growth in energy consumption, he said the industry would need to boost investment levels significantly in the years to come. He said according to its research, cumulative oil-related investment requirements from 2024 until 2045 would amount to $14 trillion dollars or around $610 billion dollars on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons,\" he said. Al Ghais further emphasised that indeed, the rush to adopt \"Net-Zero\" strategies was misguided and simply not realistic. The OPEC Secretary General said that developing countries would continue to balance priorities between developing their national economies and addressing climate change. In this regard, he pledged that OPEC and its member countries would continue to advocate for a fair process for adaptation, mitigation and means of implementation, with regard to climate finance and technology. He decried the fact that there were an estimated 675 million people with no access to basic forms of energy and 2.3 billion without access to clean cooking fuels. He tasked World leaders to unite and advocate for the necessary support and resources to make a difference in addressing this important matter. \"Looking ahead, OPEC will continue to enhance dialogue and cooperation with all of its energy partners, including in Africa,\" Al Ghais said. The Secretary-General, while commending President Bola Tinubu, appreciated Nigeria's staunch commitment to OPEC and to the Declaration of Cooperation.  Continue Reading      .Calls for collaboration to reduce cost .FG determined to improve oil productionNNPCLoilsays Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC        42       Share   FacebookTwitterWhatsAppTelegram      Editor 20957 posts 0 comments      Prev Post  24th Milo Basketball Nat'l Championship, held in Lagos     Next Post  NOG: Enact enforceable local content laws to build capacity - Nestoil Limited          You might also like   More from author                   Energy       Shell Nigeria MD, Okunbor, honoured for exemplary leadership              Energy       Our Decision To Cap Equity Participation Strategic' - NNPC Replies Dangote Refinery...              Latest News       NDLEA intercepts US, UK, Europe-bound Cocaine hidden in shoes              Latest News       PDP clarifies stance on Rivers court case, denies appeal            Prev   Next            Comments are closed.               More Stories             Shell Nigeria MD, Okunbor, honoured for exemplary leadership     Jul 15, 2024             Our Decision To Cap Equity Participation Strategic' - NNPC...     Jul 15, 2024             NDLEA intercepts US, UK, Europe-bound Cocaine hidden in...     Jul 15, 2024             PDP clarifies stance on Rivers court case, denies appeal     Jul 15, 2024            Prev   Next  1 of 2,845       You cannot print contents of this website.          Sign in                  Welcome, Login to your account.       Login with Facebook    Google    Twitter     Or      Forget password?  Remember me         Sign in     Recover your password. A password will be e-mailed to you.                 ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record.   Expand    At A Glance:  Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure      Related Tags    Hurricance   NYMEX   matterhorn express pipeline   natural gas prices   Natural gas futures   California   Plaquemines LNG            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "    August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high.   Expand    Here's the latest:   August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48       Related Tags    natural gas prices   Mountain Valley Pipeline   Natural gas futures   Mvp   Sabine Pass   Midday   Transco Zone 5   Freeport Lng            Chris Newman     Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021.      X  Natgasnewman   Email  chris.newman@naturalgasintel.com                    Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 12, 2024   Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend.        Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 11, 2024   August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels.        Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 10, 2024   Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region.        Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 09, 2024   Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks.        Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 08, 2024   Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.        Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot     MidDay Price Alert Natural Gas Prices     July 03, 2024   August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "US natgas prices ease to 6-week low on rising output, lower LNG feedgas - Natural Gas World",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3Lm5hdHVyYWxnYXN3b3JsZC5jb20vdXMtbmF0Z2FzLXByaWNlcy1kcm9wLXRvLTYtd2Vlay1sb3ctb24tcmlzaW5nLW91dHB1dC1sb3dlci1sbmctZmVlZGdhcy0xMTE5NDDSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 14:51:41 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    US natgas prices ease to 6-week low on rising output, lower LNG feedgas                                          US natgas prices ease to 6-week low on rising output, lower LNG feedgas  July 2 (Reuters) - U.S. natural gas futures eased about 1% to a six-week low on rising output, forecasts for less demand over the next two weeks than previously expected due to lower liquefied natural gas (LNG) feedgas and an ongoing oversupply of gas in storage. Front-month gas futures for August delivery on the New York Mercantile Exchange fell 2.4 cents, or 1.0%, to $2.454 per million British thermal units (mmBtu) at 8:49 a.m. EDT (1249 GMT), putting the contract on track for its lowest close since May 15 for a second day in a row.       Advertisement:  The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt           In other news, a federal judge dealt U.S. President Joe Biden's climate agenda a setback by blocking the Democrat's administration from continuing to pause the approval of applications to export liquefied natural gas (LNG). In Texas, the Electric Reliability Council of Texas (ERCOT), power grid operator for most of the state, said peak demand this week will come close to but not break the record for the month of July as homes and businesses crank up their air conditioners to escape a heat wave. In the spot market, next-day gas prices at the Waha hub in West Texas plunged by about 123% to a negative 52 cents per mmBtu for Tuesday as pipeline constraints trap gas in the Permian Shale again. That is the third time in six days Waha prices fell into negative territory during the current heat wave and the 20th time so far this year. Next-day Waha prices first averaged below zero in 2019. It happened 17 times in 2019, six in 2020, none in 2021 and 2022, and once in 2023. In the Caribbean Sea, Hurricane Beryl, an extremely dangerous major hurricane, will hit Jamaica on Wednesday before slamming slam into Mexico's Yucatan Peninsula on Friday, according to the latest U.S. National Hurricane Center (NHC) outlook. After marching across the Yucatan, the NHC projected Beryl will weaken into a tropical storm by the time it enters the Bay of Campeche in the Gulf of Mexico, where Mexico produces much of its oil, on Saturday before approaching the Texas-Mexico border on Sunday. SUPPLY AND DEMAND Financial firm LSEG said gas output in the Lower 48 U.S. states rose to an average of 101.5 billion cubic feet per day (bcfd) so far in July. That was up from an average of 100.1 bcfd in June and a 17-month low of 99.5 bcfd in May as many producers reduced drilling activities after prices fell to 3-1/2-year lows in February and March. U.S. output hit a monthly record high of 105.5 bcfd in December 2023. Meteorologists projected weather across the Lower 48 states would remain hotter than normal through at least July 17. With hotter weather expected next week, LSEG forecast average gas demand in the Lower 48, including exports, will rise from 98.5 bcfd this week to 104.5 bcfd next week. Those forecasts were lower than LSEG's outlook on Monday. Gas flows to the seven big U.S. LNG export plants fell to 12.2 bcfd so far in July, down from 12.8 bcfd in June and a monthly record high of 14.7 bcfd in December 2023. That decline was due mostly to an expected drop in feedgas at Cheniere Energy's 4.5-bcfd Sabine Pass in Louisiana to a one-week low of 3.7 bcfd on Tuesday, down from 4.1 bcfd on Monday and an average of 4.0 bcfd over the prior seven days.  (Reporting by Scott DiSavino; editing by Barbara Lewis)       Related Articles      Jul 15, 2024 5:30:am  US natural gas pipeline ADCC begins commercial operations      Jul 12, 2024 7:00:am  About 1 million in Texas without power, Freeport LNG to restart after Beryl      Jul 11, 2024 1:00:pm  Engie to partner with Macquarie in Mexican pipeline project      ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvYWRub2MtZXhwYW5kcy16YWt1bS1vZmZzaG9yZS1kcmlsbGluZy1mbGVldC1vdXRwdXQtYm9vc3QtZnJvbS0yMDI2LTI2NTEwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 11:41:44 GMT",
    "Categories": [
      "Production Updates",
      "Exploration"
    ],
    "Content": "      Adnoc expands Zakum offshore drilling fleet, output boost from 2026             Adnoc expands Zakum offshore drilling fleet, output boost from 2026   Crude Oil   3 Jul 2024   The UAE's energy giant Adnoc is set to boost production from the giant offshore Zakum field with a further ramp up...    Please Register or Sign in to view this content. Quantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon and ammonia markets. Quantum Oil service subscribers have access to:  Daily price assessments Market news and price commentary Fundamental trade data Quantum Energy Daily - market report sent to your email  Get in touch with us for subscription information on all Quantum platforms, or help with the service.      Related         Adnoc lifts Murban exports, Ruwais refinery processes more Upper Zakum   Crude Oil Refined Products   1 Apr 2024   UAE oil company Adnoc has boosted volumes of the medium sour Upper Zakum crude supplied into its giant Ruwais refining complex...           Adnoc L&S awarded contract for new Lower Zakum island   Crude Oil   8 Jun 2023   The recently listed Adnoc Logistics and Services has been awarded its first major contract...           Adnoc awards $412m drilling contract for Upper Zakum expansion   Crude Oil   14 Apr 2023   The UAE's energy powerhouse Adnoc has awarded a contract to its subsidiary, Adnoc Drilling, to provide...              ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Adnoc expands Zakum offshore drilling fleet, output boost from 2026 - Quantum Commodity Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnFjaW50ZWwuY29tL2FydGljbGUvYWRub2MtZXhwYW5kcy16YWt1bS1vZmZzaG9yZS1kcmlsbGluZy1mbGVldC1vdXRwdXQtYm9vc3QtZnJvbS0yMDI2LTI2NTEwLmh0bWzSAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 11:41:44 GMT",
    "Categories": [
      "Production Updates",
      "Exploration"
    ],
    "Content": "      Adnoc expands Zakum offshore drilling fleet, output boost from 2026             Adnoc expands Zakum offshore drilling fleet, output boost from 2026   Crude Oil   3 Jul 2024   The UAE's energy giant Adnoc is set to boost production from the giant offshore Zakum field with a further ramp up...    Please Register or Sign in to view this content. Quantum Commodity Intelligence is a premium paid subscription service for professionals in the oil, biofuels, carbon and ammonia markets. Quantum Oil service subscribers have access to:  Daily price assessments Market news and price commentary Fundamental trade data Quantum Energy Daily - market report sent to your email  Get in touch with us for subscription information on all Quantum platforms, or help with the service.      Related         Adnoc lifts Murban exports, Ruwais refinery processes more Upper Zakum   Crude Oil Refined Products   1 Apr 2024   UAE oil company Adnoc has boosted volumes of the medium sour Upper Zakum crude supplied into its giant Ruwais refining complex...           Adnoc L&S awarded contract for new Lower Zakum island   Crude Oil   8 Jun 2023   The recently listed Adnoc Logistics and Services has been awarded its first major contract...           Adnoc awards $412m drilling contract for Upper Zakum expansion   Crude Oil   14 Apr 2023   The UAE's energy powerhouse Adnoc has awarded a contract to its subsidiary, Adnoc Drilling, to provide...              ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L09QRUMtY3J1ZGUtb2lsLXByb2R1Y3Rpb24tcmVtYWlucy1zdGVhZHktZm9yLXRoaXJkLW1vbnRoLWR1ZS10by1JcmFxLVVBRS1ub24tY29tcGxpYW5jZdIBeWh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9PUEVDLWNydWRlLW9pbC1wcm9kdWN0aW9uLXJlbWFpbnMtc3RlYWR5LWZvci10aGlyZC1tb250aC1kdWUtdG8tSXJhcS1VQUUtbm9uLWNvbXBsaWFuY2U?oc=5",
    "Published": "Tue, 02 Jul 2024 10:04:38 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "     OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News                                              Breaking News     KDP leader's car explosion leaves one injured in Iraqi Kurdistan       USD/IQD exchange rates dip in Baghdad, Erbil       Iraq's Justice Ministry denies secret executions, plans legal action against false reports       Security expert warns of resurgent ISIS activity in Iraq                2024-07-02T09:48:13+00:00           Share        font       Enable Reading Mode      A- A A+             Shafaq News/ OPEC's crude oil production held steady for the third consecutive month as Iraq and the UAE failed to fully implement the agreed-upon cuts, according to a Bloomberg survey. The Organization of the Petroleum Exporting Countries produced an average of 26.98 million barrels per day in June, marking a decrease of 80,000 barrels per day from the previous month. This slight reduction was attributed to minor cuts in production from Iraq and Nigeria. The survey indicated that Iraq and the UAE did not fully comply with the cuts agreed upon at the beginning of the year with other OPEC members. Additionally, Baghdad was unable to implement the extra production cut it had pledged to compensate for previous overproduction levels. To push crude oil prices higher, the OPEC alliance may need to enforce the committed cuts fully. However, efforts to enhance compliance have shown limited results. In June, Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day. This reduction in exports brought the country closer to its assigned quota, but its production still exceeded the quota by approximately 250,000 barrels per day, even without considering additional \"compensatory cuts.\"             Related News           Bloomberg: Iraq reduced its oil production by 130,000 bpd             Iraq boosts oil output by 40,000 bpd in May following OPEC decision             Basrah crudes surge following global oil rise             Basrah crudes surge despite global oil decline             Kirkuk oil production surges to over 360,000 bpd             EIA reports surge in Iraqi oil exports to the US                     Shafaq Live     Shafaq Live     English                 English        Radio            facebook       Shafaq news english      ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "NNPCL declares state of emergency on crude oil production - Champion Newspapers",
    "Link": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY2hhbXBpb25uZXdzLmNvbS5uZy9ubnBjbC1kZWNsYXJlcy1zdGF0ZS1vZi1lbWVyZ2VuY3ktb24tY3J1ZGUtb2lsLXByb2R1Y3Rpb24v0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 00:09:15 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "              NNPCL declares state of emergency on crude oil production - Champion Newspapers LTD                                                        Champion Newspapers Limited   For a better society        The media gateway to the East. For inquiries: Phone:  +234 81 8616 6160 Email:  editor.championnews@gmail.com     Likes      Followers      Followers                               NNPCL declares state of emergency on crude oil production   .Calls for collaboration to reduce cost .FG determined to improve oil production, says Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC      EnergyLatest News           42       Share           UGO AMADI  In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry. Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners. And we will work together to improve the situation,\" the GCEO declared. According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner. He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry. On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes. He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels. He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country. On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" However, with Nigeria's oil production lagging significantly behind OPEC oil production quota, the Minister for State Petroleum Resources (Oil), Senator Heineken Lokpobiri has expressed the Federal Government's determination to improve production in the coming months. The Minister stated this when he gave his ministerial address at the ongoing 2024 NOG week Lokpobiri emphasized Nigeria's commitment to increasing oil production, adding that while Nigeria \"is not in a rush to transition away from oil, the country is actively seeking to enhance its production capabilities\". According to him, \"We are focused on ramping up our oil production . When we came to office the president was concerned in increasing production in every way. I can confidently tell you that most of the deals like Seplat -ExxonMobil deal and other issues like Malabu deal are being resolved. He highlighted the benefits of the Petroleum Industry Act (PIA), which provides a robust legal framework that guarantees returns on investments and has significantly reshaped the oil and gas sector. \"The PIA ensures a secure and profitable investment climate, making Nigeria an attractive location for investors,\" he noted.  .IPPG laments delays in concluding IOCs' divestment transactions  The Independent Petroleum Producers Group (IPPG) has expressed concerns over the continuos delays in concluding ongoing divestment transactions by the international oil companies (IOCs). Chairman of IPPG, Mr. Abdulrazaq Isa, raised his members' concerns yesterday in Abuja at the ongoing Nigeria Oil and Gas (NOG) Energy Week 2024, with the theme: \"Showcasing Opportunities, Driving Investment and Meeting Energy Demand\". In his industry address at the event, Isa specifically said that the long-overdrawn delays in concluding the IOCs divestment deals were costly to the Nigerian petroleum industry and extremely detrimental to the country as a whole. He appreciated President Bola Tinubu for the transformative reforms being undertaken by his administratio, pointing out specifically that the recent presidential executive orders and directives were a welcome development for the industry. \"Also of note is His Excellency's direct intervention in untangling issues in some of the long-overdrawn IOC divestment transactions - these delays have been costly to the industry and extremely detrimental to the nation as a whole. \"We are encouraged to see swift progress on implementation and some tangible results within a relatively short period of time. \"Such progressive and impactful policies are exactly what the industry has consistently clamoured for to sustainably develop and move the industry forward\", Isa stated. Notwithstanding those laudable policies and the gradual positive turnarounds being experienced, he maintained that the industry was in dire need of extraordinary focus to mitigate the genuine concerns on its long-term sustainability. According to him, despite Nigeria's world class hydrocarbon resource base of over 37 billion barrels of proven crude oil reserves and 207 trillion cubic feet (tcf) and 600 tcf of proven and contingent gas reserves respectively, we find ourselves in a situation where our daily production has significantly dropped and lies at about 1.3 million barrels of oil and 8.5 bcf of gas today. He noted that the current oil and gas production was way below Nigeria's capacity as a nation. He added that by all globally acceptable standards, this reserves to production ratio was extremely low and a clear indicator that the industry was in a dire situation. In addition, Isa noted that \"we now run the risk of partial implementation of our national budget considering an estimated deficit of 400,000 bpd from the forecasted 1.78 million bpd. This trend in production, according to the IPPG chair, \"portends another frightening dimension when we consider that in the not-too-distant future, our overall installed domestic refining capacity, currently closing in on about 1.2 million barrels per day, may soon outstrip our current crude oil production level with the risk of Nigeria finding itself in a position where it is unable to meet its domestic refinery crude demand or even become a net importer of crude oil, God forbid! \"It is against this scary backdrop that IPPG is calling for urgent measures to be undertaken by all relevant stakeholders to immediately arrest this dwindling production level and under-investment by focusing on the following priority areas.\" On the first priority area, he called for immediate conclusion of all pending IOC divestment transactions. Isa posited that IPPG strongly advocates that their member companies such as Seplat, the Renaissance Consortium and Oando have the proven track record to successfully take over and manage those onshore and shallow water assets to realise incremental production in the region of 100,000 - 200,000 barrels of oil and over 1.5bcf of gas per day within 24 months, and well over 500,000bpd in the long term. He maintained that IPPG believes the timely approval of these IOC divestment transactions would also be a clear signal capable of restoring global investor confidence in Nigeria in an era of competing global investment destinations in Africa and very limited access to capital. On the second priority area, Isa stressed the urgent need to address deepwater development and production in Nigeria. He said untangling issues around deepwater development, particularly in terms of competitive fiscal regime being negotiated with Shell, TotalEnergies, ExxonMobil and Chevron has the potential to unlock incremental production of 700,000 bpd from this terrain in the short to medium term. Isa stated, \"Enabling deepwater development will attract significant economic benefits as Nigeria has one of the world's largest untapped deepwater resource base. \"Priority Area 3: The adoption of a national value-retention strategy: Nigeria's domestic crude oil refining and petrochemical capacity must be sustained primarily from our domestic crude oil and gas production in order to transform our country into a net exporter of refined petroleum and petrochemical products that will lay a strong foundation for the rapid industrialization of the Nigerian economy. \"It is therefore imperative to grow our daily production to 2.5 million barrels of oil and 10 bcf of gas in the near to long term to ensure we are able to meet our domestic refinery and petrochemical demands and export commitments to generate the much-needed foreign exchange earnings for macro-economic stability.\" On the fourth priority area, the IPPG boss called for the development of Nigeria's gas resources to catalyse economic growth and complement decarbonisation drive. He stressed that Nigeria's vast gas resources must be exploited with immediate focus placed on restoring production to existing installed Liquefied Natural Gas (LNG) capacity and expanding production (FLNG).  .We see energy demand rising by 23% by 2045 - OPEC  Meanwhile, The Organisation of the Petroleum Exporting Countries (OPEC) says energy demand will rise by an estimated 23 per cent by 2025. OPEC says the rise will be fueled by a world economy that is expected to double in size, growing from $138 trillion dollars in 2023 to $270 trillion dollars in 2045. The OPEC Secretary-General, Haitham Al Ghais, made this known on Tuesday at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition, holding in Abuja. The conference, which holds from June 30 to July 4, has its theme as \"Showcasing Opportunities, Driving Investment, Meeting Energy Demand\". Addressing the Strategic Conference via teleconference, Al Ghais explained that it forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. \"This data tells us that the world will require all forms of energy to meet long-term energy needs. \"Oil and gas will remain the predominant fuels in the energy mix. \"In fact, oil alone will retain its share at almost 30 per cent in 2045 as world demand for oil soars to an estimated 116 million barrels per day (mb/d) by that time,\" he said. To meet this rapid and robust growth in energy consumption, he said the industry would need to boost investment levels significantly in the years to come. He said according to its research, cumulative oil-related investment requirements from 2024 until 2045 would amount to $14 trillion dollars or around $610 billion dollars on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons,\" he said. Al Ghais further emphasised that indeed, the rush to adopt \"Net-Zero\" strategies was misguided and simply not realistic. The OPEC Secretary General said that developing countries would continue to balance priorities between developing their national economies and addressing climate change. In this regard, he pledged that OPEC and its member countries would continue to advocate for a fair process for adaptation, mitigation and means of implementation, with regard to climate finance and technology. He decried the fact that there were an estimated 675 million people with no access to basic forms of energy and 2.3 billion without access to clean cooking fuels. He tasked World leaders to unite and advocate for the necessary support and resources to make a difference in addressing this important matter. \"Looking ahead, OPEC will continue to enhance dialogue and cooperation with all of its energy partners, including in Africa,\" Al Ghais said. The Secretary-General, while commending President Bola Tinubu, appreciated Nigeria's staunch commitment to OPEC and to the Declaration of Cooperation.  Continue Reading      .Calls for collaboration to reduce cost .FG determined to improve oil productionNNPCLoilsays Lokpobiri .IPPG laments delays in concluding IOCs' divestment transactions .We see energy demand rising by 23% by 2045 - OPEC        42       Share   FacebookTwitterWhatsAppTelegram      Editor 20957 posts 0 comments      Prev Post  24th Milo Basketball Nat'l Championship, held in Lagos     Next Post  NOG: Enact enforceable local content laws to build capacity - Nestoil Limited          You might also like   More from author                   Energy       Shell Nigeria MD, Okunbor, honoured for exemplary leadership              Energy       Our Decision To Cap Equity Participation Strategic' - NNPC Replies Dangote Refinery...              Latest News       NDLEA intercepts US, UK, Europe-bound Cocaine hidden in shoes              Latest News       PDP clarifies stance on Rivers court case, denies appeal            Prev   Next            Comments are closed.               More Stories             Shell Nigeria MD, Okunbor, honoured for exemplary leadership     Jul 15, 2024             Our Decision To Cap Equity Participation Strategic' - NNPC...     Jul 15, 2024             NDLEA intercepts US, UK, Europe-bound Cocaine hidden in...     Jul 15, 2024             PDP clarifies stance on Rivers court case, denies appeal     Jul 15, 2024            Prev   Next  1 of 2,845       You cannot print contents of this website.          Sign in                  Welcome, Login to your account.       Login with Facebook    Google    Twitter     Or      Forget password?  Remember me         Sign in     Recover your password. A password will be e-mailed to you.                 ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Ukraine state gas player boosts gas production | Upstream - Upstream Online",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnVwc3RyZWFtb25saW5lLmNvbS9lbmVyZ3ktc2VjdXJpdHkvdWtyYWluZS1zdGF0ZS1nYXMtcGxheWVyLWJvb3N0cy1nYXMtcHJvZHVjdGlvbi1hbmQtc3RvcmFnZS8yLTEtMTY3MTA0N9IBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 04:37:11 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "    Ukraine state gas player boosts gas production and storage | Upstream                                                                                                                                 Energy Security Ukraine state gas player boosts gas production and storage State-run Naftogaz reveals new advance in challenging environment for country's gas playersUkraine's Naftogaz executive chairman Oleksiy Chernyshov.Photo: AP/SCANPIX Vladimir Afanasiev European Correspondent   NaftogazRussiaUkrtransgazUkraineEurope Published 3 July 2024, 04:34Updated 3 July 2024, 09:27  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost - NNPC Ltd",
    "Link": "https://news.google.com/rss/articles/CBMijQFodHRwczovL25ucGNncm91cC5jb20vaW5zaWdodHMvbm5wYy1sdGQtZGVjbGFyZXMtc3RhdGUtb2YtZW1lcmdlbmN5LW9uLWNydWRlLW9pbC1wcm9kdWN0aW9uLWNhbGxzLWZvci1jb2xsYWJvcmF0aW9uLXRvLXJlZHVjZS1wcm9kdWN0aW9uLWNvc3TSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 15:54:36 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "   NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost       Who we are   Investors   Sustainability   Our Businesses   Insights   contact us        JULY 2, 2024     NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost    PRESS RELEASE In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners, and we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner.He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry.On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country.On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\"  Olufemi O. Soneye Chief Corporate Communications OfficerNNPC Ltd.Abuja. July 2 nd , 2024 GCEO, NNPC Ltd, Mallam Mele Kyari, delivers a Keynote Address at the second day of the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.GCEO, NNPC Ltd, Mallam Mele Kyari (standing 7 th  from left) in a group photograph with participants at the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.   Other Posts      News     JULY 5, 2024     NNPC/SPDC JV Committed to Impacting Lives Through Sustainable Development Projects ...Donates Ultra-M...     News     JULY 4, 2024     Nigeria's CNG Journey Has Commenced and is Irreversible, Says Kyari ...As NNPC Plans to Build Three L...     News     JULY 8, 2024     Logistics Challenges, Flooding Cause of Fuel Queues ...As NNPC, Stakeholders Vow To Restore Normalcy      Energy for Today, Energy for Tomorrow    (c) 2024 NNPC Limited.    Never miss out on what we're up to     Thank you! Your submission has been received!   Oops! Something went wrong while submitting the form.   NNPC   Who we are   Investors   Contact   Terms Of Use   Privacy Policy   Documents   Careers    SERVICES    Upstream     Downstream     Gas & Power     Non-Energy     New Energy    SOCIAL MEDIA   X   Facebook   Instagram   Linkedin   Youtube   Threads    (c) 2024 NNPC Limited.       ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News - Shafaq News",
    "Link": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vc2hhZmFxLmNvbS9lbi9FY29ub215L09QRUMtY3J1ZGUtb2lsLXByb2R1Y3Rpb24tcmVtYWlucy1zdGVhZHktZm9yLXRoaXJkLW1vbnRoLWR1ZS10by1JcmFxLVVBRS1ub24tY29tcGxpYW5jZdIBeWh0dHBzOi8vc2hhZmFxLmNvbS9hbXAvZW4vRWNvbm9teS9PUEVDLWNydWRlLW9pbC1wcm9kdWN0aW9uLXJlbWFpbnMtc3RlYWR5LWZvci10aGlyZC1tb250aC1kdWUtdG8tSXJhcS1VQUUtbm9uLWNvbXBsaWFuY2U?oc=5",
    "Published": "Tue, 02 Jul 2024 10:04:38 GMT",
    "Categories": [
      "Production Updates"
    ],
    "Content": "     OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News                                              Breaking News     KDP leader's car explosion leaves one injured in Iraqi Kurdistan       USD/IQD exchange rates dip in Baghdad, Erbil       Iraq's Justice Ministry denies secret executions, plans legal action against false reports       Security expert warns of resurgent ISIS activity in Iraq                2024-07-02T09:48:13+00:00           Share        font       Enable Reading Mode      A- A A+             Shafaq News/ OPEC's crude oil production held steady for the third consecutive month as Iraq and the UAE failed to fully implement the agreed-upon cuts, according to a Bloomberg survey. The Organization of the Petroleum Exporting Countries produced an average of 26.98 million barrels per day in June, marking a decrease of 80,000 barrels per day from the previous month. This slight reduction was attributed to minor cuts in production from Iraq and Nigeria. The survey indicated that Iraq and the UAE did not fully comply with the cuts agreed upon at the beginning of the year with other OPEC members. Additionally, Baghdad was unable to implement the extra production cut it had pledged to compensate for previous overproduction levels. To push crude oil prices higher, the OPEC alliance may need to enforce the committed cuts fully. However, efforts to enhance compliance have shown limited results. In June, Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day. This reduction in exports brought the country closer to its assigned quota, but its production still exceeded the quota by approximately 250,000 barrels per day, even without considering additional \"compensatory cuts.\"             Related News           Bloomberg: Iraq reduced its oil production by 130,000 bpd             Iraq boosts oil output by 40,000 bpd in May following OPEC decision             Basrah crudes surge following global oil rise             Basrah crudes surge despite global oil decline             Kirkuk oil production surges to over 360,000 bpd             EIA reports surge in Iraqi oil exports to the US                     Shafaq Live     Shafaq Live     English                 English        Radio            facebook       Shafaq news english      ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]