[
  {
    "Title": "Exclusive-Russia restoring oil refining capacity knocked out by drones - Yahoo News Australia",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2F1Lm5ld3MueWFob28uY29tL2V4Y2x1c2l2ZS1ydXNzaWEtcmVzdG9yaW5nLW9pbC1yZWZpbmluZy0xMjAwMTM2NzcuaHRtbD9zZXpuYW1fcT0wJm5vX2NvbW1lcmNlPTEmdXRtX3NvdXJjZT13d3cuc2V6bmFtLmN6JnV0bV9tZWRpdW09c2VrY2Utei1pbnRlcm5ldHXSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 01:50:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": " Exclusive-Russia restoring oil refining capacity knocked out by drones Advertisement Close this content Read full article Reuters 15 April 2024 at 4:00 pm·2-min read Link copied The logo of Taneco are seen on tanks at its refinery complex, which is part of Russia's oil producer Tatneft group of companies, in Nizhnekamskin MOSCOW (Reuters) - Russia has been able to swiftly repair some of key oil refineries hit by Ukrainian drones, reducing capacity idled by the attacks to about 10% from almost 14% at the end of March, Reuters calculations showed.Ukraine stepped up drone attacks on Russian energy infrastructure since the start of the year, hitting some major oil refineries across the world's second largest oil exporter in attacks that sent up oil prices.Russia says the drone attacks amount to terrorism. Ukraine says its drone attacks on Russia are justified because it is fighting for survival as Russia has made \"massive retaliatory\" strikes on Ukrainian energy infrastructure.There have been no reports of successful attacks on Russian large refineries since the Taneco plant was hit on April 2.Russia is repairing its refineries fast, despite difficulties in obtaining Western know-how.That includes Rosneft-owned Ryazan plant, which put back he CDU-4 and main CDU-6 primary oil refining units into operation, as well as Kuibyshev refinery repairing CDU-4 and Syzran's CDU-5 and previously idled for maintenance CDU-6.According to Reuters calculations, total Russian primary oil refining capacity, idled by drones, was reduced to 90,500 metric tons per day (660,000 barrels per day) from around 123,800 tons per day (907,000 bpd) previously.However, in total, Russia's cumulative primary oil refining capacity, put offline due to various outages and maintenances, is expected at 4.4 million tons in April, up from 4.1 million tons in March.The respite in Ukraine's strikes comes after criticism from the United States, the world's top energy consumer, where high fuel prices is high up on the agenda in the run up to presidential election on Nov. 5.Replying to Republican U.S. Senator Tom Cotton on why Joe Biden administration was discouraging Ukrainians from the attacks on Russia's \"war-making capabilities\", Defence Secretary Lloyd Austin told the Senate Armed Services committee last week that the attacks could harm global energy markets.\"Certainly, those attacks could have a knock-on effect in terms of the global energy situation, and ... but quite frankly, I think Ukraine is better served by going after tactical and operational targets that can directly influence the current fight,\" he said.(Reporting by Reuters; writing by Vladimir Soldatkin; editing by Guy Faulconbridge and David Evans) Up next Up next Up next Up next Latest stories HuffPost Trump Tells Reporter What He 'Wasn't Expecting' After Assassination AttemptThe former president also detailed a \"little problem\" he's had since the shooting. HuffPost Melania Trump Gives Rare Statement After Donald Trump's Rally ShootingThe former first lady spoke out after former President Donald Trump was wounded in a shooting at a campaign event the previous evening. The Independent Trump rally shooting witness says he saw rifle-toting man 'crawling up the roof' before Secret Service 'blew his head off'Trump's Saturday evening rally descended into chaos when a gunman opened fire before he was 'neutralized' by Secret Service sniper The Independent What we know about gunman Thomas Matthew Crooks who shot at Trump at his Pennsylvania rallyFBI investigating shooting as a potential act of domestic terrorism even as gunman's motive remains elusive Sky News Gunman identified as video shows body and rifle on roof after Trump shootingFederal investigators have identified the man who shot at Donald Trump at a rally in Pennsylvania. Speaking at a news conference overnight, Lieutenant Colonel George Bivens said that officials \"are absolutely not taking for granted that this was a lone wolf attack\" and that law enforcement's priority was to \"identify the motive of the shooting\" and \"if anyone else was involved\". The Daily Beast Secret Service in Crisis: Used Local Cops at Trump RallyIt's been the question on everyone's mind since Donald Trump narrowly escaped death in an assassination attempt Saturday night: How, exactly, was a 20-year-old rifleman able to perch himself on a rooftop just 150 yards away from the former president during a rally?It turns out, the Secret Service's over reliance on Pennsylvania cops may be partially to blame, with a report from The Washington Post revealing Sunday the agency punted the responsibility of surveying and securing some nearby structu Rolling Stone Republican Congressman Baselessly Accuses Biden of Ordering Trump ShootingGOP lawmakers are pushing false conspiracies and blaming Biden for the shooting at the former president's rally The Hill Ocasio-Cortez rips House Democrat over anonymous quote: 'You should absolutely retire'Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday sharply criticized an anonymous \"senior Democrat\" who was quoted saying the party was \"resigned\" to another four years under former President Trump. Ocasio-Cortez, in a post on the social platform X, said Democratic members who feel that way should \"absolutely retire\" from their posts in Congress. \"If you're a... CNN Man killed at Trump rally identified as firefighter Corey Comperatore, who 'died a hero'Firefighter Corey Comperatore was killed during the attempted assassination of former President Donald Trump, Pennsylvania Gov. Josh Shapiro said Sunday. The Independent Ukraine-Russia war live: Two dead in Putin 'double tap' missile attack that hits railway station near KharkivUkraine's president Volodymyr Zelensky visited Ireland on the way back from the Nato summit in Washington Storyful Luke Bryan Crowd Cheers in Support at Mention of Pictures From Trump ShootingAmerican country singer Luke Bryan got applause from the crowd in Cincinnati, Ohio, on July 13, while addressing the attempted assassination of former President Donald Trump in Butler, Pennsylvania, hours earlier.Footage recorded by Brennan Kiley shows the concert at Riverbend Music Center.\"Have you all seen the pictures?\" Bryan asks the crowd, referring to the images of a bloodied Trump with a raised fist leaving the stage after the shooting.The crowd cheered and began chanting \"USA.\"\"I figured you all would be happy about that,\" Bryan adds, \"We're in Ohio.\"A gunman and at least one spectator were killed when shots were fired at Trump during a rally in Butler, Pennsylvania.In a statement on his social media site, Truth Social, Trump said that he was shot and hit by a bullet in the HuffPost Trump Speaks Out After Shooting, Reveals 'Whole Different' Angle To RNC SpeechThe former president explained how his speech this week will be \"a lot different\" after he survived an assassination attempt. HuffPost Mary Trump Reacts To Assassination Attempt On Her Uncle\"It has been a surreal 24 hours,\" Donald Trump's niece said. HuffPost Critics Slam Marjorie Taylor Greene's Rhetoric After Trump Assassination AttemptThe far-right Georgia congresswoman's \"battle between GOOD and EVIL\" rant drew sharp criticism amid calls to lower the tone. Reuters China new home prices fall at fastest pace in 9 years, more support neededBEIJING (Reuters) -China's new home prices in June fell at the fastest clip in nine years while property sales and investment slumped, increasing pressure on policymakers for more stimulus to prop up the battered sector as it struggles to find a bottom. New home prices slid 4.5% from a year earlier, hitting the lowest since June 2015, deeper than a 3.9% slide in May, according to Reuters calculations based on National Bureau of Statistics (NBS) data. Since 2021, the property market's steep downturn has led to a series of developers defaulting, leaving numerous construction sites idle. The Independent 'We are not enemies:' Biden gives forceful Oval Office address following Trump assassination attempt'We are neighbors, friends, co-workers, citizens. Most importantly: we are fellow Americans,' the president says after the assassination attempt on his opponent The Independent Congressman who attended Trump rally says US is now 'like a third-world country' - and 'too radical''It's not the United States of America anymore. It's the divided states of America - and too radical,' the Republican congressman said in the aftermath of the assassination attempt. Sky video Trump assassination attempt: How a large tree may have shielded Trump rally gunman from view of securityA \"fundamental security failure\" allowed a gunman to get close enough to Donald Trump to shoot him, according to an analysis of the scene of the assassination attempt. Reuters Investors react to shooting at Trump election rallyThe Trump campaign later said the former president was \"doing well\" and appeared to have suffered no major injury besides a wound on his upper right ear. \"Perhaps we see the market begin projecting longer-term rates higher, and anticipating lower short-term rates, because I think it's clear that as president, Trump would push for lower rates right away.\" South China Morning Post As China boosts ties with Russia, Belarus, Europe ponders possible rising threatA brisk stroll from the eastern front of the European Union, a company of People's Liberation Army soldiers in full combat gear brandished assault rifles and held aloft the five-star flag of China - in Belarus. A few metres behind them, a row of tanks sat in formation. To their left, a larger gathering of Belarusian soldiers proudly waved their red and green flag in the air. The armies were taking part in an 11-day joint training exercise in the city of Brest, just 5km (3 miles) from the Polish More stories",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Massive crude oil inventory draw supports case for higher Brent - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vbmV3cy9tYXNzaXZlLWNydWRlLW9pbC1pbnZlbnRvcnktZHJhdy1zdXBwb3J0cy1jYXNlLWZvci1oaWdoZXItYnJlbnQtMjAyNDA3MDIv0gFsaHR0cHM6Ly93d3cuZm9yZXhsaXZlLmNvbS9uZXdzL21hc3NpdmUtY3J1ZGUtb2lsLWludmVudG9yeS1kcmF3LXN1cHBvcnRzLWNhc2UtZm9yLWhpZ2hlci1icmVudC0yMDI0MDcwMi9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 20:52:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": "      Massive crude oil inventory draw supports case for higher Brent | Forexlive        ADVERTISEMENT - CONTINUE READING BELOW     Home    >  Massive crude oil inventory draw supports case for higher Brent     News      Oil   Massive crude oil inventory draw supports case for higher Brent   To USD90 and beyond!      Eamonn Sheridan    Tuesday, 02/07/2024 | 20:52 GMT-0     02/07/2024 | 20:52 GMT-0      0       The private survey of oil stocks is out, and its a monster draw:Oil: Private survey of inventory shows a much larger headline crude oil draw than expectedThe official government data is due tomorrow morning out of the US.Oil has been well supported: Analysts at Standard Chartered have a US$90 target, and beyond, in sight: From a fundamental viewpoint, we still think the rally can be sustained well past USD 90/bbl given our projected Q3 and Q4 global oil balances   ADVERTISEMENT - CONTINUE READING BELOW   Tags  Oil  ADVERTISEMENT - CONTINUE READING BELOW   Most Popular   Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)   Weekly Market Outlook (15-19 July)   Statement from Former Pres. Trump after assassination attempt   US June PPI +2.6% vs +2.3% expected   China plenum meeting against the background of calls for more economic stimulus   Former Pres. Trump rushed off stage after apparent shots fired   Dollar gives up light gains from earlier in the day   ADVERTISEMENT - CONTINUE READING BELOW    ADVERTISEMENT - CONTINUE READING BELOW             Contact us     Newsletter          GMT  00:00:00 LON  00:00:00 NY  00:00:00 TKYO  00:00:00 SYD  00:00:00        Get the Forexlive newsletter     Your email         First name         Last name       Select additional content:    Education    Trading offers from relevant providers        By submitting I agree to Forexlive's Terms, Cookies and Privacy Notice.     Submit      Stock Daily Updates AAPL stockAMD stockAMZN stockAXON stock   Top Forex Brokers    Must Read  Kickstart the FX trading day for July 12 w/a technical look at the EURUSD, USDJPY & GBPUSD 🔥📊🚀Unbelievable REAL trading success: A trader turned $200 to $190,000! 🔥📊🚀 How to use fundamentals to trade forex I am shorting oil here near 84-85 USD, see the plan It's not you.. The temperature definitely feels hotter Gold Technical Analysis - The NFP report increased the bullish sentiment Bitcoin technical analysis: Where you can bet on making money (wait for these junctions!)        !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}    ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Exclusive-Russia restoring oil refining capacity knocked out by drones - Yahoo News Australia",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2F1Lm5ld3MueWFob28uY29tL2V4Y2x1c2l2ZS1ydXNzaWEtcmVzdG9yaW5nLW9pbC1yZWZpbmluZy0xMjAwMTM2NzcuaHRtbD9zZXpuYW1fcT0wJm5vX2NvbW1lcmNlPTEmdXRtX3NvdXJjZT13d3cuc2V6bmFtLmN6JnV0bV9tZWRpdW09c2VrY2Utei1pbnRlcm5ldHXSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 01:50:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": " Exclusive-Russia restoring oil refining capacity knocked out by drones Advertisement Close this content Read full article Reuters 15 April 2024 at 4:00 pm·2-min read Link copied The logo of Taneco are seen on tanks at its refinery complex, which is part of Russia's oil producer Tatneft group of companies, in Nizhnekamskin MOSCOW (Reuters) - Russia has been able to swiftly repair some of key oil refineries hit by Ukrainian drones, reducing capacity idled by the attacks to about 10% from almost 14% at the end of March, Reuters calculations showed.Ukraine stepped up drone attacks on Russian energy infrastructure since the start of the year, hitting some major oil refineries across the world's second largest oil exporter in attacks that sent up oil prices.Russia says the drone attacks amount to terrorism. Ukraine says its drone attacks on Russia are justified because it is fighting for survival as Russia has made \"massive retaliatory\" strikes on Ukrainian energy infrastructure.There have been no reports of successful attacks on Russian large refineries since the Taneco plant was hit on April 2.Russia is repairing its refineries fast, despite difficulties in obtaining Western know-how.That includes Rosneft-owned Ryazan plant, which put back he CDU-4 and main CDU-6 primary oil refining units into operation, as well as Kuibyshev refinery repairing CDU-4 and Syzran's CDU-5 and previously idled for maintenance CDU-6.According to Reuters calculations, total Russian primary oil refining capacity, idled by drones, was reduced to 90,500 metric tons per day (660,000 barrels per day) from around 123,800 tons per day (907,000 bpd) previously.However, in total, Russia's cumulative primary oil refining capacity, put offline due to various outages and maintenances, is expected at 4.4 million tons in April, up from 4.1 million tons in March.The respite in Ukraine's strikes comes after criticism from the United States, the world's top energy consumer, where high fuel prices is high up on the agenda in the run up to presidential election on Nov. 5.Replying to Republican U.S. Senator Tom Cotton on why Joe Biden administration was discouraging Ukrainians from the attacks on Russia's \"war-making capabilities\", Defence Secretary Lloyd Austin told the Senate Armed Services committee last week that the attacks could harm global energy markets.\"Certainly, those attacks could have a knock-on effect in terms of the global energy situation, and ... but quite frankly, I think Ukraine is better served by going after tactical and operational targets that can directly influence the current fight,\" he said.(Reporting by Reuters; writing by Vladimir Soldatkin; editing by Guy Faulconbridge and David Evans) Up next Up next Up next Up next Latest stories HuffPost Trump Tells Reporter What He 'Wasn't Expecting' After Assassination AttemptThe former president also detailed a \"little problem\" he's had since the shooting. HuffPost Melania Trump Gives Rare Statement After Donald Trump's Rally ShootingThe former first lady spoke out after former President Donald Trump was wounded in a shooting at a campaign event the previous evening. The Independent Trump rally shooting witness says he saw rifle-toting man 'crawling up the roof' before Secret Service 'blew his head off'Trump's Saturday evening rally descended into chaos when a gunman opened fire before he was 'neutralized' by Secret Service sniper The Independent What we know about gunman Thomas Matthew Crooks who shot at Trump at his Pennsylvania rallyFBI investigating shooting as a potential act of domestic terrorism even as gunman's motive remains elusive Sky News Gunman identified as video shows body and rifle on roof after Trump shootingFederal investigators have identified the man who shot at Donald Trump at a rally in Pennsylvania. Speaking at a news conference overnight, Lieutenant Colonel George Bivens said that officials \"are absolutely not taking for granted that this was a lone wolf attack\" and that law enforcement's priority was to \"identify the motive of the shooting\" and \"if anyone else was involved\". The Daily Beast Secret Service in Crisis: Used Local Cops at Trump RallyIt's been the question on everyone's mind since Donald Trump narrowly escaped death in an assassination attempt Saturday night: How, exactly, was a 20-year-old rifleman able to perch himself on a rooftop just 150 yards away from the former president during a rally?It turns out, the Secret Service's over reliance on Pennsylvania cops may be partially to blame, with a report from The Washington Post revealing Sunday the agency punted the responsibility of surveying and securing some nearby structu Rolling Stone Republican Congressman Baselessly Accuses Biden of Ordering Trump ShootingGOP lawmakers are pushing false conspiracies and blaming Biden for the shooting at the former president's rally The Hill Ocasio-Cortez rips House Democrat over anonymous quote: 'You should absolutely retire'Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday sharply criticized an anonymous \"senior Democrat\" who was quoted saying the party was \"resigned\" to another four years under former President Trump. Ocasio-Cortez, in a post on the social platform X, said Democratic members who feel that way should \"absolutely retire\" from their posts in Congress. \"If you're a... CNN Man killed at Trump rally identified as firefighter Corey Comperatore, who 'died a hero'Firefighter Corey Comperatore was killed during the attempted assassination of former President Donald Trump, Pennsylvania Gov. Josh Shapiro said Sunday. The Independent Ukraine-Russia war live: Two dead in Putin 'double tap' missile attack that hits railway station near KharkivUkraine's president Volodymyr Zelensky visited Ireland on the way back from the Nato summit in Washington Storyful Luke Bryan Crowd Cheers in Support at Mention of Pictures From Trump ShootingAmerican country singer Luke Bryan got applause from the crowd in Cincinnati, Ohio, on July 13, while addressing the attempted assassination of former President Donald Trump in Butler, Pennsylvania, hours earlier.Footage recorded by Brennan Kiley shows the concert at Riverbend Music Center.\"Have you all seen the pictures?\" Bryan asks the crowd, referring to the images of a bloodied Trump with a raised fist leaving the stage after the shooting.The crowd cheered and began chanting \"USA.\"\"I figured you all would be happy about that,\" Bryan adds, \"We're in Ohio.\"A gunman and at least one spectator were killed when shots were fired at Trump during a rally in Butler, Pennsylvania.In a statement on his social media site, Truth Social, Trump said that he was shot and hit by a bullet in the HuffPost Trump Speaks Out After Shooting, Reveals 'Whole Different' Angle To RNC SpeechThe former president explained how his speech this week will be \"a lot different\" after he survived an assassination attempt. HuffPost Mary Trump Reacts To Assassination Attempt On Her Uncle\"It has been a surreal 24 hours,\" Donald Trump's niece said. HuffPost Critics Slam Marjorie Taylor Greene's Rhetoric After Trump Assassination AttemptThe far-right Georgia congresswoman's \"battle between GOOD and EVIL\" rant drew sharp criticism amid calls to lower the tone. Reuters China new home prices fall at fastest pace in 9 years, more support neededBEIJING (Reuters) -China's new home prices in June fell at the fastest clip in nine years while property sales and investment slumped, increasing pressure on policymakers for more stimulus to prop up the battered sector as it struggles to find a bottom. New home prices slid 4.5% from a year earlier, hitting the lowest since June 2015, deeper than a 3.9% slide in May, according to Reuters calculations based on National Bureau of Statistics (NBS) data. Since 2021, the property market's steep downturn has led to a series of developers defaulting, leaving numerous construction sites idle. The Independent 'We are not enemies:' Biden gives forceful Oval Office address following Trump assassination attempt'We are neighbors, friends, co-workers, citizens. Most importantly: we are fellow Americans,' the president says after the assassination attempt on his opponent The Independent Congressman who attended Trump rally says US is now 'like a third-world country' - and 'too radical''It's not the United States of America anymore. It's the divided states of America - and too radical,' the Republican congressman said in the aftermath of the assassination attempt. Sky video Trump assassination attempt: How a large tree may have shielded Trump rally gunman from view of securityA \"fundamental security failure\" allowed a gunman to get close enough to Donald Trump to shoot him, according to an analysis of the scene of the assassination attempt. Reuters Investors react to shooting at Trump election rallyThe Trump campaign later said the former president was \"doing well\" and appeared to have suffered no major injury besides a wound on his upper right ear. \"Perhaps we see the market begin projecting longer-term rates higher, and anticipating lower short-term rates, because I think it's clear that as president, Trump would push for lower rates right away.\" South China Morning Post As China boosts ties with Russia, Belarus, Europe ponders possible rising threatA brisk stroll from the eastern front of the European Union, a company of People's Liberation Army soldiers in full combat gear brandished assault rifles and held aloft the five-star flag of China - in Belarus. A few metres behind them, a row of tanks sat in formation. To their left, a larger gathering of Belarusian soldiers proudly waved their red and green flag in the air. The armies were taking part in an 11-day joint training exercise in the city of Brest, just 5km (3 miles) from the Polish More stories",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]