[
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Business Wire",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDI0MDcwMTEyODEwMC9lbi9BZXRob24tQ29tcGxldGVzLUFjcXVpc2l0aW9uLW9mLVRlbGx1cmlhbi1VcHN0cmVhbS1hbmQtTWlkc3RyZWFtLUFzc2V0c9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:00 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "          Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets | Business Wire                                                         July 01, 2024 08:00 AM Eastern Daylight Time     DALLAS--(BUSINESS WIRE)--Aethon Energy Management LLC (Aethon) today announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375,000 net acres with gathering and treating capacity of over 3 Bcf/d.  Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for two metric tons per annum (mtpa) of liquified natural gas (LNG) from the Driftwood LNG project.  \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for two mtpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\"  \"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston. \"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of U.S. LNG as the global transition fuel and in providing energy security to America's partners around the world.\"  Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel.   About Aethon Energy Management   Aethon Energy Management is a private investment firm and registered investment adviser that manages closed-end funds focused on acquiring, operating, and developing onshore energy resources across North America. Headquartered in Dallas, TX, Aethon has deployed more than $9 billion over a 34-year track record while generating attractive returns for its fund investors across multiple commodity price cycles. Aethon's vertically integrated strategy provides capital efficient growth, combined with disciplined risk management to support cash flow assurance. Today, Aethon is a leading, low-emission operator and one of the largest private natural gas producers and suppliers to LNG facilities in the U.S., including more than 1,700 miles of midstream infrastructure. Please visit www.AethonEnergy.com for more information.       Contacts   Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com  Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com           Release Summary  Aethon Energy announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream and midstream Haynesville assets.      #Hashtags   #Haynesville #LNG #NaturalGas #OilandGas       Social Media Profiles   Aethon Energy's LinkedIn Profile       Contacts   Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com  Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com                         Search      Advanced News Search   Advanced News Search              Log In Sign Up          "
  },
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Chronicle-Tribune",
    "Link": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5jaHJvbmljbGUtdHJpYnVuZS5jb20vbmV3cy93aXJlL2FldGhvbi1jb21wbGV0ZXMtYWNxdWlzaXRpb24tb2YtdGVsbHVyaWFuLXVwc3RyZWFtLWFuZC1taWRzdHJlYW0tYXNzZXRzL2FydGljbGVfYjk4NzRhZjktMjhkZC01ZTk1LTg4OGYtMjhlYWYxYjg5NTYzLmh0bWzSAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:49 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "Google NewsOpening https://www.chronicle-tribune.com/news/wire/aethon-completes-acquisition-of-tellurian-upstream-and-midstream-assets/article_b9874af9-28dd-5e95-888f-28eaf1b89563.html"
  },
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Business Wire",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDI0MDcwMTEyODEwMC9lbi9BZXRob24tQ29tcGxldGVzLUFjcXVpc2l0aW9uLW9mLVRlbGx1cmlhbi1VcHN0cmVhbS1hbmQtTWlkc3RyZWFtLUFzc2V0c9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:00 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "          Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets | Business Wire                                                         July 01, 2024 08:00 AM Eastern Daylight Time     DALLAS--(BUSINESS WIRE)--Aethon Energy Management LLC (Aethon) today announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets. Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375,000 net acres with gathering and treating capacity of over 3 Bcf/d.  Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for two metric tons per annum (mtpa) of liquified natural gas (LNG) from the Driftwood LNG project.  \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for two mtpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\"  \"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston. \"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of U.S. LNG as the global transition fuel and in providing energy security to America's partners around the world.\"  Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel.   About Aethon Energy Management   Aethon Energy Management is a private investment firm and registered investment adviser that manages closed-end funds focused on acquiring, operating, and developing onshore energy resources across North America. Headquartered in Dallas, TX, Aethon has deployed more than $9 billion over a 34-year track record while generating attractive returns for its fund investors across multiple commodity price cycles. Aethon's vertically integrated strategy provides capital efficient growth, combined with disciplined risk management to support cash flow assurance. Today, Aethon is a leading, low-emission operator and one of the largest private natural gas producers and suppliers to LNG facilities in the U.S., including more than 1,700 miles of midstream infrastructure. Please visit www.AethonEnergy.com for more information.       Contacts   Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com  Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com           Release Summary  Aethon Energy announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream and midstream Haynesville assets.      #Hashtags   #Haynesville #LNG #NaturalGas #OilandGas       Social Media Profiles   Aethon Energy's LinkedIn Profile       Contacts   Clayton McGratty Phone: +1 (214) 356-7959 Email: cmcgratty@aethonenergy.com  Andrew Von Kerens Phone: +1(817) 456-2280 Email: avonkerens@aethonenergy.com                         Search      Advanced News Search   Advanced News Search              Log In Sign Up          "
  },
  {
    "Title": "Aethon Completes Acquisition of Tellurian Upstream and Midstream Assets - Chronicle-Tribune",
    "Link": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5jaHJvbmljbGUtdHJpYnVuZS5jb20vbmV3cy93aXJlL2FldGhvbi1jb21wbGV0ZXMtYWNxdWlzaXRpb24tb2YtdGVsbHVyaWFuLXVwc3RyZWFtLWFuZC1taWRzdHJlYW0tYXNzZXRzL2FydGljbGVfYjk4NzRhZjktMjhkZC01ZTk1LTg4OGYtMjhlYWYxYjg5NTYzLmh0bWzSAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 12:00:49 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "Google NewsOpening https://www.chronicle-tribune.com/news/wire/aethon-completes-acquisition-of-tellurian-upstream-and-midstream-assets/article_b9874af9-28dd-5e95-888f-28eaf1b89563.html"
  },
  {
    "Title": "Bedford gas leak after drilling company hits natural gas pocket - BBC.com",
    "Link": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9hcnRpY2xlcy9jeHcybnc0M3A0cm_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 17:47:08 GMT",
    "Categories": [
      "Company News",
      "Exploration"
    ],
    "Content": " Bedford gas leak after drilling company hits natural gas pocket Skip to content HomeNewsIsrael-Gaza WarWar in UkraineUK General ElectionUS & CanadaUKUK PoliticsEnglandN. IrelandN. Ireland PoliticsScotlandScotland PoliticsWalesWales PoliticsAfricaAsiaChinaIndiaAustraliaEuropeLatin AmericaMiddle EastIn PicturesBBC VerifySportBusinessExecutive LoungeTechnology of BusinessInnovationTechnologyScience & HealthArtificial IntelligenceCultureFilm & TVMusicArt & DesignStyleBooksEntertainment NewsTravelDestinationsAfricaAntarcticaAsiaAustralia and PacificCaribbean & BermudaCentral AmericaEuropeMiddle EastNorth AmericaSouth AmericaWorld's TableCulture & ExperiencesAdventuresThe SpeciaListEarthNatural WondersWeather & ScienceClimate SolutionsSustainable BusinessGreen LivingVideoLiveLive NewsLive Sport Home News Sport Business Innovation Culture Travel Earth Video Live Audio Weather Newsletters Gas leak: Roads could be closed for two days  7 days ago Share Google Road closures are in place at Cleat Hill, Kimbolton Road, Glenrose Avenue and Wagstaffe Close A drilling company caused a gas leak in a residential area after hitting a pocket of natural gas.Bedfordshire Fire and Rescue have been at the scene in Cleat Hill, Bedford, since 15:00 BST on Tuesday and warned nearby road closures could remain in place until Thursday.Nicholls Boreholes and Ground Source said they had been drilling a borehole for a heat pump when they \"encountered a pocket of naturally occurring gas at approximately 100 meters below ground level\". It added: \"The borehole has been temporarily capped to control the flow of gas whilst we work with the emergency services to permanently close the borehole. Bedfordshire Police put a cordon in place and assisted with road closures. Follow Beds, Herts and Bucks news on  Facebook ,  Instagram  and  X . Got a story? Email  eastofenglandnews@bbc.co.uk  or WhatsApp us on 0800 169 1830 More on this story Homes evacuated after builder dug into gas pipe Homes evacuated and roads closed due to gas leak Homes evacuated over gas leak fire Related internet links Bedfordshire Fire and Rescue Service Bedfordshire Police Bedford Bedfordshire and Luton Fire and Rescue Service"
  },
  {
    "Title": "Aethon completes acquisition of Tellurian upstream and midstream assets - World Pipelines",
    "Link": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LndvcmxkcGlwZWxpbmVzLmNvbS9idXNpbmVzcy1uZXdzLzAzMDcyMDI0L2FldGhvbi1jb21wbGV0ZXMtYWNxdWlzaXRpb24tb2YtdGVsbHVyaWFuLXVwc3RyZWFtLWFuZC1taWRzdHJlYW0tYXNzZXRzL9IBggFodHRwczovL3d3dy53b3JsZHBpcGVsaW5lcy5jb20vYnVzaW5lc3MtbmV3cy8wMzA3MjAyNC9hZXRob24tY29tcGxldGVzLWFjcXVpc2l0aW9uLW9mLXRlbGx1cmlhbi11cHN0cmVhbS1hbmQtbWlkc3RyZWFtLWFzc2V0cy9hbXAv?oc=5",
    "Published": "Wed, 03 Jul 2024 08:25:02 GMT",
    "Categories": [
      "Company News"
    ],
    "Content": "      Aethon completes acquisition of Tellurian upstream and midstream assets | World Pipelines                        For full functionality of this site it is necessary to enable JavaScript. Here are the  instructions how to enable JavaScript in your web browser.      Skip to main content         Advertisement                   Home Business news 03 Jul 24 Aethon completes acquisition of Tellurian upstream and midstream assets                   Advertisement        Aethon Energy Management LLC (Aethon) has announced the successful closing of Aethon's acquisition of Tellurian's integrated upstream assets.  Aethon's footprint across its Fund II and Fund III assets in the Haynesville Shale now includes approximately 375 000 net acres with gathering and treating capacity of over 3 billion ft 3 /d.Concurrent with the acquisition, Aethon also signed a Heads of Agreement (HOA) for 2 metric tpa of LNG from the Driftwood LNG project. \"As a private equity firm and operator, we are excited to enhance our strategic footprint by integrating Tellurian's upstream and midstream assets into our extensive Haynesville position,\" said Gordon Huddleston, President and Partner of Aethon Energy. \"Our goal is to generate compelling returns while supporting the communities we operate in as we make progress towards providing net zero natural gas to both domestic and international customers. We continue to work with Tellurian on a long-term sale and purchase agreement for 2 metric tpa of LNG and believe in the many benefits that low emission exports have for the broader energy transition.\"\"This transaction is a significant step in securing our balance sheet and progressing Driftwood,\" added Tellurian Executive Chairman Martin Houston.\"The partnership between Aethon and Tellurian is vital as we continue securing buyers for Driftwood's remaining capacity and advance its development. Our agreement validates the role of US LNG as the global transition fuel and in providing energy security to America's partners around the world.\"Citi and Truist Securities served as financial advisors to Aethon, and Gibson Dunn as legal counsel. Lazard was financial advisor to Tellurian, and Akin Gump provided legal counsel.  Read the article online at: https://www.worldpipelines.com/business-news/03072024/aethon-completes-acquisition-of-tellurian-upstream-and-midstream-assets/        You might also like      Labour has policy tools to advance its climate goals but not all have been discussed during the election or set out in its manifesto, says GlobalData.       Embed       Embed article link:  (copy the HTML code below): Aethon completes acquisition of Tellurian upstream and midstream assets                       xClose      This content is available to registered readers of our magazine only. Please  sign in  or  register  for free.   Benefits include    Access to locked videos & articles  Downloadable white papers  Full website access   Register for free >> Get started now for absolutely FREE, no credit card required.  Already a member? Sign in here                       xClose        Do you have the right tools to harness your data effectively? Join us on 17 July for a live webinar and Q&A session with dataPARC entitled 'Beyond ProcessBook & PI Vision: Exploring Today's Industrial Analytics Tools'.   Register for FREE                "
  }
]