[
  {
    "Title": "Exclusive-Russia restoring oil refining capacity knocked out by drones - Yahoo News Australia",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2F1Lm5ld3MueWFob28uY29tL2V4Y2x1c2l2ZS1ydXNzaWEtcmVzdG9yaW5nLW9pbC1yZWZpbmluZy0xMjAwMTM2NzcuaHRtbD9zZXpuYW1fcT0wJm5vX2NvbW1lcmNlPTEmdXRtX3NvdXJjZT13d3cuc2V6bmFtLmN6JnV0bV9tZWRpdW09c2VrY2Utei1pbnRlcm5ldHXSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 01:50:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": " Exclusive-Russia restoring oil refining capacity knocked out by drones Advertisement Close this content Read full article Reuters 15 April 2024 at 4:00 pm·2-min read Link copied The logo of Taneco are seen on tanks at its refinery complex, which is part of Russia's oil producer Tatneft group of companies, in Nizhnekamskin MOSCOW (Reuters) - Russia has been able to swiftly repair some of key oil refineries hit by Ukrainian drones, reducing capacity idled by the attacks to about 10% from almost 14% at the end of March, Reuters calculations showed.Ukraine stepped up drone attacks on Russian energy infrastructure since the start of the year, hitting some major oil refineries across the world's second largest oil exporter in attacks that sent up oil prices.Russia says the drone attacks amount to terrorism. Ukraine says its drone attacks on Russia are justified because it is fighting for survival as Russia has made \"massive retaliatory\" strikes on Ukrainian energy infrastructure.There have been no reports of successful attacks on Russian large refineries since the Taneco plant was hit on April 2.Russia is repairing its refineries fast, despite difficulties in obtaining Western know-how.That includes Rosneft-owned Ryazan plant, which put back he CDU-4 and main CDU-6 primary oil refining units into operation, as well as Kuibyshev refinery repairing CDU-4 and Syzran's CDU-5 and previously idled for maintenance CDU-6.According to Reuters calculations, total Russian primary oil refining capacity, idled by drones, was reduced to 90,500 metric tons per day (660,000 barrels per day) from around 123,800 tons per day (907,000 bpd) previously.However, in total, Russia's cumulative primary oil refining capacity, put offline due to various outages and maintenances, is expected at 4.4 million tons in April, up from 4.1 million tons in March.The respite in Ukraine's strikes comes after criticism from the United States, the world's top energy consumer, where high fuel prices is high up on the agenda in the run up to presidential election on Nov. 5.Replying to Republican U.S. Senator Tom Cotton on why Joe Biden administration was discouraging Ukrainians from the attacks on Russia's \"war-making capabilities\", Defence Secretary Lloyd Austin told the Senate Armed Services committee last week that the attacks could harm global energy markets.\"Certainly, those attacks could have a knock-on effect in terms of the global energy situation, and ... but quite frankly, I think Ukraine is better served by going after tactical and operational targets that can directly influence the current fight,\" he said.(Reporting by Reuters; writing by Vladimir Soldatkin; editing by Guy Faulconbridge and David Evans) Up next Up next Up next Up next Latest stories HuffPost Maggie Haberman Says 'This Is Exactly What Trump's Advisers Had Been Concerned About'It's turned it into \"a bigger deal,\" said the New York Times reporter. The Daily Beast Desperate Russia's Wild Lies Leave Soldiers Waving Red UnderpantsRussia's bloody invasion of Ukraine continues to claim lives, as the Kremlin's military leadership resorts to increasingly brutal tactics against civilians-including a ghastly attack on a children's hospital in Kyiv and other sites across Ukraine. In their comments on state television, prominent propagandists often reiterate that Moscow's campaign of senseless brutality is designed to prompt Ukrainians to overthrow their government. Russian talking heads also resort to nuclear threats, which is HuffPost Ex-Aide Reveals Why Donald Trump Is 'Afraid' Of Kamala HarrisAlyssa Farah Griffin also explained why the former president isn't really \"out there shouting about the debate\" with Joe Biden. Sky News Ex-army chief issues WW3 warning and brands 'new axis powers' more dangerous than the NazisA former army chief has warned members of NATO the world is facing \"as dangerous a moment as any time that we've had since 1945\" as he called on members to invest more into their arms. General Sir Patrick Sanders, who served as chief of the general staff until last month, told The Times that Russia, China and Iran were the \"new axis powers\", and a third world war could break out within the next five years if action was not taken. Arguing the countries posed even more of a threat than the Nazis in 1939, he said: \"They are more interdependent and more aligned than the original axis powers were.\" CNN Flying aboard the Ghostrider, a deadly aircraft carrying America's biggest gun in the skyThe AC-130's presence for drills in South Korea was designed to send a simple message to its belligerent neighbor North Korea - deterrence. The Independent Ukraine war: Why China is conducting military exercises in BelarusBelarus has played a vital role in Russia's war against Ukraine The Daily Beast Ivanka Trump Resurfaces as Dad's Re-Election Fortunes ChangeIvanka Trump's political intermission appears to be over.The businesswoman and former White House adviser is creeping back into the spotlight after she chose the beach over the ballot box when her father, Donald Trump, made an ugly exit from the White House following his election loss and the Jan. 6 Capitol insurrection.At the time, Ivanka said she wanted to leave politics to focus on her kids and her entrepreneurial pursuits, lamenting that she was proud of what she'd accomplished and had \"left CNN Trump-appointed judge in Alaska resigns after investigation finds he had 'inappropriately sexualized relationship'A US district court judge in Alaska who was appointed by former President Donald Trump abruptly announced his resignation from the federal bench last week, days before allegations that he engaged in an \"inappropriately sexualized relationship\" with one of his law clerks were released publicly. Yahoo Finance AU Dangerous housing trend costs Aussies tens of thousands as 'forced sells' loomHouse prices are unlikely to 'crash' anytime soon, but they could soon stop reaching record highs, writes finance expert Stephen Koukoulas. NewsWire Higgins breaks silence on court dramaBrittany Higgins has broken her silence on the long running legal dispute with her former boss after documents were given to the media. HuffPost Democratic Lawmaker Points Out Trump-Sized Elephant In The Room On Fox NewsRep. Jake Auchincloss flipped focus back to the GOP after he was asked about the discussions surrounding Biden's candidacy. Evening Standard Barron Trump makes US election campaign rally debut as father Donald tells 18-year-old: 'Welcome to the scene'Donald Trump tells supporters son had 'had such a nice, easy life - now it's a little bit changed' The Independent What are hypersonic missiles and why is the West developing them amid Russia's war in Ukraine?Kinzhal missiles believed to have been used as part of attack which killed at least 23 people and reduced children's hospital in Kyiv to rubble South China Morning Post China says grounded Philippine warship harms Second Thomas Shoal marine life and must be removedThe Philippine warship grounded 25 years ago at the Second Thomas Shoal in the South China Sea has caused serious harm to the marine environment and must be removed immediately to stop the damage, the Chinese government said on Monday. The investigation report released by China's Ministry of Natural Resources concluded that the BRP Sierra Madre, which the Philippine navy ran aground in 1999 to serve as an outpost in the disputed waters, has \"seriously damaged the diversity, stability and sustain The Independent Elite North Korean unit heads to Russia for first military exchange after Putin-Kim summitThis is the first announced military exchange between the two nations since Russian president Vladimir Putin visited Pyongyang last month Australian Associated Press Australia to announce Ukraine aid as NATO looks eastUkraine will receive further military support from Australia, the government has hinted as the defence minister shores up NATO support for the Indo-Pacific. The Daily Beast Biden Faces Make-or-Break Democratic Meeting-and He Won't Be TherePresident Joe Biden already had his version of the Alamo on Friday. Tuesday could end up being his judgment day.Congressional Democrats weighing Biden's political future are set to meet Tuesday morning behind closed doors, with no cellphones allowed.Although there are many more members falling into the \"all-in for Joe\" column than those publicly calling for the president to step aside, according to a CNN running tally, there are still plenty of private discussions over how to approach what has e Bloomberg Russia's Embrace of Chinese Yuan Stalls Over Risk From Sanctions(Bloomberg) -- The rapid uptake of China's yuan in President Vladimir Putin's war economy, spurred by the fallout with the West over the invasion of Ukraine, may have hit its limit.Most Read from BloombergSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatHurricane Beryl Makes a Mockery of Texas Climate DeniersMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidThe End of the Cheap Money Era Catches Up to Chelsea FC's OwnerAsia's Richest Banker Gets Caught in Adani-Hind HuffPost Stephen Colbert Delivers 'Painful' Personal Message To BidenThe \"Late Show\" host gave the president a blunt look at the choice he's facing. CNN Troubled US military pier near Gaza to be permanently removed as soon as next week, US officials sayThe US military pier off the coast of Gaza is set to be permanently removed as soon as next week, according to four US officials, after it is reconnected one more time to deliver any remaining humanitarian aid in Cyprus and on the floating dock several miles offshore. More stories"
  },
  {
    "Title": "Massive crude oil inventory draw supports case for higher Brent - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vbmV3cy9tYXNzaXZlLWNydWRlLW9pbC1pbnZlbnRvcnktZHJhdy1zdXBwb3J0cy1jYXNlLWZvci1oaWdoZXItYnJlbnQtMjAyNDA3MDIv0gFsaHR0cHM6Ly93d3cuZm9yZXhsaXZlLmNvbS9uZXdzL21hc3NpdmUtY3J1ZGUtb2lsLWludmVudG9yeS1kcmF3LXN1cHBvcnRzLWNhc2UtZm9yLWhpZ2hlci1icmVudC0yMDI0MDcwMi9hbXAv?oc=5",
    "Published": "Tue, 02 Jul 2024 20:52:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": "      Massive crude oil inventory draw supports case for higher Brent | Forexlive        ADVERTISEMENT - CONTINUE READING BELOW     Home    >  Massive crude oil inventory draw supports case for higher Brent     News      Oil   Massive crude oil inventory draw supports case for higher Brent   To USD90 and beyond!      Eamonn Sheridan    Tuesday, 02/07/2024 | 20:52 GMT-0     02/07/2024 | 20:52 GMT-0      0       The private survey of oil stocks is out, and its a monster draw:Oil: Private survey of inventory shows a much larger headline crude oil draw than expectedThe official government data is due tomorrow morning out of the US.Oil has been well supported: Analysts at Standard Chartered have a US$90 target, and beyond, in sight: From a fundamental viewpoint, we still think the rally can be sustained well past USD 90/bbl given our projected Q3 and Q4 global oil balances   ADVERTISEMENT - CONTINUE READING BELOW   Tags  Oil  ADVERTISEMENT - CONTINUE READING BELOW   Most Popular   AUDUSD traders push against close support but has work to do.   BOJ shares briefing material on meeting with bond market participants   Japan finance minister Suzuki says fiscal discipline important   How much more confident will Powell be on inflation?   A late rally pushes the S&P and NASDAQ to record levels once again   More on the BOJ meetings with JGB market players   Biden interview: I am running   ADVERTISEMENT - CONTINUE READING BELOW    ADVERTISEMENT - CONTINUE READING BELOW             Contact us     Newsletter          GMT  00:00:00 LON  00:00:00 NY  00:00:00 TKYO  00:00:00 SYD  00:00:00        Get the Forexlive newsletter     Your email         First name         Last name       Select additional content:    Education    Trading offers from relevant providers        By submitting I agree to Forexlive's Terms, Cookies and Privacy Notice.     Submit      Stock Daily Updates AAPL stockAMD stockAMZN stockAXON stock   Top Forex Brokers    Must Read  Why Fed easing will come too late to prevent a major slowdown in growth 🔥📊🚀Unbelievable REAL trading success: A trader turned $200 to $190,000! 🔥📊🚀 How to use fundamentals to trade forex I am shorting oil here near 84-85 USD, see the plan It's not you.. The temperature definitely feels hotter Gold Technical Analysis - The NFP report increased the bullish sentiment        !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}    "
  },
  {
    "Title": "Exclusive-Russia restoring oil refining capacity knocked out by drones - Yahoo News Australia",
    "Link": "https://news.google.com/rss/articles/CBMinwFodHRwczovL2F1Lm5ld3MueWFob28uY29tL2V4Y2x1c2l2ZS1ydXNzaWEtcmVzdG9yaW5nLW9pbC1yZWZpbmluZy0xMjAwMTM2NzcuaHRtbD9zZXpuYW1fcT0wJm5vX2NvbW1lcmNlPTEmdXRtX3NvdXJjZT13d3cuc2V6bmFtLmN6JnV0bV9tZWRpdW09c2VrY2Utei1pbnRlcm5ldHXSAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 01:50:00 GMT",
    "Categories": [
      "Refining"
    ],
    "Content": " Exclusive-Russia restoring oil refining capacity knocked out by drones Advertisement Close this content Read full article Reuters 15 April 2024 at 4:00 pm·2-min read Link copied The logo of Taneco are seen on tanks at its refinery complex, which is part of Russia's oil producer Tatneft group of companies, in Nizhnekamskin MOSCOW (Reuters) - Russia has been able to swiftly repair some of key oil refineries hit by Ukrainian drones, reducing capacity idled by the attacks to about 10% from almost 14% at the end of March, Reuters calculations showed.Ukraine stepped up drone attacks on Russian energy infrastructure since the start of the year, hitting some major oil refineries across the world's second largest oil exporter in attacks that sent up oil prices.Russia says the drone attacks amount to terrorism. Ukraine says its drone attacks on Russia are justified because it is fighting for survival as Russia has made \"massive retaliatory\" strikes on Ukrainian energy infrastructure.There have been no reports of successful attacks on Russian large refineries since the Taneco plant was hit on April 2.Russia is repairing its refineries fast, despite difficulties in obtaining Western know-how.That includes Rosneft-owned Ryazan plant, which put back he CDU-4 and main CDU-6 primary oil refining units into operation, as well as Kuibyshev refinery repairing CDU-4 and Syzran's CDU-5 and previously idled for maintenance CDU-6.According to Reuters calculations, total Russian primary oil refining capacity, idled by drones, was reduced to 90,500 metric tons per day (660,000 barrels per day) from around 123,800 tons per day (907,000 bpd) previously.However, in total, Russia's cumulative primary oil refining capacity, put offline due to various outages and maintenances, is expected at 4.4 million tons in April, up from 4.1 million tons in March.The respite in Ukraine's strikes comes after criticism from the United States, the world's top energy consumer, where high fuel prices is high up on the agenda in the run up to presidential election on Nov. 5.Replying to Republican U.S. Senator Tom Cotton on why Joe Biden administration was discouraging Ukrainians from the attacks on Russia's \"war-making capabilities\", Defence Secretary Lloyd Austin told the Senate Armed Services committee last week that the attacks could harm global energy markets.\"Certainly, those attacks could have a knock-on effect in terms of the global energy situation, and ... but quite frankly, I think Ukraine is better served by going after tactical and operational targets that can directly influence the current fight,\" he said.(Reporting by Reuters; writing by Vladimir Soldatkin; editing by Guy Faulconbridge and David Evans) Up next Up next Up next Up next Latest stories HuffPost Maggie Haberman Says 'This Is Exactly What Trump's Advisers Had Been Concerned About'It's turned it into \"a bigger deal,\" said the New York Times reporter. The Daily Beast Desperate Russia's Wild Lies Leave Soldiers Waving Red UnderpantsRussia's bloody invasion of Ukraine continues to claim lives, as the Kremlin's military leadership resorts to increasingly brutal tactics against civilians-including a ghastly attack on a children's hospital in Kyiv and other sites across Ukraine. In their comments on state television, prominent propagandists often reiterate that Moscow's campaign of senseless brutality is designed to prompt Ukrainians to overthrow their government. Russian talking heads also resort to nuclear threats, which is HuffPost Ex-Aide Reveals Why Donald Trump Is 'Afraid' Of Kamala HarrisAlyssa Farah Griffin also explained why the former president isn't really \"out there shouting about the debate\" with Joe Biden. Sky News Ex-army chief issues WW3 warning and brands 'new axis powers' more dangerous than the NazisA former army chief has warned members of NATO the world is facing \"as dangerous a moment as any time that we've had since 1945\" as he called on members to invest more into their arms. General Sir Patrick Sanders, who served as chief of the general staff until last month, told The Times that Russia, China and Iran were the \"new axis powers\", and a third world war could break out within the next five years if action was not taken. Arguing the countries posed even more of a threat than the Nazis in 1939, he said: \"They are more interdependent and more aligned than the original axis powers were.\" CNN Flying aboard the Ghostrider, a deadly aircraft carrying America's biggest gun in the skyThe AC-130's presence for drills in South Korea was designed to send a simple message to its belligerent neighbor North Korea - deterrence. The Independent Ukraine war: Why China is conducting military exercises in BelarusBelarus has played a vital role in Russia's war against Ukraine The Daily Beast Ivanka Trump Resurfaces as Dad's Re-Election Fortunes ChangeIvanka Trump's political intermission appears to be over.The businesswoman and former White House adviser is creeping back into the spotlight after she chose the beach over the ballot box when her father, Donald Trump, made an ugly exit from the White House following his election loss and the Jan. 6 Capitol insurrection.At the time, Ivanka said she wanted to leave politics to focus on her kids and her entrepreneurial pursuits, lamenting that she was proud of what she'd accomplished and had \"left CNN Trump-appointed judge in Alaska resigns after investigation finds he had 'inappropriately sexualized relationship'A US district court judge in Alaska who was appointed by former President Donald Trump abruptly announced his resignation from the federal bench last week, days before allegations that he engaged in an \"inappropriately sexualized relationship\" with one of his law clerks were released publicly. Yahoo Finance AU Dangerous housing trend costs Aussies tens of thousands as 'forced sells' loomHouse prices are unlikely to 'crash' anytime soon, but they could soon stop reaching record highs, writes finance expert Stephen Koukoulas. NewsWire Higgins breaks silence on court dramaBrittany Higgins has broken her silence on the long running legal dispute with her former boss after documents were given to the media. HuffPost Democratic Lawmaker Points Out Trump-Sized Elephant In The Room On Fox NewsRep. Jake Auchincloss flipped focus back to the GOP after he was asked about the discussions surrounding Biden's candidacy. Evening Standard Barron Trump makes US election campaign rally debut as father Donald tells 18-year-old: 'Welcome to the scene'Donald Trump tells supporters son had 'had such a nice, easy life - now it's a little bit changed' The Independent What are hypersonic missiles and why is the West developing them amid Russia's war in Ukraine?Kinzhal missiles believed to have been used as part of attack which killed at least 23 people and reduced children's hospital in Kyiv to rubble South China Morning Post China says grounded Philippine warship harms Second Thomas Shoal marine life and must be removedThe Philippine warship grounded 25 years ago at the Second Thomas Shoal in the South China Sea has caused serious harm to the marine environment and must be removed immediately to stop the damage, the Chinese government said on Monday. The investigation report released by China's Ministry of Natural Resources concluded that the BRP Sierra Madre, which the Philippine navy ran aground in 1999 to serve as an outpost in the disputed waters, has \"seriously damaged the diversity, stability and sustain The Independent Elite North Korean unit heads to Russia for first military exchange after Putin-Kim summitThis is the first announced military exchange between the two nations since Russian president Vladimir Putin visited Pyongyang last month Australian Associated Press Australia to announce Ukraine aid as NATO looks eastUkraine will receive further military support from Australia, the government has hinted as the defence minister shores up NATO support for the Indo-Pacific. The Daily Beast Biden Faces Make-or-Break Democratic Meeting-and He Won't Be TherePresident Joe Biden already had his version of the Alamo on Friday. Tuesday could end up being his judgment day.Congressional Democrats weighing Biden's political future are set to meet Tuesday morning behind closed doors, with no cellphones allowed.Although there are many more members falling into the \"all-in for Joe\" column than those publicly calling for the president to step aside, according to a CNN running tally, there are still plenty of private discussions over how to approach what has e Bloomberg Russia's Embrace of Chinese Yuan Stalls Over Risk From Sanctions(Bloomberg) -- The rapid uptake of China's yuan in President Vladimir Putin's war economy, spurred by the fallout with the West over the invasion of Ukraine, may have hit its limit.Most Read from BloombergSaudis Warned G-7 Over Russia Seizures With Debt Sale ThreatHurricane Beryl Makes a Mockery of Texas Climate DeniersMicrosoft Orders China Staff to Use iPhones for Work and Drop AndroidThe End of the Cheap Money Era Catches Up to Chelsea FC's OwnerAsia's Richest Banker Gets Caught in Adani-Hind HuffPost Stephen Colbert Delivers 'Painful' Personal Message To BidenThe \"Late Show\" host gave the president a blunt look at the choice he's facing. CNN Troubled US military pier near Gaza to be permanently removed as soon as next week, US officials sayThe US military pier off the coast of Gaza is set to be permanently removed as soon as next week, according to four US officials, after it is reconnected one more time to deliver any remaining humanitarian aid in Cyprus and on the floating dock several miles offshore. More stories"
  }
]