[
  {
    "Title": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited",
    "Link": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmx1ZXByaW50Lm5nL2RhbmdvdGUtcmVmaW5lcnktY3J1ZGUtb2lsLXN1cHBseS1vcHRpb25zL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 07:23:30 GMT",
    "Categories": [
      "Production Updates",
      "Supply and Demand"
    ],
    "Content": " Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited      Skip to content   The international corporations drilling oil in Nigeria are the country's greatest enemies. They have never hidden their condescension for Nigeria even as they are allowed to operate the industry on their own terms. In fact, the IOCs are partially responsible for Nigeria's total dependence on imported refined petroleum products.The international oil companies (IOCs) are compelled to operate refineries in most of the countries they drill oil. In Nigeria they defiantly snubbed the federal government's directives that they should establish refineries. Their excuse was that no refinery could succeed in Nigeria because the federal government stands around to fix unacceptable pump prices for refined petroleum products.Aliko Dangote, president of the Dangote Group, and some development banks in the international money market came together to prove that the treacherous oil firms exploiting crude oil in Nigeria were telling transparent lies when they refused to establish refineries in Nigeria on the grounds that the pump prices of refined petroleum products were controlled by the federal government. The international money market advanced loans close to $9 billion to Dangote for the establishment of what is now acknowledged as one of the world's largest refineries.No one would advance such a colossal sum as a loan for a venture known to have no means of repaying the loan. The fact that the international development banks were willing to fund Dangote Refinery is a clear indication that the venture was viable and could not be bugged down by government regulation of the pump prices of refined petroleum products.The lies of the IOCs were exposed by the success in sourcing for funds to build a giant refinery in Nigeria.The mischievous oil firms were disgraced as their lies were exposed. They gnashed their teeth and proceeded to wait for Dangote and the Nigerian people down the road.The refinery they were determined to truncate came on stream in January 2024 and in apparent frustration they drew up fresh plans to sabotage the business of the refinery and keep Nigeria as a perpetual importer of refined petroleum products.They know that if Dangote Refinery succeeds, the refineries in Europe that were supplying refined petroleum products to Nigeria at a catastrophic cost of well over $20 billion annually could be out of businessThey decided to use the last weapon in their armoury to frustrate Dangote Refinery. They defiantly refused to sell crude oil to Dangote. Those who reluctantly offer to sell the feedstock put their price tag at $6 above what obtains in the international market.Consequently, Dangote has been compelled to import crude oil for his refinery from the United States of America (USA) when Nigeria remains the highest producer of crude oil in Africa.The treacherous international oil companies operating in Nigeria have finally held Dangote Refinery and the Nigerian people in the jugular.Diesel from Dangote Refinery is more expensive than the high sulfur diesels imported by independent petroleum marketers from Europe into Nigeria.The most painful aspect of the sabotage by the IOCs is that the regulator of the industry sees nothing wrong with collaborating with foreigners to frustrate a Nigerian venture designed to ease the merciless grip of European petroleum refiners on Nigerians.The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) apathetically issues licences to independent petroleum marketers to import diesel from Europe with a weak naira and torment Nigerian consumers with high energy cost that escalates the country's catastrophic inflationary trend.When newsmen confronted the agency on the illogicality of encouraging diesel imports when a Nigerian refinery is ready to supply, NMDPRA retorted that in a deregulated market, marketers are free to source diesel from anywhere.NMDPRA is the regulatory arm of the Nigerian National Petroleum Company Limited (NNPCL). The company is more or less an appendage of the mischievous international oil companies battling to protect the interest of European crude oil refiners patronised by NNPCL.NNPCL, as industry regulator, could order the deceitful IOCs to sell crude oil to Dangote Refinery at international market price. But it could only do so to the detriment of its own selfish interest.NNPCL would lose trillions of naira if Dangote Refinery gets crude oil from Nigeria and sells refined petroleum products locally at reduced pump prices.That would mean the end of the petrol subsidy scandal through which the company rakes in trillions of naira annually. That explains why NNPCL allows foreign exploiters to frustrate Dangote Refinery.NNPCL has unrestrained powers to supply crude oil to Dangote Refinery which at the moment is the only way to ease the asphyxiating hold of high energy cost on Nigeria's economy.If the treacherous IOCs defy NNPCL's directive to supply crude oil to Dangote Refinery at international market rate, the company could do the job by itself.NNPCL allocates 445,000 barrels of crude oil daily to Nigeria's moribund refineries. Nigeria's four refineries have not refined a barrel of crude oil in the last three years.Consequently, NNPCL exports the 445,000 barrels of crude oil daily to foreign refineries that feed Nigeria with refined petroleum products in return. If NNPCL reroutes the crude oil to Dangote Refinery, Nigeria would benefit extensively.The foreign refineries use the residue of the crude oil supplied by NNPCL for their petrochemical products and export them to Nigeria. If Dangote Refinery gets the crude oil, the residue would be used to produce resins that would be used to ease the escalating cost of producing plastic containers in the soft drink and brewery industries.Besides, NNPCL owes Dangote Refinery the sum of $1.7 billion as part of the 20 per cent equity it bought. It was expected to pay back with 300,000 barrels of crude oil daily. Its refusal to supply borders on betrayal of trust.It is rather saddening that Mele Kyari, the man who navigated NNPCL through the horrendous petrol subsidy scandal and crude oil theft, is still its group managing director. The man should do the right thing.   WhatsApp Email LinkedIn Twitter  Facebook   Related Posts     Soyinka: The icon for whom apologies are unnecessary  July 14, 2024July 14, 2024     FACT CHECK: Ekpa's false claims of foreign backing debunked  July 14, 2024July 14, 2024     The rumblings in Plateau over move to recall Lalong, 2 others  July 13, 2024July 13, 2024 About Jerry Uwah  View all posts by Jerry Uwah →   ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibmh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1zZWVzYXctYWZ0ZXItdW5pbnNwaXJpbmctZWlhLXByaW50LXNpZ25zLW9mLWVhc2luZy1kZW1hbmQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 22:00:03 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            August Nymex natural gas futures attempted to break a six-day losing streak, but ultimately settled slightly in the negative after the U.S. Energy Information Administration (EIA) storage print failed to inspire.   Expand    At A Glance:  Futures slideWeather weighsCash mostly tumbles      Related Tags    NYMEX   SoCal Citygate   natural gas prices   Natural gas futures   lng demand            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record.   Expand    At A Glance:  Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure      Related Tags    Hurricance   NYMEX   matterhorn express pipeline   natural gas prices   Natural gas futures   California   Plaquemines LNG            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibWh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvanVseS1iaWR3ZWVrLW5hdHVyYWwtZ2FzLXByaWNlcy1yYWxseS1hcy1zdW1tZXItZGVtYW5kLWV4cGVjdGF0aW9ucy1lc2NhbGF0ZS_SAQA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:44:00 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "    July Bidweek Natural Gas Prices Rally as Summer Demand Expectations Escalate                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Natural gas prices advanced in July bidweek trading as forecasts called for strong early summer heat to further intensify and cover more of the Lower 48 in the month ahead, offsetting rising production volumes and stout supplies in storage.   Expand   NGI's July Bidweek National Avg. climbed 40.0 cents month/month to $2.215/MMBtu. That was down from $2.560 a year earlier. Trading for the latest bidweek period spanned June 24-26. Weather conditions proved mostly hot across the southern two-thirds of the Lower 48 in that span. National Weather Service (NWS) forecasts call for more of the same through the first half of July, with the heat spreading further to the northern third of the country. NWS outlooks also repeatedly have predicted above-average national temperatures for the summer overall.      Related Tags    natural gas production   weather            Kevin Dobbs     Kevin Dobbs joined the staff of NGI in April 2020. Prior to that, he worked as a financial reporter and editor for S&P Global Market Intelligence, covering financial companies and markets. Earlier in his career, he served as an enterprise reporter for the Des Moines Register. He has a bachelor's degree in English from South Dakota State University.      X  KNatgas   Email  kevin.dobbs@naturalgasintel.com                    June Natural Gas Bidweek Prices Climb on Shrinking Storage Surplus, Forecast for Hot Summer     Bidweek Survey Natural Gas Prices     June 03, 2024   Natural gas prices gained upside momentum in June bidweek trading as rising temperatures ignited cooling demand, pipeline maintenance eased and modest storage injections clashed with hints of increasing production.        May Bidweek Natural Gas Prices Slide as Storage Containment Worries Outmuscle Incoming Heat     Bidweek Survey Natural Gas Prices     May 01, 2024   Natural gas prices slipped lower in May bidweek trading as the month's expected uptick in cooling demand was upstaged by hefty inventory levels and recent bumpy performances by Gulf Coast LNG terminals.        April Natural Gas Bidweek Prices Trip Lower as Spring Season Deflates Demand     Bidweek Survey Natural Gas Prices     April 01, 2024   Natural gas prices were modestly lower in April bidweek trading as the transition from winter to spring signaled milder weather, weakening demand and an end-of-season natural gas supply swelling to the brim.        March Bidweek Natural Gas Prices Drop as Weak Weather Overshadows Production Cuts     Bidweek Survey Natural Gas Prices     March 01, 2024   Natural gas prices retreated in March bidweek trading as signs of declining production were eclipsed by paltry weather-driven demand and lofty levels of supply in storage.        March Bidweek Trading Starts on Downslope as Weather Seen Driving Wider Storage Surplus     Bidweek Survey Natural Gas Prices     February 26, 2024   Hamstrung by a growing surplus of natural gas in inventories and with a spring-like February running into a mild March, traders tugged natural gas prices lower for March baseload delivery, according to  NGI's Bidweek Alert  (BWA).        February Natural Gas Bidweek Prices Mixed Amid Demand Downshift, Production Hits     Bidweek Survey Natural Gas Prices     February 01, 2024   Strengthening but still lower production intersected with spring-like weather during February bidweek trading. Natural gas prices varied by region as a result, with swaths of the country impacted by lower supply and posting gains, and others reporting declines amid waning heating demand.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures gain on spot demand - Press Trust of India",
    "Link": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnB0aW5ld3MuY29tL3N0b3J5L2J1c2luZXNzL2NydWRlLW9pbC1mdXR1cmVzLWdhaW4tb24tc3BvdC1kZW1hbmQvMTYyODkxMtIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 09:35:47 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "   Press Trust Of India  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures gain on spot demand - Press Trust of India",
    "Link": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnB0aW5ld3MuY29tL3N0b3J5L2J1c2luZXNzL2NydWRlLW9pbC1mdXR1cmVzLWdhaW4tb24tc3BvdC1kZW1hbmQvMTYyMzAzMtIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:20:18 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "   Press Trust Of India  ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibmh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1zZWVzYXctYWZ0ZXItdW5pbnNwaXJpbmctZWlhLXByaW50LXNpZ25zLW9mLWVhc2luZy1kZW1hbmQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 22:00:03 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            August Nymex natural gas futures attempted to break a six-day losing streak, but ultimately settled slightly in the negative after the U.S. Energy Information Administration (EIA) storage print failed to inspire.   Expand    At A Glance:  Futures slideWeather weighsCash mostly tumbles      Related Tags    NYMEX   SoCal Citygate   natural gas prices   Natural gas futures   lng demand            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "    Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises                                       Daily Prices  Updated Jul 15, 2024 7/15/24      Left Arrow  Scroll Left   Right Arrow  Scroll Right                  Natural Gas Data       Bidweek Data Suite       Bidweek Prices       Bidweek Datafeed       Bidweek Historical Data         Daily Data Suite       Daily Prices       Daily Datafeed       Daily Historical Data       LNG Data         Forward Look Data Suite       Forward Fixed Prices       Forward Basis Prices       Forward Datafeed       Historical Fixed Prices       Historical Basis Prices         Mexico Data Suite       Mexico Prices       Bidweek Datafeed       Daily Datafeed       Forward Datafeed         MidDay Alert Data Suite       MidDay Prices       MidDay Datafeed       MidDay Historical Data         Weekly Data Suite       Weekly Prices       Weekly Datafeed       Weekly Historical Data           News & Insights       Bidweek Survey       Daily Gas Price Index       Forward Look       Mexico Gas Price Index       NGI All News Access       NGI Weekly Newsletter       Shale Daily       Weekly Gas Price Index         Resources       North American Pipeline Map       Mexico Pipeline Map       NGI Data Services API Docs       Sync NGI Data to Excel       Natural Gas Converter       Daily Price Snapshots       Natural Gas Glossary       Natural Gas Industry FAQs       NGI's Hub & Flow Podcast       Methodology       Delivery Platform Partners         Support       Services Help       FAQ's       Account Help       API Docs         All Services       Bidweek Product Suite       News       Datafeed       Historical Data       Bidweek Alert         Daily Product Suite       News       Datafeed       Daily Historical       LNG Data Suite         Forward Look Product Suite       News       Datafeed       Historical Data         Mexico Product Suite       News       Datafeeds       Historical Data         MidDay Product Suite       News       Datafeed       Historical Data         NGI All News Access       Shale Product Suite       News       Datafeed       Historical Data         Weekly Product Suite       News       Datafeed       Historical Data              Sign In                         Share:   LinkedIn  Share this to LinkedIn   Facebook  Share this to Facebook   X  Share this to Twitter            Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record.   Expand    At A Glance:  Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure      Related Tags    Hurricance   NYMEX   matterhorn express pipeline   natural gas prices   Natural gas futures   California   Plaquemines LNG            Jodi Shafto     Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University.      X  JodiNGI   Email  jodi.shafto@naturalgasintel.com                    Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session     Daily Gas Price Index Natural Gas Prices     July 12, 2024   August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost.         Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand     Daily Gas Price Index Natural Gas Prices     July 12, 2024   Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground.        Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart     Daily Gas Price Index LNG Natural Gas Prices     July 12, 2024   Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl.        Natural Gas Futures' Losses Extended After Upside Storage Build Surprise     Daily Gas Price Index Natural Gas Prices     July 11, 2024   August Nymex natural gas futures deepened losses Thursday despite excessive heat across much of the country. The market appeared to defy the outlook for heavy gas demand in favor of robust supplies.        Natural Gas Futures Sustain Losses as EIA Reports Sizable Storage Build     Daily Gas Price Index Natural Gas Prices Natural Gas Storage     July 11, 2024   August natural gas futures held to the downside Thursday following the U.S. Energy Information Administration (EIA) storage report for the week ending July 5, which outlined a 65 Bcf build, in line with the high end of expectations and above historical averages.        Oilsands, Power Sector Seen Driving Alberta Natural Gas Demand Surge     Daily Gas Price Index Canada Natural Gas Prices     July 11, 2024   Energy-intensive bitumen production in the Alberta oilsands, along with rising natural gas-fired power generation, are expected to drive substantial growth in the province's gas demand over the next nine years, according to the government.                Email   Unlock Now   By submitting my information, I agree to the  Privacy Policy ,  Terms of Service , and to receive offers and promotions from NGI.  Sign in         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360",
    "Link": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnR2MzYwbmlnZXJpYS5jb20vb3BlYy1nbG9iYWwtY3J1ZGUtb2lsLWRlbWFuZC13aWxsLXJpc2UtdG8tMTE2bS1icGQtaW4tMjA0NS_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:19:54 GMT",
    "Categories": [
      "Supply and Demand"
    ],
    "Content": "               OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360 Nigeria                                                                                   The Organisation of the Petroleum Exporting Countries (OPEC) says world demand for oil is projected to rise to an estimated 116 million barrels per day (bpd) in 2045. Haitham Al Ghais, OPEC secretary-general, spoke on Tuesday in Abuja at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition. The conference is themed 'Showcasing Opportunities, Driving Investment, Meeting Energy Demand'. Addressing the conference via teleconference, Al Ghais said the world economy is expected to double in size - growing from $138 trillion in 2023 to $270 trillion in 2045. He explained that the oil cartel forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook,\" he said. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. Al Ghais said in the upcoming years, the industry will need to significantly increase investment levels in order to keep up with the rapid and robust growth in energy consumption. He said according to its research, the total oil-related investment requirements between 2024 and 2045 would be $14 trillion or about $610 billion on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility,\" Al Ghais said. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons.\" Al Ghais pledged that OPEC and its member countries would keep pushing to advocate for a fair process for adaptation, mitigation and means of implementation with regard to climate finance and technology. The secretary-general said an estimated 675 million people lack access to basic forms of energy and 2.3 billion without access to clean cooking fuels. Al Ghais, while commending President Bola Tinubu, appreciated Nigeria's unwavering commitment to OPEC and the declaration of cooperation (DoC).  Share this:          Opeyemi Owoseni2 weeks ago 0 12  1 minute read              Share    Facebook   X   LinkedIn   Tumblr   Pinterest   Reddit   VKontakte   Skype   Messenger   Messenger   Share via Email   Print             Opeyemi Owoseni           Related Articles         Marketers want N720 per litre to suspened petroleum importation.   August 14, 2023       President Tinubu Hails Obazee as Special Investigator Concludes Probe of CBN   April 5, 2024       FG, W'Bank begin talks on 90,000km fibre-optic cable project   June 13, 2024       Global trade to grow by 2.3% in 2024 - W'Bank   January 11, 2024               Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name *  Email *  Website     Save my name, email, and website in this browser for the next time I comment.                 Check Also   Close        Business     FG to Integrate Over 20% Unbanked Nigerians into Banking System - Shettima   April 25, 2024                Facebook   X   WhatsApp   Telegram               Close        Search for         ",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]