[
  {
    "Title": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1kcmlmdC1sb3dlci1hZnRlci1saWdodC1laWEtc3RvcmFnZS1wcmludC1jYXNoLXdlYWtlci1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:42:55 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week. Expand Here's the latest: August Nymex natural gas futures down 2.2 cents to $2.413/MMBtu as of 2:24 p.m. ET U.S. Energy Information Administration (EIA) reports a seasonally light build of 32 Bcf for the week ending June 28 Related Tags natural gas prices Natural gas futures lng demand Sabine Pass LNG Hurricane Corpus Christi LNG Midday natural gas storage Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibmh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1zZWVzYXctYWZ0ZXItdW5pbnNwaXJpbmctZWlhLXByaW50LXNpZ25zLW9mLWVhc2luZy1kZW1hbmQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 22:00:03 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August Nymex natural gas futures attempted to break a six-day losing streak, but ultimately settled slightly in the negative after the U.S. Energy Information Administration (EIA) storage print failed to inspire. Expand At A Glance: Futures slideWeather weighsCash mostly tumbles Related Tags NYMEX SoCal Citygate natural gas prices Natural gas futures lng demand Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiZ2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvYXVndXN0LW5hdHVyYWwtZ2FzLWZ1dHVyZXMtc2xpZ2h0bHktaGlnaGVyLW9uLW1vZGVzdC1laWEtc3RvcmFnZS1wcmludC_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:52:41 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter The U.S. Energy Information Administration (EIA) on Wednesday reported a 32 Bcf build of natural gas in storage for the week ended June 28. The result was within the expected range, and included a bearish revision for the prior week, limiting support for Nymex futures. Expand Ahead of the 12 p.m. ET print, the August futures contract was up 2.0 cents at $2.455/MMBtu. The prompt month ticked lower to $2.452 when the EIA data was released, a day early because of the Fourth of July holiday. About 20 minutes later, the contract stood at $2.456, up 2.1 cents from Tuesday's settlement. Prior to the report, NGI modeled a 29 Bcf build. Early estimates to Reuters ranged from builds of 13 Bcf to 76 Bcf, with an average increase of 41 Bcf. The five-year average build was 69 Bcf for the week, while a year ago it was 76 Bcf. Related Tags NYMEX natural gas prices natural gas production EIA Storage Report natural gas storage Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record. Expand At A Glance: Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure Related Tags Hurricance NYMEX matterhorn express pipeline natural gas prices Natural gas futures California Plaquemines LNG Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiamh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1jcmFzaC1iZWxvdy10ZWNobmljYWwtc3VwcG9ydC1pbnRvLW92ZXJzb2xkLXRlcnJpdG9yeS_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 13:50:39 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Crash Below Technical Support into Oversold Territory Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures have tumbled below technical support levels this week, setting the market up for a potential bounce. Expand The August New York Mercantile Exchange (Nymex) contract settled at $2.478/MMBtu Monday, down 12.3 cents from the day before and off 21% from a six-month high of $3.129 on June 11. In early trading Tuesday, August futures added to their losses, down 3.6 cents to $2.442. \"The inability to hold key support at $2.50, while not necessarily indicative of severe immediate-term downside, is a glaring indicator of the lack of bullish market appetite,\" EBW Analytics Group analyst Eli Rubin said. Related Tags NYMEX natural gas prices Natural gas futures natural gas trading Cftc Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiiwFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL3NlbGxpbmctY29udGludWVzLWZvci1uYXR1cmFsLWdhcy1mdXR1cmVzLWNhbGlmb3JuaWEtY2FzaC1kb3duLXNoYXJwbHktZGVzcGl0ZS1oZWF0LW1pZGRheS1tYXJrZXQtc25hcHNob3Qv0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 18:55:40 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track to decline for a sixth straight session through midday trading Tuesday, undercut by cooler weather forecasts and weaker cash prices. Expand Here's the latest: August Nymex natural gas futures down 3.9 cents to $2.439/MMBtu as of 2:22 p.m. ET Back of the curve higher after a federal court in Louisiana ordered the U.S. Department of Energy (DOE) to lift LNG permit pause Related Tags NYMEX natural gas prices PG&E citygate Natural gas futures SoCal Border Avg. Biden LNG Pause Sabine Pass LNG Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high. Expand Here's the latest: August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48 The August contract started to trade below $2.500/MMBtu before 11 a.m. ET before bouncing on either side of the closely watched level into midday. \"Critical support sits at $2.50,\" EBW Analytics Group analyst Eli Rubin said. Forecasting from DTN shed 6.5 cooling degree days (CDD) from its Lower 48 forecasts over the next three weeks since Friday, equating to 10.4 Bcf lower demand, Rubin said. Maxar's Weather Desk also pointed to cooler temperatures. However, NatGasWeather painted a more mixed picture with weekend updates both shedding and adding modest amounts of CDD in the American and European weather models. Both forecasts continued to point to the hottest first half of July of the past 50 years, however, both models have tended to overestimate summer's heat \"and the expectation is they are doing so again this summer,\" NatGasWeather said. Wood Mackenzie estimated Lower 48 gas production fell to 100.0 Bcf/d on Monday, but analysts expected that number to be revised higher in later cycles because of volatility at the start of the month. Freeport LNG terminal's Train 2 was down about 15 hours from Saturday to Sunday, but flows have bounced back on Monday Cheniere Energy Inc.'s Sabine Pass liquefied natural gas export facility may have completed a round of maintenance U.S. LNG feed gas demand climbed to about 12.9 Bcf/d for Monday, highest since last Sunday, according to NGI's U.S. LNG Export Tracker Freeport staff told Texas officials that the facility's Train 2 tripped because of compressor issues. Feed gas flows fell to about 1.6 Bcf/d Saturday and 1.3 Bcf/d Sunday, NGI data show. On Monday, service regained its earlier June pace with nominations at around 1.9 Bcf/d. Kpler has a ship in berth loading and more scheduled through the week. Meanwhile, an uptick in feed gas flows to Sabine Pass over the weekend hints at the terminal wrapping up its traditional June maintenance. Flows to Sabine Pass over the weekend topped out above 4.3 Bcf on Sunday and were scheduled to be around 4.2 Bcf on Monday, NGI data show. \"The terminal could likely run a bit higher, with optimal summer flows near 4.4 Bcf/d,\" Criterion Research Inc.'s James Bevan, vice president of Research, said on online energy platform Enelyst. Elsewhere, flows to Cheniere's Corpus Christi and Sempra Infrastructure's Cameron LNG terminals were stable at about 2.3 Bcf/d and 1.9 Bcf/d, respectively, NGI data show. NGI modeling 29 Bcf injection into Lower 48 storage for week ending June 28 A print in-line with NGI's estimate for this week's U.S. Energy Information Administration (EIA) report would further eat into the Lower 48's lofty storage surplus. Last week's report showed working gas in underground storage stood at 528 Bcf, or a nearly 21% surplus to the five-year average. All but eight of the last 10 weekly injections have lagged the five-year average, narrowing the surplus from 37% in mid-April. For the week ending June 28, the five-year average is an injection of 69 Bcf, while the year-earlier period saw an 76 Bcf increase. Henry Hub spot prices lower at $2.205, down 18.5 cents, NGI's MidDay Price Alert data show Southeast weaker on cooler forecasts, West Texas prices stay negative Waha rose 8.5 cents to negative $2.035 on Monday, according to NGI's MidDay Price Alert. Transco Zone 5 in the Southeast shed 25.5 cents to average $2.560, as forecasts for the region turned cooler. Weather model runs on Monday pulled Southeast forecasts for the next 10 days below normal while the 11- to 15-day outlook is only now marginally above normal, Bevan said. The cooler look resulted in a demand loss of around 9 Bcf for the region, stacking onto losses from Thursday and Friday, Bevan said. Also likely impacting prices in the Southeast is supply from the Mountain Valley Pipeline LLC (MVP), which officially began firm transport service on Monday. The new pipeline is scheduled to deliver its highest volume yet to the Transcontinental Gas Pipe Line Co. (aka Transco) on Monday at around 0.97 Bcf/d, or nearly half its capacity, according to Wood Mackenzie flow data. Transco's Station 160 in North Carolina, which is south of the mainline's interconnect with MVP, showed southbound flows into the Southeast rose above 2 Bcf/d Monday, setting a new high for 2024, Bevan said. Related Tags natural gas prices Mountain Valley Pipeline Natural gas futures Mvp Sabine Pass Midday Transco Zone 5 Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude Oil Futures Overview - CME Group",
    "Link": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9tYXJrZXRzL2VuZXJneS9jcnVkZS1vaWwvbGlnaHQtc3dlZXQtY3J1ZGUuaHRtbNIBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:28:45 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.cmegroup.com/markets/energy/crude-oil/light-sweet-crude.html",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures settle at $82.81 - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vbmV3cy9jcnVkZS1vaWwtZnV0dXJlcy1zZXR0bGUtYXQtODI4MS0yMDI0MDcwMi_SAU1odHRwczovL3d3dy5mb3JleGxpdmUuY29tL25ld3MvY3J1ZGUtb2lsLWZ1dHVyZXMtc2V0dGxlLWF0LTgyODEtMjAyNDA3MDIvYW1wLw?oc=5",
    "Published": "Tue, 02 Jul 2024 19:09:00 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.forexlive.com/news/crude-oil-futures-settle-at-8281-20240702/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures and settle at $83.38 - ForexLive",
    "Link": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvcmV4bGl2ZS5jb20vdGVjaG5pY2FsLWFuYWx5c2lzL2NydWRlLW9pbC1mdXR1cmVzLWFuZC1zZXR0bGUtYXQtODMzOC0yMDI0MDcwMS_SAV9odHRwczovL3d3dy5mb3JleGxpdmUuY29tL3RlY2huaWNhbC1hbmFseXNpcy9jcnVkZS1vaWwtZnV0dXJlcy1hbmQtc2V0dGxlLWF0LTgzMzgtMjAyNDA3MDEvYW1wLw?oc=5",
    "Published": "Mon, 01 Jul 2024 18:45:00 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.forexlive.com/technical-analysis/crude-oil-futures-and-settle-at-8338-20240701/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures gain on spot demand - Press Trust of India",
    "Link": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnB0aW5ld3MuY29tL3N0b3J5L2J1c2luZXNzL2NydWRlLW9pbC1mdXR1cmVzLWdhaW4tb24tc3BvdC1kZW1hbmQvMTYyODkxMtIBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 09:35:47 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Press Trust Of India",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude oil futures gain on spot demand - Press Trust of India",
    "Link": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnB0aW5ld3MuY29tL3N0b3J5L2J1c2luZXNzL2NydWRlLW9pbC1mdXR1cmVzLWdhaW4tb24tc3BvdC1kZW1hbmQvMTYyMzAzMtIBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 11:20:18 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Press Trust Of India",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiamh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1jcmFzaC1iZWxvdy10ZWNobmljYWwtc3VwcG9ydC1pbnRvLW92ZXJzb2xkLXRlcnJpdG9yeS_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 13:50:39 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Crash Below Technical Support into Oversold Territory Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures have tumbled below technical support levels this week, setting the market up for a potential bounce. Expand The August New York Mercantile Exchange (Nymex) contract settled at $2.478/MMBtu Monday, down 12.3 cents from the day before and off 21% from a six-month high of $3.129 on June 11. In early trading Tuesday, August futures added to their losses, down 3.6 cents to $2.442. \"The inability to hold key support at $2.50, while not necessarily indicative of severe immediate-term downside, is a glaring indicator of the lack of bullish market appetite,\" EBW Analytics Group analyst Eli Rubin said. Related Tags NYMEX natural gas prices Natural gas futures natural gas trading Cftc Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiiwFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL3NlbGxpbmctY29udGludWVzLWZvci1uYXR1cmFsLWdhcy1mdXR1cmVzLWNhbGlmb3JuaWEtY2FzaC1kb3duLXNoYXJwbHktZGVzcGl0ZS1oZWF0LW1pZGRheS1tYXJrZXQtc25hcHNob3Qv0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 18:55:40 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track to decline for a sixth straight session through midday trading Tuesday, undercut by cooler weather forecasts and weaker cash prices. Expand Here's the latest: August Nymex natural gas futures down 3.9 cents to $2.439/MMBtu as of 2:22 p.m. ET Back of the curve higher after a federal court in Louisiana ordered the U.S. Department of Energy (DOE) to lift LNG permit pause Related Tags NYMEX natural gas prices PG&E citygate Natural gas futures SoCal Border Avg. Biden LNG Pause Sabine Pass LNG Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high. Expand Here's the latest: August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48 The August contract started to trade below $2.500/MMBtu before 11 a.m. ET before bouncing on either side of the closely watched level into midday. \"Critical support sits at $2.50,\" EBW Analytics Group analyst Eli Rubin said. Forecasting from DTN shed 6.5 cooling degree days (CDD) from its Lower 48 forecasts over the next three weeks since Friday, equating to 10.4 Bcf lower demand, Rubin said. Maxar's Weather Desk also pointed to cooler temperatures. However, NatGasWeather painted a more mixed picture with weekend updates both shedding and adding modest amounts of CDD in the American and European weather models. Both forecasts continued to point to the hottest first half of July of the past 50 years, however, both models have tended to overestimate summer's heat \"and the expectation is they are doing so again this summer,\" NatGasWeather said. Wood Mackenzie estimated Lower 48 gas production fell to 100.0 Bcf/d on Monday, but analysts expected that number to be revised higher in later cycles because of volatility at the start of the month. Freeport LNG terminal's Train 2 was down about 15 hours from Saturday to Sunday, but flows have bounced back on Monday Cheniere Energy Inc.'s Sabine Pass liquefied natural gas export facility may have completed a round of maintenance U.S. LNG feed gas demand climbed to about 12.9 Bcf/d for Monday, highest since last Sunday, according to NGI's U.S. LNG Export Tracker Freeport staff told Texas officials that the facility's Train 2 tripped because of compressor issues. Feed gas flows fell to about 1.6 Bcf/d Saturday and 1.3 Bcf/d Sunday, NGI data show. On Monday, service regained its earlier June pace with nominations at around 1.9 Bcf/d. Kpler has a ship in berth loading and more scheduled through the week. Meanwhile, an uptick in feed gas flows to Sabine Pass over the weekend hints at the terminal wrapping up its traditional June maintenance. Flows to Sabine Pass over the weekend topped out above 4.3 Bcf on Sunday and were scheduled to be around 4.2 Bcf on Monday, NGI data show. \"The terminal could likely run a bit higher, with optimal summer flows near 4.4 Bcf/d,\" Criterion Research Inc.'s James Bevan, vice president of Research, said on online energy platform Enelyst. Elsewhere, flows to Cheniere's Corpus Christi and Sempra Infrastructure's Cameron LNG terminals were stable at about 2.3 Bcf/d and 1.9 Bcf/d, respectively, NGI data show. NGI modeling 29 Bcf injection into Lower 48 storage for week ending June 28 A print in-line with NGI's estimate for this week's U.S. Energy Information Administration (EIA) report would further eat into the Lower 48's lofty storage surplus. Last week's report showed working gas in underground storage stood at 528 Bcf, or a nearly 21% surplus to the five-year average. All but eight of the last 10 weekly injections have lagged the five-year average, narrowing the surplus from 37% in mid-April. For the week ending June 28, the five-year average is an injection of 69 Bcf, while the year-earlier period saw an 76 Bcf increase. Henry Hub spot prices lower at $2.205, down 18.5 cents, NGI's MidDay Price Alert data show Southeast weaker on cooler forecasts, West Texas prices stay negative Waha rose 8.5 cents to negative $2.035 on Monday, according to NGI's MidDay Price Alert. Transco Zone 5 in the Southeast shed 25.5 cents to average $2.560, as forecasts for the region turned cooler. Weather model runs on Monday pulled Southeast forecasts for the next 10 days below normal while the 11- to 15-day outlook is only now marginally above normal, Bevan said. The cooler look resulted in a demand loss of around 9 Bcf for the region, stacking onto losses from Thursday and Friday, Bevan said. Also likely impacting prices in the Southeast is supply from the Mountain Valley Pipeline LLC (MVP), which officially began firm transport service on Monday. The new pipeline is scheduled to deliver its highest volume yet to the Transcontinental Gas Pipe Line Co. (aka Transco) on Monday at around 0.97 Bcf/d, or nearly half its capacity, according to Wood Mackenzie flow data. Transco's Station 160 in North Carolina, which is south of the mainline's interconnect with MVP, showed southbound flows into the Southeast rose above 2 Bcf/d Monday, setting a new high for 2024, Bevan said. Related Tags natural gas prices Mountain Valley Pipeline Natural gas futures Mvp Sabine Pass Midday Transco Zone 5 Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiZ2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvYXVndXN0LW5hdHVyYWwtZ2FzLWZ1dHVyZXMtc2xpZ2h0bHktaGlnaGVyLW9uLW1vZGVzdC1laWEtc3RvcmFnZS1wcmludC_SAQA?oc=5",
    "Published": "Wed, 03 Jul 2024 16:52:41 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Slightly Higher on Modest EIA Storage Print Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter The U.S. Energy Information Administration (EIA) on Wednesday reported a 32 Bcf build of natural gas in storage for the week ended June 28. The result was within the expected range, and included a bearish revision for the prior week, limiting support for Nymex futures. Expand Ahead of the 12 p.m. ET print, the August futures contract was up 2.0 cents at $2.455/MMBtu. The prompt month ticked lower to $2.452 when the EIA data was released, a day early because of the Fourth of July holiday. About 20 minutes later, the contract stood at $2.456, up 2.1 cents from Tuesday's settlement. Prior to the report, NGI modeled a 29 Bcf build. Early estimates to Reuters ranged from builds of 13 Bcf to 76 Bcf, with an average increase of 41 Bcf. The five-year average build was 69 Bcf for the week, while a year ago it was 76 Bcf. Related Tags NYMEX natural gas prices natural gas production EIA Storage Report natural gas storage Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Crude Oil Futures Overview - CME Group",
    "Link": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9tYXJrZXRzL2VuZXJneS9jcnVkZS1vaWwvbGlnaHQtc3dlZXQtY3J1ZGUuaHRtbNIBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 20:28:45 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Google NewsOpening https://www.cmegroup.com/markets/energy/crude-oil/light-sweet-crude.html",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1kcmlmdC1sb3dlci1hZnRlci1saWdodC1laWEtc3RvcmFnZS1wcmludC1jYXNoLXdlYWtlci1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:42:55 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Drift Lower After Light EIA Storage Print; Cash Weaker - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track for their seventh straight loss through midday trading Wednesday after the latest in-line weekly storage injection was accompanied by a bearish revision to the previous week. Expand Here's the latest: August Nymex natural gas futures down 2.2 cents to $2.413/MMBtu as of 2:24 p.m. ET U.S. Energy Information Administration (EIA) reports a seasonally light build of 32 Bcf for the week ending June 28 Related Tags natural gas prices Natural gas futures lng demand Sabine Pass LNG Hurricane Corpus Christi LNG Midday natural gas storage Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMibmh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1zZWVzYXctYWZ0ZXItdW5pbnNwaXJpbmctZWlhLXByaW50LXNpZ25zLW9mLWVhc2luZy1kZW1hbmQv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 22:00:03 GMT",
    "Categories": [
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Seesaw After Uninspiring EIA Print, Signs of Easing Demand Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August Nymex natural gas futures attempted to break a six-day losing streak, but ultimately settled slightly in the negative after the U.S. Energy Information Administration (EIA) storage print failed to inspire. Expand At A Glance: Futures slideWeather weighsCash mostly tumbles Related Tags NYMEX SoCal Citygate natural gas prices Natural gas futures lng demand Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Crash Below Technical Support into Oversold Territory - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiamh0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1jcmFzaC1iZWxvdy10ZWNobmljYWwtc3VwcG9ydC1pbnRvLW92ZXJzb2xkLXRlcnJpdG9yeS_SAQA?oc=5",
    "Published": "Tue, 02 Jul 2024 13:50:39 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Crash Below Technical Support into Oversold Territory Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures have tumbled below technical support levels this week, setting the market up for a potential bounce. Expand The August New York Mercantile Exchange (Nymex) contract settled at $2.478/MMBtu Monday, down 12.3 cents from the day before and off 21% from a six-month high of $3.129 on June 11. In early trading Tuesday, August futures added to their losses, down 3.6 cents to $2.442. \"The inability to hold key support at $2.50, while not necessarily indicative of severe immediate-term downside, is a glaring indicator of the lack of bullish market appetite,\" EBW Analytics Group analyst Eli Rubin said. Related Tags NYMEX natural gas prices Natural gas futures natural gas trading Cftc Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMie2h0dHA6Ly9uYXR1cmFsZ2FzaW50ZWwuY29tL25ld3MvbmF0dXJhbC1nYXMtZnV0dXJlcy1leHRlbmQtbG9zc2VzLWFzLWZvcmVjYXN0cy1zdWdnZXN0LWRlbWFuZC1yaXNrcy13aGlsZS1wcm9kdWN0aW9uLXJpc2VzL9IBAA?oc=5",
    "Published": "Tue, 02 Jul 2024 21:55:17 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices",
      "Supply and Demand"
    ],
    "Content": "Natural Gas Futures Extend Losses as Forecasts Suggest Demand Risks While Production Rises Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter Higher production and lower demand outlooks supported more losses for August Nymex natural gas futures as weather forecasts softened heat for later in July amid storm fears stoked by the formation of the earliest Category 5 hurricane on record. Expand At A Glance: Futures end down 4.3 centsProduction hits three-month highWeather, LNG worries pressure Related Tags Hurricance NYMEX matterhorn express pipeline natural gas prices Natural gas futures California Plaquemines LNG Jodi Shafto Jodi Shafto joined NGI as a Senior Natural Gas Reporter in October 2023. Before that, she was a business news reporter for South Carolina's largest daily newspaper, The Post and Courier, and was a Senior Energy Markets Reporter at S&P Global Market Intelligence. Based out of Charleston, Jodi has covered US energy markets since 2005 as a reporter, editor and analyst. A New Jersey native, she holds a BS in Journalism from Bowling Green State University. X JodiNGI Email jodi.shafto@naturalgasintel.com Natural Gas Futures Flop as Weather Demand Forecast to Wane; Spot Prices Rally Daily Gas Price Index Natural Gas Prices July 15, 2024 Natural gas futures stumbled to start the trading week amid steady production levels and expectations for lighter mid-July demand. Natural Gas, Oil Executives Forecasting $3 Henry Hub Price by Early 2025 Daily Gas Price Index E&P Natural Gas Prices July 15, 2024 Energy executives in the Rockies and Midcontinent have adopted a more bullish outlook on natural gas prices since earlier in the year, according to the Federal Reserve Bank of Kansas City. Natural Gas Futures Knocked Down Early as Freeport LNG Outage Drags On Daily Gas Price Index Natural Gas Prices July 15, 2024 With forecast models moderating expected heat for the Lower 48 later this week and production riding higher over the weekend, natural gas futures slumped in early trading Monday. Short-Covering Cited as Natural Gas Prices Climb in 'Head Scratcher' Session Daily Gas Price Index Natural Gas Prices July 12, 2024 August Nymex natural gas futures were higher Friday, abruptly ending a three-day routing to close the week with a 6.1-cent gain, as traders covered short positions and anticipated a demand boost. Natural Gas Forward Prices Falter as Stout Supply Overshadows Strong Cooling Demand Daily Gas Price Index Natural Gas Prices July 12, 2024 Against a backdrop of strong production, hefty supplies in storage and a demand-thwarting hurricane, natural gas forward prices struggled for direction and ultimately gave up ground. Natural Gas Futures Trade Even as Market Waits for Hotter Weather, Freeport LNG Restart Daily Gas Price Index LNG Natural Gas Prices July 12, 2024 Natural gas futures seesawed between gains and losses early Friday as traders weighed a coming stretch of severe heat against mounting surpluses - and the slow recovery in Texas from Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat — MidDay Market Snapshot - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMiiwFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL3NlbGxpbmctY29udGludWVzLWZvci1uYXR1cmFsLWdhcy1mdXR1cmVzLWNhbGlmb3JuaWEtY2FzaC1kb3duLXNoYXJwbHktZGVzcGl0ZS1oZWF0LW1pZGRheS1tYXJrZXQtc25hcHNob3Qv0gEA?oc=5",
    "Published": "Tue, 02 Jul 2024 18:55:40 GMT",
    "Categories": [
      "Market Trends",
      "Stock Prices"
    ],
    "Content": "Selling Continues for Natural Gas Futures; California Cash Down Sharply Despite Heat - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures were on track to decline for a sixth straight session through midday trading Tuesday, undercut by cooler weather forecasts and weaker cash prices. Expand Here's the latest: August Nymex natural gas futures down 3.9 cents to $2.439/MMBtu as of 2:22 p.m. ET Back of the curve higher after a federal court in Louisiana ordered the U.S. Department of Energy (DOE) to lift LNG permit pause Related Tags NYMEX natural gas prices PG&E citygate Natural gas futures SoCal Border Avg. Biden LNG Pause Sabine Pass LNG Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl. Email Unlock Now By submitting my information, I agree to the Privacy Policy , Terms of Service , and to receive offers and promotions from NGI. Sign in",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts — MidDay ... - Natural Gas Intelligence",
    "Link": "https://news.google.com/rss/articles/CBMilQFodHRwOi8vbmF0dXJhbGdhc2ludGVsLmNvbS9uZXdzL2F1Z3VzdC1uYXR1cmFsLWdhcy1mdXR1cmVzLWRyYWdnZWQtYmVsb3ctMjUwMC1hbWlkLWhpZ2hlci1wcm9kdWN0aW9uLW1pbGRlci13ZWF0aGVyLWZvcmVjYXN0cy1taWRkYXktbWFya2V0LXNuYXBzaG90L9IBAA?oc=5",
    "Published": "Mon, 01 Jul 2024 19:04:45 GMT",
    "Categories": [
      "Market Trends",
      "Production Updates",
      "Stock Prices"
    ],
    "Content": "August Natural Gas Futures Dragged Below $2.500 Amid Higher Production, Milder Weather Forecasts - MidDay Market Snapshot Daily Prices Updated Jul 16, 2024 7/16/24 Left Arrow Scroll Left Right Arrow Scroll Right Natural Gas Data Bidweek Data Suite Bidweek Prices Bidweek Datafeed Bidweek Historical Data Daily Data Suite Daily Prices Daily Datafeed Daily Historical Data LNG Data Forward Look Data Suite Forward Fixed Prices Forward Basis Prices Forward Datafeed Historical Fixed Prices Historical Basis Prices Mexico Data Suite Mexico Prices Bidweek Datafeed Daily Datafeed Forward Datafeed MidDay Alert Data Suite MidDay Prices MidDay Datafeed MidDay Historical Data Weekly Data Suite Weekly Prices Weekly Datafeed Weekly Historical Data News & Insights Bidweek Survey Daily Gas Price Index Forward Look Mexico Gas Price Index NGI All News Access NGI Weekly Newsletter Shale Daily Weekly Gas Price Index Resources North American Pipeline Map Mexico Pipeline Map NGI Data Services API Docs Sync NGI Data to Excel Natural Gas Converter Daily Price Snapshots Natural Gas Glossary Natural Gas Industry FAQs NGI's Hub & Flow Podcast Methodology Delivery Platform Partners Support Services Help FAQ's Account Help API Docs All Services Bidweek Product Suite News Datafeed Historical Data Bidweek Alert Daily Product Suite News Datafeed Daily Historical LNG Data Suite Forward Look Product Suite News Datafeed Historical Data Mexico Product Suite News Datafeeds Historical Data MidDay Product Suite News Datafeed Historical Data NGI All News Access Shale Product Suite News Datafeed Historical Data Weekly Product Suite News Datafeed Historical Data Sign In Share: LinkedIn Share this to LinkedIn Facebook Share this to Facebook X Share this to Twitter August natural gas futures fell below key support through midday trading Monday as weather forecasts trimmed demand outlooks and Lower 48 gas output rose to a new three-month high. Expand Here's the latest: August Nymex natural gas futures down 12.3 cents to $2.478/MMBtu as of 2:40 p.m. ET Lower 48 gas production rose to 102 Bcf/d on Sunday, the highest level since March 11, Wood Mackenzie data show Category 4 Hurricane Beryl is tracking to cross Mexico's Yucatan Peninsula on Friday, potentially avoiding a direct strike on the Lower 48 The August contract started to trade below $2.500/MMBtu before 11 a.m. ET before bouncing on either side of the closely watched level into midday. \"Critical support sits at $2.50,\" EBW Analytics Group analyst Eli Rubin said. Forecasting from DTN shed 6.5 cooling degree days (CDD) from its Lower 48 forecasts over the next three weeks since Friday, equating to 10.4 Bcf lower demand, Rubin said. Maxar's Weather Desk also pointed to cooler temperatures. However, NatGasWeather painted a more mixed picture with weekend updates both shedding and adding modest amounts of CDD in the American and European weather models. Both forecasts continued to point to the hottest first half of July of the past 50 years, however, both models have tended to overestimate summer's heat \"and the expectation is they are doing so again this summer,\" NatGasWeather said. Wood Mackenzie estimated Lower 48 gas production fell to 100.0 Bcf/d on Monday, but analysts expected that number to be revised higher in later cycles because of volatility at the start of the month. Freeport LNG terminal's Train 2 was down about 15 hours from Saturday to Sunday, but flows have bounced back on Monday Cheniere Energy Inc.'s Sabine Pass liquefied natural gas export facility may have completed a round of maintenance U.S. LNG feed gas demand climbed to about 12.9 Bcf/d for Monday, highest since last Sunday, according to NGI's U.S. LNG Export Tracker Freeport staff told Texas officials that the facility's Train 2 tripped because of compressor issues. Feed gas flows fell to about 1.6 Bcf/d Saturday and 1.3 Bcf/d Sunday, NGI data show. On Monday, service regained its earlier June pace with nominations at around 1.9 Bcf/d. Kpler has a ship in berth loading and more scheduled through the week. Meanwhile, an uptick in feed gas flows to Sabine Pass over the weekend hints at the terminal wrapping up its traditional June maintenance. Flows to Sabine Pass over the weekend topped out above 4.3 Bcf on Sunday and were scheduled to be around 4.2 Bcf on Monday, NGI data show. \"The terminal could likely run a bit higher, with optimal summer flows near 4.4 Bcf/d,\" Criterion Research Inc.'s James Bevan, vice president of Research, said on online energy platform Enelyst. Elsewhere, flows to Cheniere's Corpus Christi and Sempra Infrastructure's Cameron LNG terminals were stable at about 2.3 Bcf/d and 1.9 Bcf/d, respectively, NGI data show. NGI modeling 29 Bcf injection into Lower 48 storage for week ending June 28 A print in-line with NGI's estimate for this week's U.S. Energy Information Administration (EIA) report would further eat into the Lower 48's lofty storage surplus. Last week's report showed working gas in underground storage stood at 528 Bcf, or a nearly 21% surplus to the five-year average. All but eight of the last 10 weekly injections have lagged the five-year average, narrowing the surplus from 37% in mid-April. For the week ending June 28, the five-year average is an injection of 69 Bcf, while the year-earlier period saw an 76 Bcf increase. Henry Hub spot prices lower at $2.205, down 18.5 cents, NGI's MidDay Price Alert data show Southeast weaker on cooler forecasts, West Texas prices stay negative Waha rose 8.5 cents to negative $2.035 on Monday, according to NGI's MidDay Price Alert. Transco Zone 5 in the Southeast shed 25.5 cents to average $2.560, as forecasts for the region turned cooler. Weather model runs on Monday pulled Southeast forecasts for the next 10 days below normal while the 11- to 15-day outlook is only now marginally above normal, Bevan said. The cooler look resulted in a demand loss of around 9 Bcf for the region, stacking onto losses from Thursday and Friday, Bevan said. Also likely impacting prices in the Southeast is supply from the Mountain Valley Pipeline LLC (MVP), which officially began firm transport service on Monday. The new pipeline is scheduled to deliver its highest volume yet to the Transcontinental Gas Pipe Line Co. (aka Transco) on Monday at around 0.97 Bcf/d, or nearly half its capacity, according to Wood Mackenzie flow data. Transco's Station 160 in North Carolina, which is south of the mainline's interconnect with MVP, showed southbound flows into the Southeast rose above 2 Bcf/d Monday, setting a new high for 2024, Bevan said. Related Tags natural gas prices Mountain Valley Pipeline Natural gas futures Mvp Sabine Pass Midday Transco Zone 5 Freeport Lng Chris Newman Chris Newman joined NGI in October 2023. He worked 18 years at Argus Media, starting in 2004 in Washington, D.C., where he covered U.S. thermal/coking coal markets and rail transportation. In 2014, he moved to Singapore to help lead Argus' coverage of steel and its raw material feedstocks. A graduate of the University of Virginia, Chris returned to his native Virginia in 2021. X Natgasnewman Email chris.newman@naturalgasintel.com Natural Gas Futures Drop as Freeport LNG Confirms Slow Restart This Week - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 15, 2024 Natural gas futures were trading lower through midday trading Monday after Freeport LNG Development LP said it planned to restart this week and operate at a reduced rate while it repaired damage from former Hurricane Beryl. Market Looks Past 'Hurricane From Hell' to Push Natural Gas Futures Higher - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 12, 2024 Prompt-month natural gas futures were on track to end a three-day losing streak through midday trading Friday, pushed higher by short sellers taking chips off the table ahead of the weekend. Natural Gas Futures Sink Lower After Seasonally Heavy EIA Print - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 11, 2024 August natural gas futures were trading lower through midday Thursday after the latest weekly storage injection landed above historical levels. Natural Gas Futures Lower Amid Slow Beryl Recovery, Stout Supply - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 10, 2024 Natural gas futures were narrowing losses through midday trading Wednesday, while cash prices in the West were positive for a third day amid extreme heat across the region. Natural Gas Futures Shed Early Gains as Western Heat Buoys Cash Prices - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 09, 2024 Natural gas futures flipped negative through midday trading Tuesday after weather forecasts shaved off some of the Lower 48's blistering heat expected over the next two weeks. Natural Gas Futures Higher After No Knockout Blow from Beryl; Waha Cash Surges - MidDay Market Snapshot MidDay Price Alert Natural Gas Prices July 08, 2024 Natural gas futures were trading higher in midday trading Monday as early indications showed the Gulf Coast avoided prolonged LNG terminal outages with the weakened Beryl.",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions - Via News Agency",
    "Link": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vdmlhLm5ld3MvbWFya2V0L25hdHVyYWwtZ2FzLWZ1dHVyZXMtYmVhcmlzaC0xOC1pbi1sYXN0LTIxLXNlc3Npb25zLTMv0gEA?oc=5",
    "Published": "Wed, 03 Jul 2024 18:57:30 GMT",
    "Categories": [
      "Stock Prices"
    ],
    "Content": "Natural Gas Futures Bearish By 18% In The Last 21 Sessions Skip to content Headlines Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 42 mins ago Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions 2 hours ago Nikkei 225 Rises By 6% In The Last 21 Sessions 5 hours ago Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio 6 hours ago Ameresco And 4 Other Stocks Have High Sales Growth And An Above 3% Return on Equity 6 hours ago MFS Intermediate High Income Fund, Flaherty & Crumrine, Another 5 Companies Have A High Estimated Dividend Yield 6 hours ago HomeMarketNatural Gas Futures Bearish By 18% In The Last 21 Sessions (VIANEWS) - Natural Gas (NG) has been up by 18.78% for the last 21 sessions. At 14:52 EST on Wednesday, 3 July, Natural Gas (NG) is $2.42. Volume Today's last reported volume for Natural Gas is 116783, 99.99% below its average volume of 3235533847.76. Volatility Natural Gas's last week, last month's, and last quarter's current intraday variation average was a negative 1.89%, a negative 0.47%, and a positive 3.46%, respectively. Natural Gas's highest amplitude of average volatility was 4.77% (last week), 5.08% (last month), and 3.46% (last quarter), respectively. Commodity Price Classification According to the stochastic oscillator, a useful indicator of overbought and oversold conditions, Natural Gas's commodity is considered to be overbought (>=80). Previous days news about Natural Gas (NG) Natural gas sinks to pivotal level as China's demand slumps. According to FXStreet on Monday, 1 July, \"The move comes on the back of China cutting its Liquified Natural Gas (LNG) imports after prices rose above $3.0 in June. \" Natural gas in distress with selloff adding another leg. According to FXStreet on Tuesday, 2 July, \"Over 15% in value has already evaporated since June 25th, and more downturns could be at hand as a US judge in Louisiana issued a ruling on Monday to lift the current ban on new export licenses for Liquified Natural Gas (LNG). \" More news about Natural Gas (NG). Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Related News Equus Total Return And 7 Other Stocks Have High Sales Growth And An Above 3% Return on Equity Via News Editorial Team42 mins ago 0 Corn Futures Bearish Momentum With A 11% Slide In The Last 21 Sessions Via News Editorial Team2 hours ago 0 Nikkei 225 Rises By 6% In The Last 21 Sessions Via News Editorial Team5 hours ago 0 Chesapeake Utilities Corporation And 4 Other Stocks Have Very High Payout Ratio Via News Editorial Team6 hours ago 0",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]