[
  {
    "Title": "ICE Gasoil Futures and Options at Record Open Interest with Record Q2 Trading Volumes in Gasoil Options - Yahoo Finance",
    "Link": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pY2UtZ2Fzb2lsLWZ1dHVyZXMtb3B0aW9ucy1yZWNvcmQtMTIwMDAwMjI1Lmh0bWzSAQA?oc=5",
    "Published": "Mon, 15 Jul 2024 12:00:00 GMT",
    "Categories": [
      "Stock Prices",
      "Commodities",
      "Trade and Export"
    ],
    "Content": "ICE Gasoil Futures and Options at Record Open Interest with Record Q2 Trading Volumes in Gasoil Options Read full article Business Wire Mon, Jul 15, 2024, 5:00 AM4 min read Link Copied 0 In this article: Performance demonstrates strength of the global benchmark post the EU's ban on Russian Diesel LONDON, July 15, 2024 --(BUSINESS WIRE)--Intercontinental Exchange, Inc. (NYSE: ICE), a leading global provider of technology and data, today announced that its Low Sulphur Gasoil markets hit a series of open interest records through June 2024, reaching a high of 1.2 million across futures and options on July 1, 2024, equivalent to 120 million metric tons.ICE Low Sulphur Gasoil sits at the center of middle distillates trading as the global benchmark for refined oil products. Gasoil futures and options open interest is up over 40% year-over-year (y/y), with trading volumes up 30% y/y.Gasoil options activity has been performing particularly well, hitting record open interest of 234,570 contracts on July 3, while Gasoil options traded at record levels in Q2 2024 with 287,421 options traded. During Q2 2024, a record of approximately 16.2 million oil options contracts traded at ICE, including a record 13.5 million Brent options contracts. Customers can benefit from margin offsets as high as 98% when clearing ICE Gasoil alongside other oil positions at ICE.ICE Gasoil is a physically deliverable futures contract for what is now ultra-low sulphur diesel. An average of over 100,000 tons has entered the delivery process each month since the start of 2024, demonstrating the success of the benchmark following ICE's changes to the methodology of the Gasoil contract to align it with sanctions preventing the delivery or export of Russian oil in the European Union which took effect from February 2023.\"More than 18 months on from ICE's first successful delivery of Russian-free barrels of gasoil, the contract continues as the most liquid distillate benchmark,\" said Jeff Barbuto, Global Head of Oil Markets at ICE. \"For 43 years, ICE's gasoil market has allowed customers to confidently participate in the physical delivery and trade of gasoil globally, and the record trading activity is a testament to the continued value participants find in the contract.\"ICE Low Sulphur Gasoil forms part of ICE's global crude and refined product complex which includes Brent crude, the price barometer for three quarters of the world's internationally traded crude oil, alongside ICE Midland WTI (HOU), ICE WTI (Cushing), ICE Dubai (Platts), ICE Murban, as well as NY Harbor RBOB Gasoline and Heating Oil. These benchmarks are supported by over 800 related oil products, giving participants the ability to manage the price points of products at the point of consumption or production around the world. Open interest in ICE's global oil complex is up over 20% at 14 million contracts. Story continues About Intercontinental Exchange Intercontinental Exchange, Inc. (NYSE: ICE) is a Fortune 500 company that designs, builds and operates digital networks that connect people to opportunity. We provide financial technology and data services across major asset classes helping our customers access mission-critical workflow tools that increase transparency and efficiency. ICE's futures, equity, and options exchanges - including the New York Stock Exchange - and clearing houses help people invest, raise capital and manage risk. We offer some of the world's largest markets to trade and clear energy and environmental products. Our fixed income, data services and execution capabilities provide information, analytics and platforms that help our customers streamline processes and capitalize on opportunities. At ICE Mortgage Technology , we are transforming U.S. housing finance, from initial consumer engagement through loan production, closing, registration and the long-term servicing relationship. Together, ICE transforms, streamlines and automates industries to connect our customers to opportunity.Trademarks of ICE and/or its affiliates include Intercontinental Exchange, ICE, ICE block design, NYSE and New York Stock Exchange. Information regarding additional trademarks and intellectual property rights of Intercontinental Exchange, Inc. and/or its affiliates is located here . Key Information Documents for certain products covered by the EU Packaged Retail and Insurance-based Investment Products Regulation can be accessed on the relevant exchange website under the heading \"Key Information Documents (KIDS).\"Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995 - Statements in this press release regarding ICE's business that are not historical facts are \"forward-looking statements\" that involve risks and uncertainties. For a discussion of additional risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see ICE's Securities and Exchange Commission (SEC) filings, including, but not limited to, the risk factors in ICE's Annual Report on Form 10-K for the year ended December 31, 2023, as filed with the SEC on February 8, 2024.Category: EXCHANGESICE- CORPSource: Intercontinental ExchangeView source version on businesswire.com: https://www.businesswire.com/news/home/20240715489049/en/ Contacts ICE Media Contact: Jess Tatham jess.tatham@ice.com +44 7377 947136 ICE Investor Contact: Katia Gonzalez katia.gonzalez@ice.com (678) 981-3882 View comments Advertisement Up next Advertisement Up next Advertisement Up next Advertisement Up next Advertisement Up next Advertisement Up next Advertisement Up next Advertisement",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline - Nairametrics",
    "Link": "https://news.google.com/rss/articles/CBMihAFodHRwczovL25haXJhbWV0cmljcy5jb20vMjAyNC8wNy8wMi9kYW5nb3RlLXJlZmluZXJ5LWJlZ2lucy1nYXNvaWwtZXhwb3J0cy10by13ZXN0LWFmcmljYW4tY291bnRyaWVzLWFzLWltcG9ydHMtZnJvbS1ldXJvcGUtZGVjbGluZS_SAYoBaHR0cHM6Ly9uYWlyYW1ldHJpY3MuY29tLzIwMjQvMDcvMDIvZGFuZ290ZS1yZWZpbmVyeS1iZWdpbnMtZ2Fzb2lsLWV4cG9ydHMtdG8td2VzdC1hZnJpY2FuLWNvdW50cmllcy1hcy1pbXBvcnRzLWZyb20tZXVyb3BlLWRlY2xpbmUvP2FtcD0x?oc=5",
    "Published": "Mon, 15 Jul 2024 10:06:49 GMT",
    "Categories": [
      "Commodities",
      "Trade and Export"
    ],
    "Content": "Google NewsOpening https://nairametrics.com/2024/07/02/dangote-refinery-begins-gasoil-exports-to-west-african-countries-as-imports-from-europe-decline/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "ICE Low Sulphur Gasoil markets hit series of OI records - FX News Group",
    "Link": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZnhuZXdzZ3JvdXAuY29tL2ZvcmV4LW5ld3MvZXhjaGFuZ2VzL2ljZS1sb3ctc3VscGh1ci1nYXNvaWwtbWFya2V0cy1oaXQtc2VyaWVzLW9mLW9pLXJlY29yZHMv0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 12:08:12 GMT",
    "Categories": [
      "Market Trends",
      "Commodities"
    ],
    "Content": "Google NewsOpening https://fxnewsgroup.com/forex-news/exchanges/ice-low-sulphur-gasoil-markets-hit-series-of-oi-records/",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  },
  {
    "Title": "India's Nayara Energy offers rare vacuum gasoil cargo - Construction World",
    "Link": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvbnN0cnVjdGlvbndvcmxkLmluL2VuZXJneS1pbmZyYXN0cnVjdHVyZS9vaWwtYW5kLWdhcy9pbmRpYXMtbmF5YXJhLWVuZXJneS1vZmZlcnMtcmFyZS12YWN1dW0tZ2Fzb2lsLWNhcmdvLzU4OTYw0gEA?oc=5",
    "Published": "Mon, 15 Jul 2024 09:12:18 GMT",
    "Categories": [
      "Commodities"
    ],
    "Content": "India's Nayara Energy offers rare vacuum gasoil cargo Home Infrastructure Energy OIL & GAS India's Nayara Energy offers rare vacuum gasoil cargo Share OIL & GAS India's Nayara Energy offers rare vacuum gasoil cargo 15 Jul 2024 1 Min Read CW Team According to market sources, it was reported that Indian private refiner Nayara Energy had issued a rare tender offering vacuum gasoil (VGO) for loading in September. The refiner reportedly offered approximately 70,000 metric tons of VGO with a maximum 3% sulphur content. The VGO was scheduled to load from Vadinar port in the western Indian state of Gujarat between September 1 and 10. The sources mentioned that Nayara Energy typically refrains from commenting on commercial deals. VGO, a residual fuel produced after petroleum distillation, can serve as a feedstock for manufacturing transportation fuels in refining processes. Based on ship-tracking data from Kpler and LSEG, it was noted that the company had last exported a VGO cargo in December 2022, a period coinciding with maintenance activities at its Vadinar refinery. Nayara EnergyOilGasvacuum gasoil (VGO) According to market sources, it was reported that Indian private refiner Nayara Energy had issued a rare tender offering vacuum gasoil (VGO) for loading in September. The refiner reportedly offered approximately 70,000 metric tons of VGO with a maximum 3% sulphur content. The VGO was scheduled to load from Vadinar port in the western Indian state of Gujarat between September 1 and 10. The sources mentioned that Nayara Energy typically refrains from commenting on commercial deals. VGO, a residual fuel produced after petroleum distillation, can serve as a feedstock for manufacturing transportation fuels in refining processes. Based on ship-tracking data from Kpler and LSEG, it was noted that the company had last exported a VGO cargo in December 2022, a period coinciding with maintenance activities at its Vadinar refinery. Next Story Real Estate 16 Jul 2024 CBRE appoints Michael Young as Managing Director CBRE Middle East, the global leader in commercial real estate advisory services, announces the appointment of Michael Young to lead the company?s operations in the Middle East and North Africa as the Managing Director, effective 1st of July 2024. Anshuman Magazine, Chairman & CEO for India, Southeast Asia, Middle East & Africa commented: \"I am delighted to welcome Michael Young as the new Managing Director for CBRE across the MENA region. Michael is a leader with a proven track record of delivering exceptional results, fostering a culture of innovation, collaboration, and excellence across th.. Read More Next Story Infrastructure Urban 16 Jul 2024 Walplast launches new campaign for retail brand HomeSure Walplast Products, a distinguished leader in building materials production and the third-largest manufacturer of Wall Putty in India, proudly announces the launch of its new campaign for the retail brand HomeSure. The campaign amplifies robust growth within the HomeSure portfolio, which encompasses a comprehensive range of construction materials and solutions including HomeSure Wall Putty, HomeSure TileEx (Tile Adhesives), HomeSure GypEx (Gypsum-based products), HomeSure wShield (Construction Chemicals, Admixtures), HomeSure WallEx (AAC blocks, Spray Plaster, Block Jointing Mortar), HomeSure M.. Read More Next Story Real Estate 16 Jul 2024 Vestian: 65% of office space in India is green-certified Accessing any real estate company?s performance based on ESG becomes crucial as the real estate sector is the second largest employer in India, accounting for 39% of carbon emissions. The government?s constant push to achieve net zero emissions by 2070 is likely to play a pivotal role in shaping the real estate market in India. As per Vestian Research, over 65% of Grade A office space across India's top 7 cities is green-certified. Moreover, among 1,362 Grade A buildings, 805 (or 59%) boast of green certifications, highlighting India's growing commitment to sustainable construction. As India.. Read More Opinion Poll Question : Which technological advancement do you believe will most transform the real estate industry in the coming years? Virtual Reality and 3D Property Tours Smart Home and Building Automation Blockchain for Property Transactions Big Data and Predictive Analytics for Market Insights Augmented Reality for Property Staging and Design Drone Technology for Aerial Photography and Site Analysis Live Results : Virtual Reality and 3D Property Tours Smart Home and Building Automation Blockchain for Property Transactions Big Data and Predictive Analytics for Market Insights Augmented Reality for Property Staging and Design Drone Technology for Aerial Photography and Site Analysis Latest updates Real Estate 16 Jul 2024 CBRE appoints Michael Young as Managing Director ECONOMY & POLICY 16 Jul 2024 Walplast launches new campaign for retail brand HomeSure Real Estate 16 Jul 2024 Vestian: 65% of office space in India is green-certified Technology 16 Jul 2024 Cummins India launches global competency centre in Pune Equipment 16 Jul 2024 Hyundai enters the dozer market with the HD100 Real Estate 16 Jul 2024 Hindalco Sells Land to Ekamaya Properties Technology 16 Jul 2024 India's Data Center Capacity to Surge POWER & RENEWABLE ENERGY 16 Jul 2024 Sumant Sinha Appointed Global Climate Co-Chair Follow us on Hi There! \"Now get regular updates from CW Magazine on WhatsApp! Join the CW WhatsApp channel for the latest news, industry events, expert insights, and project updates from the construction and infrastructure industry. Click the link below to join\" +91 81086 03000 Join us Telegram Modal Heading x First Name * Last Name * Industry * ---Choose--- Architect Builder Developer Equipment Steel Cement Paints Chemicals Consultant Contractor Buider Contractor Manufracturer Material supplier(for any other mentioned above) Financier Government Academic Institution Other Email Address * Mobile Number * Password * Confirm Password * By creating an account, you agree to our Terms and Conditions and have read and acknowledge the Privacy Policy Register Already have an account? Login Or Email Address * Password * Forgot Password? Login Don't have an account? Register Please enter the details ---Choose--- Architect Builder Developer Equipment Steel Cement Paints Chemicals Consultant Contractor Buider Contractor Manufracturer Material supplier(for any other mentioned above) Financier Government Academic Institution Other Update Email Address Submit Back x Stay Updated on India's Construction Economy x Schedule a Call Back Call us now at +91 8108603000 Submit x x Stay updated On the latest construction news through our weekly newsletter Thank you for subscribe our newsletter Email subscribe! x subscribe to the newsletter Don't miss out on valuable insights and opportunities to connect with like minded professionals I have read and understood the privacy and cookies policy and agree to receive newsletters from Construction World by email x @ RS. 19 (Single article access) @ RS. 49 (One day full access) Pay Now",
    "Relevancy Score": "",
    "Relevancy Reasoning": ""
  }
]