{
    "title": "Dangote Refinery: Crude oil supply options ",
    "source": " Blueprint Newspapers Limited",
    "Content": "Dangote Refinery: Crude oil supply options - Blueprint Newspapers Limited Skip to content The international corporations drilling oil in Nigeria are the country's greatest enemies. They have never hidden their condescension for Nigeria even as they are allowed to operate the industry on their own terms. In fact, the IOCs are partially responsible for Nigeria's total dependence on imported refined petroleum products.The international oil companies (IOCs) are compelled to operate refineries in most of the countries they drill oil. In Nigeria they defiantly snubbed the federal government's directives that they should establish refineries. Their excuse was that no refinery could succeed in Nigeria because the federal government stands around to fix unacceptable pump prices for refined petroleum products.Aliko Dangote, president of the Dangote Group, and some development banks in the international money market came together to prove that the treacherous oil firms exploiting crude oil in Nigeria were telling transparent lies when they refused to establish refineries in Nigeria on the grounds that the pump prices of refined petroleum products were controlled by the federal government. The international money market advanced loans close to $9 billion to Dangote for the establishment of what is now acknowledged as one of the world's largest refineries.No one would advance such a colossal sum as a loan for a venture known to have no means of repaying the loan. The fact that the international development banks were willing to fund Dangote Refinery is a clear indication that the venture was viable and could not be bugged down by government regulation of the pump prices of refined petroleum products.The lies of the IOCs were exposed by the success in sourcing for funds to build a giant refinery in Nigeria.The mischievous oil firms were disgraced as their lies were exposed. They gnashed their teeth and proceeded to wait for Dangote and the Nigerian people down the road.The refinery they were determined to truncate came on stream in January 2024 and in apparent frustration they drew up fresh plans to sabotage the business of the refinery and keep Nigeria as a perpetual importer of refined petroleum products.They know that if Dangote Refinery succeeds, the refineries in Europe that were supplying refined petroleum products to Nigeria at a catastrophic cost of well over $20 billion annually could be out of businessThey decided to use the last weapon in their armoury to frustrate Dangote Refinery. They defiantly refused to sell crude oil to Dangote. Those who reluctantly offer to sell the feedstock put their price tag at $6 above what obtains in the international market.Consequently, Dangote has been compelled to import crude oil for his refinery from the United States of America (USA) when Nigeria remains the highest producer of crude oil in Africa.The treacherous international oil companies operating in Nigeria have finally held Dangote Refinery and the Nigerian people in the jugular.Diesel from Dangote Refinery is more expensive than the high sulfur diesels imported by independent petroleum marketers from Europe into Nigeria.The most painful aspect of the sabotage by the IOCs is that the regulator of the industry sees nothing wrong with collaborating with foreigners to frustrate a Nigerian venture designed to ease the merciless grip of European petroleum refiners on Nigerians.The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) apathetically issues licences to independent petroleum marketers to import diesel from Europe with a weak naira and torment Nigerian consumers with high energy cost that escalates the country's catastrophic inflationary trend.When newsmen confronted the agency on the illogicality of encouraging diesel imports when a Nigerian refinery is ready to supply, NMDPRA retorted that in a deregulated market, marketers are free to source diesel from anywhere.NMDPRA is the regulatory arm of the Nigerian National Petroleum Company Limited (NNPCL). The company is more or less an appendage of the mischievous international oil companies battling to protect the interest of European crude oil refiners patronised by NNPCL.NNPCL, as industry regulator, could order the deceitful IOCs to sell crude oil to Dangote Refinery at international market price. But it could only do so to the detriment of its own selfish interest.NNPCL would lose trillions of naira if Dangote Refinery gets crude oil from Nigeria and sells refined petroleum products locally at reduced pump prices.That would mean the end of the petrol subsidy scandal through which the company rakes in trillions of naira annually. That explains why NNPCL allows foreign exploiters to frustrate Dangote Refinery.NNPCL has unrestrained powers to supply crude oil to Dangote Refinery which at the moment is the only way to ease the asphyxiating hold of high energy cost on Nigeria's economy.If the treacherous IOCs defy NNPCL's directive to supply crude oil to Dangote Refinery at international market rate, the company could do the job by itself.NNPCL allocates 445,000 barrels of crude oil daily to Nigeria's moribund refineries. Nigeria's four refineries have not refined a barrel of crude oil in the last three years.Consequently, NNPCL exports the 445,000 barrels of crude oil daily to foreign refineries that feed Nigeria with refined petroleum products in return. If NNPCL reroutes the crude oil to Dangote Refinery, Nigeria would benefit extensively.The foreign refineries use the residue of the crude oil supplied by NNPCL for their petrochemical products and export them to Nigeria. If Dangote Refinery gets the crude oil, the residue would be used to produce resins that would be used to ease the escalating cost of producing plastic containers in the soft drink and brewery industries.Besides, NNPCL owes Dangote Refinery the sum of $1.7 billion as part of the 20 per cent equity it bought. It was expected to pay back with 300,000 barrels of crude oil daily. Its refusal to supply borders on betrayal of trust.It is rather saddening that Mele Kyari, the man who navigated NNPCL through the horrendous petrol subsidy scandal and crude oil theft, is still its group managing director. The man should do the right thing. WhatsApp Email LinkedIn Twitter Facebook Related Posts Saint Academy building collapse: Tears and lamentations not enough July 16, 2024July 16, 2024 Why Xi's works a key to decoding modern China and its global vision July 16, 2024July 16, 2024 Soyinka: The icon for whom apologies are unnecessary July 14, 2024July 14, 2024 About Jerry Uwah View all posts by Jerry Uwah →"
}