{
    "title": "EIA reports surge in Iraqi oil exports to the US - Shafaq News ",
    "source": " Shafaq News",
    "Content": "EIA reports surge in Iraqi oil exports to the US - Shafaq News Breaking News Iraqi Parliament includes the General Amnesty Bill on the agenda for next Wednesday's session Iraq's Federal Intelligence Investigation Agency arrests seven in Nineveh UN Iraq and Ministry of Water Resources launch \"Water is Life\" Campaign Iraq and Iran discuss enhanced security cooperation and border management 2024-07-14 10:59 Share font Enable Reading Mode A- A A+ Shafaq News/ Iraqi oil exports to the United States saw an increase last week, according to the US Energy Information Administration (EIA) on Sunday. The EIA reported that the average US crude oil imports from nine key countries reached 5.635 million barrels per day (bpd) last week, up by 235,000 bpd from the previous week's average of 5.400 million bpd. The report said that Iraq's oil exports to the US averaged 217,000 bpd last week, marking an increase of 22,000 bpd from the previous week's average of 195,000 bpd. Canada led the oil imports to the US last week, averaging 3.889 million bpd, followed by Mexico with 417,000 bpd. Saudi Arabia came next with 239,000 bpd, Colombia with 226,000 bpd, and Brazil with 217,000 bpd. According to the EIA data, the US imported 170,000 bpd from Nigeria, 162,000 bpd from Ecuador, and 44,000 bpd from Libya. Related News Snapshot of recent data: Iraqi oil exports to the United States halved last week Iraq's oil exports to the US in March decline amid global market shifts Iraqi oil exports to the US declined last week: EIA Iraq exported more than 6 million barrels of oil to the United States in January Iraq exported 5.5 million barrels of oil to the US during March OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance PausePlay % buffered00:00 00:00 UnmuteMute Disable captionsEnable captions Settings CaptionsDisabledQualityundefinedSpeedNormal CaptionsGo back to previous menu QualityGo back to previous menu SpeedGo back to previous menu 0.5x0.75xNormal1.25x1.5x1.75x2x4x PIPExit fullscreenEnter fullscreen Play Shafaq Live Shafaq Live English English Radio facebook"
}