"Global Oil Prices Inched Down amid China's Slowing Economy - News En.tempo.co Email Kata Sandi Lupa Kata Sandi? Klik di Sini Masuk atau Masuk melalui Google Belum Memiliki Akun Daftar di Sini Nama Lengkap Email Kata Sandi Ulangi Kata Sandi Daftar atau Daftar melalui Google Sudah Memiliki Akun Masuk di Sini Konfirmasi Email Kami telah mengirimkan link aktivasi melalui email ke rudihamdani@gmail.com . Klik link aktivasi dan dapatkan akses membaca 2 artikel gratis non Laput di koran dan Majalah Tempo Jika Anda tidak menerima email, Kirimkan Lagi Sekarang Home Economy & Business Global Oil Prices Inched Down amid China's Slowing Economy Translator Ririe Ranggasari Editor Petir Garda Bhwana 16 July 2024 10:59 WIB Oil drilling off the coast of Qatar. [www.gdi.com.qa] TEMPO.CO , Jakarta - World oil prices fell on Tuesday, July 16. Reuters reported that Brent crude fell 9 cents, or 0.1 percent, to US$84.76 per barrel, while West Texas Intermediate (WTI) crude fell 13 cents, or 0.2 percent, to US$81.78 per barrel. Reuters wrote that the drop in global oil prices was due to concerns over declining demand from China amid the country's economic slowdown. In the second quarter of 2024, China's economy grew at a much slower rate than forecast, triggered by a prolonged property downturn and job insecurity. In April-June 2024, China's economy was recorded to have grown 4.7 percent, the slowest since Q1/2023 and below the 5.1 percent estimated in a Reuters poll. China's oil refinery output also fell 3.7 percent in June. The three-month drop in output was due to planned maintenance. Meanwhile, lower refining margins and sluggish fuel demand are prompting independent mills to cut production.Meanwhile, Fed chair Jerome Powell said that U.S. inflation readings in the second quarter of this year slightly increased confidence that the rate of price increases was returning to the central bank's target on a sustainable basis. His statement was interpreted by market players as an indication of a shift to lower interest rates, possibly soon. Lower interest rates are expected to lower borrowing costs, allowing economic activity and oil demand to increase. RIRI RAHAYU Editor's Choice: The World's Richest Women in 2024; Forbes List Unveiled Click here to get the latest news updates from Tempo on Google News oil priceChinaEconomy Recommended Indonesia to Call on International Communities to Follow Up on ICJ Advisory Opinion 6 hours ago Reasons Why Indonesian Foreign Minister Yet to Visit Palestine 6 hours ago Sri Mulyani Says Simbara Boosts Coal, Mineral Non-Tax Revenue 6 hours ago Indonesia Finalizing Family Office, Aims for Pre-October Launch 8 hours ago Palace Announces Resolution of Social Conflict on Maluku's Haruku Island 8 hours ago Family Office Plan; Luhut to Imitate UAE's Arbitration Courts 13 hours ago Today's Top 3 News: Indonesian Police Seize 394 Packages of Marijuana Belongs to Papua-Papua New Guinea Kingpin 14 hours ago Cosmetic Preservatives Found in Aoka, Okko Bread; Here's the Chronology 14 hours ago Jokowi Plans Cabinet Meeting in Nusantara for Late July 15 hours ago Jokowi Kicks Off Papua Visit, Slated to Attend National Children's Day Commemoration Tomorrow 17 hours ago China's Xi Jinping Urges All-out Rescue Efforts After Highway Bridge Collapse Kills 11 1 hari lalu China's Xi Jinping Urges All-out Rescue Efforts After Highway Bridge Collapse Kills 11 President Xi Jinping urged all-out rescue efforts after a highway bridge collapse on Friday in Shaanxi province in China's northwest killed 11 people. Read More Today's Top 3 News: Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall 3 hari lalu Today's Top 3 News: Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall Here is the list of the top 3 news on Tempo English today. Read More 6 Must-Try Traditional Chinese Foods for Tourists 3 hari lalu 6 Must-Try Traditional Chinese Foods for Tourists Exploring Chinese foods is an essential part of any visit to the country. Read More Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall 3 hari lalu Prabowo Optimistic for 8% Economic Growth, Raising Doubts After Jokowi's Shortfall President-elect Prabowo Subianto expressed optimism about achieving 8% economic growth. Read More Indonesia Needs to Push for EV Localization to Lead ASEAN Market, Boost Economy, Analysts Said 4 hari lalu Indonesia Needs to Push for EV Localization to Lead ASEAN Market, Boost Economy, Analysts Said Indonesia should localize its EV component production to become a leader in the electric vehicle (EV) industry within ASEAN, analsysts said. Read More Philippines, China to Set Up New Channels to Handle South China Sea Rows 5 hari lalu Philippines, China to Set Up New Channels to Handle South China Sea Rows The Philippines and China have agreed to set up new lines of communication to improve their handling of maritime disputes. Read More Top 10 Best-Selling Electric Cars in June 2024; Chery Omoda E5 Tops the List 5 hari lalu Top 10 Best-Selling Electric Cars in June 2024; Chery Omoda E5 Tops the List The electric car market in Indonesia continues to heat up, with manufacturers vying for dominance each month. Read More Imported Clothes Allegedly Sold Illegally in Tanah Abang 5 hari lalu Imported Clothes Allegedly Sold Illegally in Tanah Abang The Tanah Abang Wholesale Market is known to be a hub for buying and selling imported clothes, including from China. Read More IMF Sees Steady Global Growth, Warns of Slowing Disinflation Momentum 6 hari lalu IMF Sees Steady Global Growth, Warns of Slowing Disinflation Momentum The IMF warns in an update to its World Economic Outlook(WEO) that momentum in the fight against inflation is slowing. Read More BPS: Chinese Imports Dominate Indonesian Market, Led by Machinery and Electronics 6 hari lalu BPS: Chinese Imports Dominate Indonesian Market, Led by Machinery and Electronics Statistics Indonesia (BPS) revealed that imported products from China dominated Indonesia's non-oil and gas import landscape in June 2024. Read More [x] close"