"ICE Low Sulphur Gasoil markets hit series of OI records - FX News Group Breaking News AMF and Banque de France call for coordinated move to T+1 settlement TipRanks partners with DXtrade to offer in-platform Stock Research SquaredFinancial hires ADSS alum Francis Lee as Head of Asia XTX Markets' Alex Gerko loses quant trader payouts tax case at former firm GSA Capital ATFX Executive Talks: Hormoz Faryar, Managing Director of Institutional Sales, ATFX MENA Exchanges News/ ICE News ICE Low Sulphur Gasoil markets hit series of OI records Maria Nikolova 0 Comments July 15, 2024 Intercontinental Exchange, Inc. (NYSE:ICE) today announced that its Low Sulphur Gasoil markets hit a series of open interest records through June 2024, reaching a high of 1.2 million across futures and options on July 1, 2024, equivalent to 120 million metric tons. ICE Low Sulphur Gasoil sits at the center of middle distillates trading as the global benchmark for refined oil products. Gasoil futures and options open interest is up over 40% year-over-year (y/y), with trading volumes up 30% y/y. Gasoil options activity has been performing particularly well, hitting record open interest of 234,570 contracts on July 3, while Gasoil options traded at record levels in Q2 2024 with 287,421 options traded. During Q2 2024, a record of approximately 16.2 million oil options contracts traded at ICE, including a record 13.5 million Brent options contracts. Customers can benefit from margin offsets as high as 98% when clearing ICE Gasoil alongside other oil positions at ICE. ICE Gasoil is a physically deliverable futures contract for what is now ultra-low sulphur diesel. An average of over 100,000 tons has entered the delivery process each month since the start of 2024. ICE Low Sulphur Gasoil forms part of ICE's global crude and refined product complex which includes Brent crude, the price barometer for three quarters of the world's internationally traded crude oil, alongside ICE Midland WTI (HOU), ICE WTI (Cushing), ICE Dubai (Platts), ICE Murban, as well as NY Harbor RBOB Gasoline and Heating Oil. These benchmarks are supported by over 800 related oil products, giving participants the ability to manage the price points of products at the point of consumption or production around the world. Open interest in ICE's global oil complex is up over 20% at 14 million contracts. Maria Nikolova Maria has been engaged in journalism for more than 17 years, providing Forex industry coverage for the past 10 years. Before joining FNG she was Managing Editor at FinanceFeeds. Prior to that, she worked at LeapRate. Maria has a Philosophy degree from the St. Kliment Ochridski university in Sofia. She has specialized in Cognitive Science in Vienna. Her interests include psychology, AI, and linguistics. Related Posts Exchanges News / AMF and Banque de France call for coordinated move to T+1 settlement ICE News / ICE to launch clearing service for U.S. Treasury securities and repurchasing agreements Exchanges News / LSE confirms tech issue with news publication ‹ Nasdaq approves LMAX as new Core Exchange for its suite of Crypto Indexes › TASE upgrades and expands foreign currency clearing services Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Δ We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking \"Accept\", you consent to the use of ALL the cookies. Cookie settingsACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the ... Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"