"OPEC: Global crude oil demand will rise to 116m bpd in 2045 - TV360 Nigeria The Organisation of the Petroleum Exporting Countries (OPEC) says world demand for oil is projected to rise to an estimated 116 million barrels per day (bpd) in 2045. Haitham Al Ghais, OPEC secretary-general, spoke on Tuesday in Abuja at the ongoing 23rd Nigerian Oil and Gas (NOG) Energy Week Conference and Exhibition. The conference is themed 'Showcasing Opportunities, Driving Investment, Meeting Energy Demand'. Addressing the conference via teleconference, Al Ghais said the world economy is expected to double in size - growing from $138 trillion in 2023 to $270 trillion in 2045. He explained that the oil cartel forecasted a rapidly expanding world population that would surpass 9.5 billion people. \"Why are we optimistic? Let us consider these statistics, which are based on OPEC's World Oil Outlook,\" he said. \"Urbanisation alone will account for over half a billion people moving to cities around the world by 2030. Al Ghais said in the upcoming years, the industry will need to significantly increase investment levels in order to keep up with the rapid and robust growth in energy consumption. He said according to its research, the total oil-related investment requirements between 2024 and 2045 would be $14 trillion or about $610 billion on average per year. \"Securing this vital funding is essential to maintaining security of supply and avoiding unwanted volatility,\" Al Ghais said. \"In spite of these facts, I am certain you are aware of some recent predictions for peak demand by 2030 and calls for a discontinuation of investment in hydrocarbons.\" Al Ghais pledged that OPEC and its member countries would keep pushing to advocate for a fair process for adaptation, mitigation and means of implementation with regard to climate finance and technology. The secretary-general said an estimated 675 million people lack access to basic forms of energy and 2.3 billion without access to clean cooking fuels. Al Ghais, while commending President Bola Tinubu, appreciated Nigeria's unwavering commitment to OPEC and the declaration of cooperation (DoC). Share this: Opeyemi Owoseni2 weeks ago 0 13 1 minute read Share Facebook X LinkedIn Tumblr Pinterest Reddit VKontakte Skype Messenger Messenger Share via Email Print Opeyemi Owoseni Related Articles Dangote set for production as crude supply hits 6million barrels January 9, 2024 Nigeria's oil sells at about $92 a barrel, $14 higher than FG budget benchmark April 3, 2024 Access Bank Loses CEO, Others in California Helicopter Crash February 10, 2024 Reps to Probe 'Mass Retrenchment' of CBN Workers May 30, 2024 Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Check Also Close Business Tinubu appoints Agara DG NDE 3 days ago Facebook X WhatsApp Telegram Close Search for"