"China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report - The North Africa Post The North Africa Post HomeHeadlines Algeria Egypt Libya Mauritania Morocco Tunisia Business Emerging Markets Finance EnergyInternational Africa Americas Asia Europe Opinions Columns Editorials Letters to the Editor Op Eds Profile Interview Portrait Lifestyle Culture Eating out Technology Community Blogs Comments Videos HomeHeadlinesInternational China's oil imports from Africa plunge amid shift to suppliers in Gulf, Asia and Russia - report North Africa PostJuly 16, 2024 10:42 am Africa once accounted for more than a third of Chinese oil imports, but now major African oil suppliers are struggling with declining production and exports to China that has found other markets due to geopolitical considerations, infrastructure issues, and domestic political problems, according to a recent report by the Carnegie Endowment for International Peace. China used to import more than a third of its oil supplies from Africa but by 2022, that figure had dropped to about one-tenth, according to the Observatory of Economic Complexity (OEC), an online data platform. According to Carnegie's report entitled 'How Is China's Economic Transition Affecting its Relations with Africa?', between 2019 and 2023, there were dramatic increases in China's imports of oil from Malaysia (408%), the UAE (254%), Kazakhstan (214%) and Kuwait (41%). By contrast, during the same period, all eight major African oil producers, except Chad, earned much less than they did before the pandemic, according to the report. Angola has fallen down the list from being China's No. 2 source of crude oil a decade ago to the eighth place in the ranking today. The sharp declines in China's oil imports from Angola, but also South Sudan (77%), Sudan (67%) and Nigeria (61%), for example, have been due to a number of factors, observers say, including geopolitical considerations, lack of investment in equipment and new oil fields and domestic political problems. As China's oil imports from Africa decline, it is increasingly turning to the more predictable production infrastructure of the Gulf countries and Russia and other Asian countries, according to the report from the Washington-based think tank. CATEGORIES AfricaAsiaBusinessEnergyHeadlinesInternational Share This AUTHORNorth Africa Post North Africa Post's news desk is composed of journalists and editors, who are constantly working to provide new and accurate stories to NAP readers. NEWER POSTMorocco's farming sector to the test of drought OLDER POSTMorocco donates 9 high-voltage generators to Niger, confirming its African solidarity Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies 3rd Party Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. 3rd Party Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Please enable Strictly Necessary Cookies first so that we can save your preferences! Enable All Save Settings We'd like to show you notifications for the latest news and updates. AllowCancel"