"Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline - Nairametrics Login Register HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Search for: Author: Category: [] Tags: [] Start date: End date: No Result View All Result Home Sectors Energy Dangote refinery begins gasoil exports to West African countries, as imports from Europe decline by Aghogho Udi 3 weeks ago in Energy, Sectors Share on FacebookShare on TwitterShare on Linkedin Nigeria's new Dangote oil refinery is ramping up gasoil exports to West Africa, capturing market share from European refiners, according to traders and shipping data. According to Reuters, the $20 billion refinery is currently producing a lower grade of gasoil than anticipated as it awaits the restart of units necessary for producing cleaner fuels. Consequently, the refinery is seeking buyers in neighbouring markets. Related Stories Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 In May, gasoil exports from the refinery reached nearly 100,000 barrels per day (bpd), almost doubling April's levels, data from analytics firm Kpler indicated. Most of these exports were directed to other West African countries, with one shipment sent to Spain. However, preliminary data for June shows a significant drop in gasoil volumes, although overall oil product exports, including fuel oil, naphtha, and jet fuel, remained relatively high at 225,000 bpd. Decline in European exports to West Africa \"The refinery has shifted the balance in West Africa,\" impacting European markets, a European distillates trading source told Reuters. Kpler data revealed that EU and UK gasoil exports to West Africa fell to a four-year low of 29,000 bpd in May, while Russian exports to the region dropped to an eight-month low of 87,000 bpd in the same month. Dangote has been selling some high-sulphur gasoil in the Nigerian market, but a dispute has arisen with local fuel retailers over who is responsible for selling the dirtier fuel. News continues after this ad The Petroleum Industry Bill passed in 2021, mandated a sulphur content of 50 parts per million (ppm) to align with the sub-regional ECOWAS standards adopted in 2020. However, the regulator permitted the sale of gasoil with sulphur content above 200 ppm locally from the beginning of the year until June, allowing local refineries and importers more time to comply with the new standard. As European countries, including major hubs like Belgium and the Netherlands, tighten regulations on high-sulphur gasoil exports, cargoes from the Dangote refinery have found markets in regions with more lenient motor fuel standards. More Insights Earlier in May, the Chairman of the Dangote refinery, Aliko Dangote had stated that when fully completed, the refinery will supply product to West and Central African countries as its capacity is too big for Nigeria alone. This decline in gasoil exports from Europe to West Africa confirms earlier reports by Reuters which stated that the refinery has the potential to reduce the $17 billion in oil imports into the continent and even lead to the closure of some European refineries. In 2023, West Africa became the largest regional recipient of Europe's gasoline exports, receiving roughly one-third of the continent's average exports, which totalled 1.33 million barrels per day (bpd). Follow us for Breaking News and Market Intelligence. Tags: Dangote RefineryEuropean refineriesGasoilPetroleum Industry BillWest Africa Aghogho Udi My name is Aghogho Udi, a writer, journalist, and researcher, deeply intrigued by the political economy of Nigeria and the broader African context. My focus lies in shedding light on the intricate connections between macroeconomics and politics, offering valuable insights that foster comprehension of Africa's prevailing economic landscape and the world in general. Related Posts Energy Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Op-Eds Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Economy Dangote Refinery: 'Non-availability of crude oil' to domestic refineries affecting fuel quality in Nigeria - Lawmakers July 22, 2024 Energy Dangote refinery to import crude oil from Libya July 22, 2024 Energy \"Let them (NNPCL) buy me out and run the refinery\" says Aliko Dangote amid monopoly allegations July 21, 2024 Digital Media Energy Expert Kelvin Emmanuel on Dangote Refinery Challenges and NNPC's Strategic Stake. July 21, 2024 Next Post ID4D: World Bank restructures $430 million project to guarantee financing as Nigeria misses deadline Leave a Reply Cancel reply Your email address will not be published. Required fields are marked *Comment *Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Ad Next Stay Riding Motorbike Alone Across Laos - Beautiful Memories from LAOS - Nếm TV 40 42 00:00 00:00 / 00:00 10 Sec Business News | Stock Market | Money Market | Cryptos | Financial Literacy | SME | Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar Consultant returns N1.5 billion from NIRSAL contract to EFCC Follow us on social media: Recent News Dangote, Lokpobiri, NNPC, NUPRC, NMDPRA leadership meet over refinery, crude crisis July 22, 2024 Dangote, NNPC, NUPRC - Bare bottom struggle by Joseph Edgar July 22, 2024 Download Nairametrics iOS AppDownload Nairametrics Android AppHomeMarketsSectorsEconomyBusiness NewsFinancial LiteracyDisclaimerAds Disclaimer (c) 2024 Nairametrics Welcome Back! Login to your account below Remember Me Forgotten Password? Sign Up Create New Account! Fill the forms below to register All fields are required. Log In Retrieve your password Please enter your username or email address to reset your password. Log In No Result View All Result HomeExclusivesFinancial AnalysisCorporate StoriesInterviewsInvestigationsMetricsMarketsCurrenciesCryptosCommoditiesEquitiesCompany ResultsDividendsStock MarketFixed IncomeMarket ViewsSecuritiesSectorsCompany NewsConsumer GoodsCorporate UpdatesCorporate dealsCorporate Press ReleasesEnergyEntertainmentFinancial ServicesHealthHospitality & TravelManufacturingReal Estate and ConstructionTech NewsEconomyNairalyticsMacrosResearch AnalysisBudgetPublic DebtBusiness NewsFinancial LiteracyCareer tipsPersonal FinanceLifestyleBillionaire WatchProfilesOpinionsBlurbOp-Eds Login Sign Up (c) 2024 Nairametrics Advertisement"