{
    "title": "Foreign policy to emphasize Taiwan’s key role in global supply chains ",
    "source": " Taiwan News",
    "Content": "Foreign policy to emphasize Taiwan's key role in global supply chains | Taiwan News | Jul. 16, 2024 15:18 Home/Politics/Foreign Affairs Foreign policy to emphasize Taiwan's key role in global supply chains Cabinet to launch economic diplomacy taskforce Jul. 16, 2024 15:18 Ministry of Foreign Affairs Spokesperson Jeff Liu speaks with the media Tuesday. (CNA photo) Matthew Strong Taiwan News, Staff Writer 1318 1318 TAIPEI (Taiwan News) - The Ministry of Foreign Affairs (MOFA) said Tuesday (July 16) it would focus on maintaining Taiwan's crucial role in global supply chains once a new taskforce is formed.The Cabinet is planning to launch an economic diplomacy taskforce, with Foreign Minister Lin Chia-lung (林佳龍) as its head of strategic planning, Radio Taiwan International reported. MOFA said it would emphasize the use of inter-ministerial resources and cooperation across government departments to safeguard Taiwan's role.International cooperation is also to be expanded as part of the core strategy developed by Lin, MOFA said. The minister recently presented a plan to develop diplomacy based on values and economic diplomacy.One of the projects involves the setting up of industrial zones overseas, but MOFA said Tuesday the Ministry of Economic Affairs (MOEA) would be in charge of the plan. # economic diplomacy# Lin Chia-lung# supply chains# MOFA Related Articles Taiwan to host congressional delegation from GuatemalaJul. 14, 2024 20:08 Taiwan welcomes Thai visa waiverJul. 14, 2024 11:52 Taiwan president prepares first overseas trip since inaugurationJul. 10, 2024 19:53 Taiwan trains agricultural experts from 8 African countriesJul. 9, 2024 19:55 Taiwan to boost ownership rate of diplomatic missionsJul. 8, 2024 11:56 Taiwan warns travelers against taking gold, jewelry to JapanJul. 4, 2024 18:01 MOST READ Chinese coast guard ships approach Taiwan's outlying island of Kinmen Typhoon Gaemi may reach Taiwan Wednesday Tropical Storm Gaemi to impact Taiwan mid-week Japan warns China could land troops in Taiwan within a week Video captures Tainan factory explosion Typhoon forecast includes warnings for Taiwan fruit farmers Century-long data shows Taipei warmer than southern Taiwan Global Microsoft outage affects flights at Taiwan Taoyuan International Airport Taiwan mulls new rules to attract digital nomads and foreign professionals Taiwan forecasters see possibility of typhoon next week About UsDirectory of Taiwan About UsDirectory of TaiwanTaiwan News (c) 2024 All Rights Reserved."
}