{
    "title": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost ",
    "source": " NNPC Ltd",
    "Content": "NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost Who we are Investors Sustainability Our Businesses Insights contact us JULY 2, 2024 NNPC Ltd Declares State of Emergency on Crude Oil Production ...Calls for Collaboration to Reduce Production Cost PRESS RELEASE In a move towards increasing Nigeria's crude oil production and growing its reserves, NNPC Ltd has declared a state of emergency on production in Nigeria's oil and gas industry.Group Chief Executive Officer of NNPC Ltd, Mr. Mele Kyari, disclosed this in a keynote address at the opening ceremony of the 23rd edition of the Nigeria Oil & Gas Conference and Exhibition (NOG Energy Week) in Abuja, on Tuesday. \"We have decided to stop the debate. We have declared war on the challenges affecting our crude oil production. War means war. We have the right tools. We know what to fight. We know what we have to do at the level of assets. We have engaged our partners, and we will work together to improve the situation,\" the GCEO declared.According to him, a detailed analysis of assets revealed that Nigeria can conveniently produce two million barrels of crude oil per day without deploying new rigs, but the major impediment to achieving that remains the inability of players to act in a timely manner.He said the \"war\" will help NNPC Ltd. and its partners to speedily clear all identified obstacles to effective and efficient production such as delays in procurement processes, which have become a challenge in the industry.On medium to long-term measures aimed at boosting and sustaining production, Kyari said NNPC Ltd. would replace all the old crude oil pipelines built over four decades ago and also introduce a rig sharing programme with its partners to ensure that production rigs stay in the country for between four and five years which is the standard practice in most climes.He called on all players in the industry to collaborate towards reducing the cost of production and boosting production to target levels.He expressed the Company's commitment to investing in critical midstream gas infrastructure such as the Obiafu-Obrikom-Oben (OB3) and the Ajaokuta-Kaduna-Kano gas pipelines to boost domestic gas production and supply for power generation, industrial development and economic prosperity of the country.On Compressed Natural Gas (CNG), Kyari observed that NNPC Ltd. has since keyed into the Presidential CNG drive, adding that in conjunction with partners such as NIPCO Gas, NNPC Ltd. has built a number of CNG stations, 12 of which will be commissioned on Thursday in Lagos and Abuja.The opening ceremony of the NOG Energy Week also saw goodwill messages and keynotes presented by the Secretary General of the Organisation of the Petroleum Exporting Countries (OPEC), Haitham Al Ghais; Secretary General of the Gas Exporting Countries Forum (GECF), Engr. Mohamed Hamel; Minister of State for Petroleum Resources (Oil), Senator Heineken Lokpobiri; Minister of State for Petroleum Resources (Gas), Rt. Hon. Ekperikpe Ekpo; Special Adviser to the President on Energy, Ms. Olu Verheijen as well as the Chairman, Independent Petroleum Producers Group (IPPG), Mr. Abdulrazaq Isa. NNPC Ltd. is the Principal Sponsor of 2024 NOG Energy Week Conference & Exhibition which has as its theme \"showcasing opportunities, driving investment and meeting energy demand.\" Olufemi O. Soneye Chief Corporate Communications OfficerNNPC Ltd.Abuja. July 2 nd , 2024 GCEO, NNPC Ltd, Mallam Mele Kyari, delivers a Keynote Address at the second day of the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja.GCEO, NNPC Ltd, Mallam Mele Kyari (standing 7 th from left) in a group photograph with participants at the on-going Nigeria Oil & Gas (NOG) 2024 Energy Week Conference & Exhibition in Abuja. Other Posts News JULY 4, 2024 Nigeria's CNG Journey Has Commenced and is Irreversible, Says Kyari ...As NNPC Plans to Build Three L... News JULY 8, 2024 Logistics Challenges, Flooding Cause of Fuel Queues ...As NNPC, Stakeholders Vow To Restore Normalcy News JULY 5, 2024 NNPC/SPDC JV Committed to Impacting Lives Through Sustainable Development Projects ...Donates Ultra-M... Energy for Today, Energy for Tomorrow (c) 2024 NNPC Limited. Never miss out on what we're up to Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. NNPC Who we are Investors Contact Terms Of Use Privacy Policy Documents Careers SERVICES Upstream Downstream Gas & Power Non-Energy New Energy SOCIAL MEDIA X Facebook Instagram Linkedin Youtube Threads (c) 2024 NNPC Limited."
}