"Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Forex, Crypto CFDs, Commodities and Stocks - 10+ Trading Platforms - 1000+ Instruments Open an Account Here Support How can we help? Choose how you'd prefer to receive support. Live Chat Live Chat Terms By using our LiveChat, you agree that any personal data provided via LiveChat will be processed by us, as per our Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat WhatsApp How to Access Scan the QR code below to start speaking with us from your smartphone or open Whatsapp on your desktop. WhatsApp Chat Terms By using the WhatsApp chat feature, you agree that any personal data provided to XM Global Limited by you through WhatsApp will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Line How to Access Scan the QR code below with your smartphone Line Chat Terms By using the Line chat feature, you agree that any personal data provided to XM Global Limited by you through Line will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Viber How to Access Scan the QR code below with your smartphone Viber Chat Terms By using the Viber chat feature, you agree that any personal data provided to XM Global Limited by you through Viber will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Telegram How to Access Scan the QR code below with your smartphone Telegram Chat Terms By using the Telegram chat feature, you agree that any personal data provided to XM Global Limited by you through Telegram will be processed, as per our Privacy Policy and as per the app's Privacy Policy, for the purpose of receiving assistance from our Customer Experience team. Start chat Help Center Reuters Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores Jul 3, 2024 at 8:19 am GMT <html xmlns=\"http://www.w3.org/1999/xhtml\"><head><title>BRIEF-Spain May Crude Oil Imports Rise 23.5% Y/Y To 5.9 Mln Tonnes - Cores</title></head><body>July 3 (Reuters) -Cores: SPAIN MAY CRUDE OIL IMPORTS RISE 23.5% Y/Y TO 5.9 MILLION TONNES Source text: https://tinyurl.com/mvc2mjwb (Gdansk Newsroom)</body></html> Latest News View All Reuters - 26 minutes ago Richemont says quarterly sales up 1% at constant exchange rates B R S Reuters - 28 minutes ago French and Benelux stocks-Factors to watch E L S S F N U Reuters - 32 minutes ago Kazakhstan expects to tranship more Turkmen, Uzbek gas to China in 2024 Reuters - 39 minutes ago Dollar wobbles as comments of Fed's Powell put focus on Sept rate cut A E E G N U B Reuters - 45 minutes ago Nokia Oyj <NOKIA.HE> expected to post earnings of 6 cents a share - Earnings Preview N Disclaimer: The XM Group entities provide execution-only service and access to our Online Trading Facility, permitting a person to view and/or use the content available on or via the website, is not intended to change or expand on this, nor does it change or expand on this. Such access and use are always subject to: (i) Terms and Conditions; (ii) Risk Warnings; and (iii) Full Disclaimer. Such content is therefore provided as no more than general information. Particularly, please be aware that the contents of our Online Trading Facility are neither a solicitation, nor an offer to enter any transactions on the financial markets. Trading on any financial market involves a significant level of risk to your capital.All material published on our Online Trading Facility is intended for educational/informational purposes only, and does not contain - nor should it be considered as containing - financial, investment tax or trading advice and recommendations; or a record of our trading prices; or an offer of, or solicitation for, a transaction in any financial instruments; or unsolicited financial promotions to you.Any third-party content, as well as content prepared by XM, such as: opinions, news, research, analyses, prices and other information or links to third-party sites contained on this website are provided on an \"as-is\" basis, as general market commentary, and do not constitute investment advice. To the extent that any content is construed as investment research, you must note and accept that the content was not intended to and has not been prepared in accordance with legal requirements designed to promote the independence of investment research and as such, it would be considered as marketing communication under the relevant laws and regulations. Please ensure that you have read and understood our Notification on Non-Independent Investment. Research and Risk Warning concerning the foregoing information, which can be accessed here. We respect your privacy We use cookies to ensure the best possible browsing experience. Some are needed for essential features like login sessions, while others help us provide you with content and marketing more closely tailored to your needs. Accepting all cookies enables us to enhance your experience further. Please note, some of these may be third-party cookies. You can modify your cookie preferences by clicking the button below. For more information, please see our Cookie Policy. MODIFY PREFERENCES ACCEPT ALL Your cookie settings What are Cookies? Why are cookies useful? Change Settings What are Cookies? Cookies are small data files. When you visit a website, the website sends the cookie to your computer. Your computer stores it in a file located inside your web browser. Cookies do not transfer viruses or malware to your computer. Because the data in a cookie does not change when it travels back and forth, it has no way to affect how your computer runs, but they act more like logs (i.e. they record user activity and remember stateful information) and they get updated every time you visit a website. We may obtain information about you by accessing cookies, sent by our website. Different types of cookies keep track of different activities. For example, session cookies are used only when a person is actively navigating a website. Once you leave the website, the session cookie disappears. ENABLE ALL COOKIES AND CLOSE Why are cookies useful? We use functional cookies to analyse how visitors use our website, as well as track and improve our website's performance and function. This allows us to provide a high-quality customer experience by quickly identifying and fixing any issues that may arise. For example, we might use cookies to keep track of which website pages are most popular and which method of linking between website pages is most effective. The latter also helps us to track if you were referred to us by another website and improve our future advertising campaigns. Another use of cookies is to store your log in sessions, meaning that when you log in to the Members Area to deposit funds, a \"session cookie\" is set so that the website remembers that you have already logged in. If the website did not set this cookie, you will be asked for your login and password on each new page as you progress through the funding process. In addition, functional cookies, for example, are used to allow us to remember your preferences and identify you as a user, ensure your information is secure and operate more reliably and efficiently. For example, cookies save you the trouble of typing in your username every time you access our trading platform, and recall your preferences, such as which language you wish to see when you log in. Here is an overview of some of the functions our cookies provide us with: Verifying your identity and detecting the country you are currently visiting from Checking browser type and device Tracking which site the user was referred from Allowing third parties to customize content accordingly This website uses Google Analytics, a web analytics service provided by Google, Inc. (\"Google\"). Google Analytics uses analytical cookies placed on your computer, to help the website analyze a user's use of the website. The information generated by the cookie about your use of the website (including your IP address) may be transmitted to and stored by Google on their servers. Google may use this information to evaluate your use of the website, to compile reports on website activity and to provide other services related to website activity and internet usage. Google may also transfer this information to third parties, where required to do so by law, or where such third parties process the information on behalf of Google. Google will not associate your IP address with any other data held. By using this website, you give your consent to Google to process data about you in the manner and for the purposes set out above. ENABLE ALL COOKIES AND CLOSE Change Settings Please select which types of cookies you want to be stored on your device. Functional cookies These cookies are essential for the running of our website. Without these cookies our websites would not function properly. These are saved temporarily as login information and expire once the browser is closed. Analytical cookies The information provided by analytical cookies allows us to analyse patterns of visitor behaviour and we use that information to enhance the overall experience or identify areas of the website which may require maintenance. The information is anonymous (i.e. it cannot be used to identify you and does not contain personal information such as your name and email address) and it is only used for statistical purposes. Behavioral cookies are similar to analytical and remember that you have visited a website and use that information to provide you with content which is tailored to your interests. Promotional cookies These cookies are used to track visitors across websites. The intention is to display ads that are relevant and engaging for the individual user and thereby more valuable for publishers and third party advertisers. Preferences cookies Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. ENABLE ALL COOKIES AND CLOSE SAVE SETTINGS AND CLOSE We are using cookies to give you the best experience on our website. Read more or change your cookie settings. ACCEPT ALL COOKIES Risk Warning: Your capital is at risk. Leveraged products may not be suitable for everyone. Please consider our Risk Disclosure. XM Live Chat Please enter your contact information. If you already have an XM account, please state your account ID so that our support team can provide you with the best service possible. Existing Client New Client * First Name * Last Name * E-mail * Language Start chat * First Name * Last Name * E-mail * Language Start chat"