{
    "title": "Bedford gas leak after drilling company hits natural gas pocket ",
    "source": " BBC.com",
    "Content": "Bedford gas leak after drilling company hits natural gas pocket Skip to content HomeNewsIsrael-Gaza WarWar in UkraineUS & CanadaUKUK PoliticsEnglandN. IrelandN. Ireland PoliticsScotlandScotland PoliticsWalesWales PoliticsAfricaAsiaChinaIndiaAustraliaEuropeLatin AmericaMiddle EastIn PicturesBBC VerifySportBusinessExecutive LoungeTechnology of BusinessWomen at the HelmFuture of BusinessInnovationTechnologyScience & HealthArtificial IntelligenceAI v the MindCultureFilm & TVMusicArt & DesignStyleBooksEntertainment NewsTravelDestinationsAfricaAntarcticaAsiaAustralia and PacificCaribbean & BermudaCentral AmericaEuropeMiddle EastNorth AmericaSouth AmericaWorld's TableCulture & ExperiencesAdventuresThe SpeciaListEarthNatural WondersWeather & ScienceClimate SolutionsSustainable BusinessGreen LivingVideoLiveLive NewsLive Sport Home News Sport Business Innovation Culture Travel Earth Video Live Audio Weather Newsletters Gas leak: Roads could be closed for two days 3 July 2024 Share Google Road closures are in place at Cleat Hill, Kimbolton Road, Glenrose Avenue and Wagstaffe Close A drilling company caused a gas leak in a residential area after hitting a pocket of natural gas.Bedfordshire Fire and Rescue have been at the scene in Cleat Hill, Bedford, since 15:00 BST on Tuesday and warned nearby road closures could remain in place until Thursday.Nicholls Boreholes and Ground Source said they had been drilling a borehole for a heat pump when they \"encountered a pocket of naturally occurring gas at approximately 100 meters below ground level\". It added: \"The borehole has been temporarily capped to control the flow of gas whilst we work with the emergency services to permanently close the borehole. Bedfordshire Police put a cordon in place and assisted with road closures. Follow Beds, Herts and Bucks news on Facebook , Instagram and X . Got a story? Email eastofenglandnews@bbc.co.uk or WhatsApp us on 0800 169 1830 More on this story Homes evacuated after builder dug into gas pipe Homes evacuated and roads closed due to gas leak Homes evacuated over gas leak fire Related internet links Bedfordshire Fire and Rescue Service Bedfordshire Police Bedford Bedfordshire and Luton Fire and Rescue Service"
}