"Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says Russian pipeline gas exports to EU up 24% y/y in Jan-June, gas group says MOSCOW, July 16 (Reuters) - Russian natural gas exports via pipelines to the European Union countries have jumped by 24% in the first half of the year from the same period in 2023, according to a July report published by the Gas Exporting Countries Forum (GECF). It did not provide the volumes. Russia is a part of the GECF, sometimes dubbed the \"gas OPEC\", which accounts for more than two thirds of global natural gas reserves. Advertisement: The National Gas Company of Trinidad and Tobago Limited (NGC) NGC's HSSE strategy is reflective and supportive of the organisational vision to become a leader in the global energy business. ngc.co.tt GECF said pipeline gas imports by the EU from Russia and Azerbaijan have been higher in each month of 2024, compared with the corresponding months in 2023. Russian pipeline gas exports plummeted to Europe to a post-Soviet lows last year after Moscow's relations with the West reached its rock bottom since the 1962 Cuban Missile Crisis over the conflict in Ukraine. Russia supplied a total of about 63.8 billion cubic metres (bcm) of gas to Europe by various pipelines in 2022, according to Reuters calculations. The volume decreased further, by 55.6%, to 28.3 bcm last year. At their peak in 2018-19, annual flows to the region reached between 175 bcm and 180 bcm. According to Reuters calculations, Russian energy giant Gazprom's GAZP.MM average daily natural gas supplies to Europe jumped by almost 23% in June from a year earlier to 81.8 million cubic metres, rebounding from last year's post-Soviet lows, although they fell 8.6% from May. Russian pipeline gas supplies have been closely watched in recent months as Moscow's five-year gas transit deal with Ukraine expires after Dec. 31. While Russia has signalled it was willing to continue with the transit, Ukraine has said it would not renew the agreement with Moscow. (Reporting by Vladimir Soldatkin; Editing by Arun Koyyur) Related Articles Jul 22, 2024 1:45:pm EUROPE GAS-Prices inch down on comfortable stocks, Freeport LNG Jul 22, 2024 4:05:am Azerbaijan upbeat on Russian gas transit to EU via Ukraine Jul 19, 2024 12:30:pm Azerbaijan says will raise gas exports to Europe to 13 bcm in 2024 BDOW!"