{
    "title": "Oil Price Update – Oil Prices Hold Firm as Chinese Demand Concerns Rise ",
    "source": " MarketPulse",
    "Content": "Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulseMarketPulse Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise - MarketPulse Home/Commodities/Fundamental/News events/Oil/Technical analysis/TradingView/USD Oil Price Update - Oil Prices Hold Firm as Chinese Demand Concerns Rise July 15, 2024 Share Print 0 Oil prices remain stable despite a turbulent weekend and a strong US dollar. Chinese economic data, including disappointing GDP growth and declining refinery output, raises concerns about oil demand. The focus shifts from supply concerns in the US to demand worries in China. Technical analysis suggests potential for a triple bottom pattern in oil prices, with key support and resistance levels identified. Most Read: The Week Ahead - ECB Spotlight as Fed Rate Speculations Drive Market Shifts Oil prices remained resilient this morning following a turbulent weekend. An attack on US Presidential hopeful Donald Trump has seen the US Dollar start the week on the front foot but Oil prices have held firm. Data out of China this morning stoked fears around demand once more, something which market participants had hoped was in the rearview mirror. The overall fundamental picture remains largely positive but demand concerns may hamper any further gains in the short-term. Chinese Data China's GDP data released this morning was disappointing as sluggish domestic demand bites. The data prompted several investment banks to lower their GDP forecasts. GDP growth slowed to 0.7% quarter-on-quarter (q/q) seasonally adjusted (SA) in Q2, down from 1.6% q/q in Q1 and below market expectations of 0.9%, impacted by slower retail sales growth. Domestic demand and consumer confidence remain weak, with the NBS also attributing the slowdown to extreme weather events and flooding. Although industrial output growth is cooling, it exceeded market expectations, highlighting the uneven nature of China's recovery. Strong exports are supporting manufacturing activity, with shipments rising 8.6% year-on-year (y/y) in June, up from 7.6% in May. The secondary industry, which includes manufacturing and construction, grew by 5.6% y/y in Q2, down from 6.0% in Q1, while the tertiary industry, or services, increased by 4.2%, down from 5.0%. Chinese GDP Q2 YoY Source: LSEG (click to enlarge) Chinese refinery output declined for the third consecutive month due to planned maintenance and weak fuel demand, leading independent plants to reduce production. Output for the first half of the year was down 0.4% compared to the same period last year, indicating a sluggish economic recovery and reduced processing profits for refineries. Crude oil imports for the month of June dropped 11% while H1 imports were down 2.3% YoY. According to the IEA the Chinese share of global oil demand growth is declining to 40% this year from last year's 70%. This decline in China has reignited worries about demand, a notable shift from the past two weeks where supply concerns were prevalent in the US. The Week Ahead Oil inventory data is very important as the US and Europe are currently in the middle of summer. This period is typically the peak driving season in the US, leading to high demand for petroleum and other oil-related products. Due to the busy summer season in the US, there is a good chance that weekly oil inventories will decrease more than expected. This could help keep oil prices strong and prevent any significant long-term price drops. Geopolitics also remains a concern and could once more play an important role in the absence of high impact US economic data. For all market-moving economic releases and events (GMT-Time), see the MarketPulse Economic Calendar. (click to enlarge) Technical Analysis Oil prices snapped a four week winning streak to close around 2.33% lower. The weekly timeframe has price testing the 100-day MA which could prove to be a stern area of resistance. The daily timeframe is even more interesting as it appears markets could be setting up a triple bottom pattern. Such a pattern would no doubt embolden bulls eyeing further appreciation in oil prices. A daily candle close below the 85.25 handle opens up a potential selloff in Brent crude with support levels at 83.50 and 82.50 coming into focus. Immediate resistance rests at 86.21 with a break above carrying oil toward 87.90 and potentially the 90.00 psychological level. Support 85.25 83.50 (200-day MA) 83.00 81.58 Resistance 86.21 87.90 90.00 (psychological level) Brent Crude Oil Daily Chart, July 15, 2024 Source: TradingView.com (click to enlarge) Follow Zain on Twitter/X for Additional Market News and Insights @zvawda Content is for general information purposes only. It is not investment advice or a solution to buy or sell securities. Opinions are the authors; not necessarily that of OANDA Business Information & Services, Inc. or any of its affiliates, subsidiaries, officers or directors. If you would like to reproduce or redistribute any of the content found on MarketPulse, an award winning forex, commodities and global indices analysis and news site service produced by OANDA Business Information & Services, Inc., please access the RSS feed or contact us at info@marketpulse.com. Visit https://www.marketpulse.com/ to find out more about the beat of the global markets. (c) 2023 OANDA Business Information & Services Inc. BioLatest Posts Zain Vawda Market Analyst at OANDA Zain is an experienced financial markets analyst and educator with a rich tapestry of experience in the world of retail forex, economics, and market analysis. Initially starting out in a sales and business development role, his passion for economics and technical analysis propelled him towards a career as an analyst. He has spent the last 3 years in an analyst role honing his skills across various financial domains, including technical analysis, economic data interpretation, price action strategies, and analyzing the geopolitical impacts on global markets. Currently, Zain is advancing in obtaining his Capital Markets & Security Analyst (CMSA) designation through the Corporate Finance Institute (CFI), where he has completed modules in fixed income fundamentals, portfolio management fundamentals, equity market fundamentals, introduction to capital markets, and derivative fundamentals. He is also a regular guest on radio and television programs in South Africa, providing insight into global markets and the economy. Additionally, he has contributed to the development of a financial markets course approved by BankSeta (Banking Sector Education and Training Authority) at NQF level 6 in South Africa. Latest posts by Zain Vawda (see all) USD/CAD Eyes Breakout as Oil Price Slide Continues, BoC Meeting Next - 22 July 2024 Safe Havens Gain Favor Amid Geopolitical Tensions and US Election Uncertainty, Gold Above $2400/oz, DXY Slips - 22 July 2024 Weekly Market Outlook: US PCE, GDP, and Earnings Expected to Drive Volatility - 19 July 2024 Baker Hughes Oil Rig Count, Brent Crude oil prices, Brent Crude Oil Technical Analysis, Brent Oil, China's economic data, Chinese demand, Crude oil imports, EIA crude oil inventory, GDP Growth, Geopolitics, Refinery output, WTI Technical Analysis Back to Top"
}