{
    "title": "2024 - Alberta | Oil company fined for exposing animals to toxins ",
    "source": " Actual News Magazine",
    "Content": "2024 - Alberta | Oil company fined for exposing animals to toxins İçeriğe atla Arama yap: Son dakika: UK government launches plan to reduce reliance on immigration for labour market Democratic Nomination Bid | Kamala Harris and Canada: What to Expect? When hockey takes Louis Leblanc and Pierre Dagenais to China Canada-US border | New rules for dogs abandoned (Edmonton) A major oilsands producer has been fined after hundreds of birds, wolves and coyotes were exposed to toxins in one of its tailings ponds. Published at 5:48 p.m. Bob Weber The Canadian Press The Alberta Energy Regulator has fined Canadian Natural Resources (CNRL) $278,000. \"CNRL's breach had a direct and seriously negative impact on wildlife,\" the regulator's report said. \"Live animals were killed and euthanized as a result of this breach. There could be no more serious impact on wildlife.\" The report says that in the spring of 2022, Canadian Natural workers discovered an island had emerged in one of its tailings ponds. While the company normally levels these islands to prevent animals from being attracted to them, it did not do so in this case. On May 21, 2022, workers discovered birds on the island. They counted 271 California gull nests and one Canada goose nest. The company notified the regulator on June 7, more than two weeks later. At that time, Canadian Natural said it had installed bird deterrents. \"These and subsequent mitigation measures were not effective in preventing animals from coming into contact with a hazardous substance,\" the regulator's report said. By mid-July, workers were noticing oil-soaked gull chicks. The situation continued until August 4, when the surviving chicks were able to fly away. Canadian Natural reported 411 dead birds in or near the tailings site during the entire incident. Coyotes and wolves may have also visited the island. \"The predators were able to cross the water and enter the island,\" the report said. \"CNRL acknowledged that the predators were walking in the water and killing the oiled birds.\" The regulator reduced the possible fine because the company eventually installed a fence to keep predators off the island and chicks out of the water. Canadian Natural spokeswoman Julie Woo said in an email that the company regrets the situation. \"We have applied the lessons learned to mitigate the risk of recidivism,\" she said. \"We are currently reviewing the enforcement decision. [du regulateur] and potential responses.\" M me Woo did not indicate whether the island was still there. The tailings ponds, which together cover more than 300 square kilometres, lie on a major bird migration route, and measures to keep birds away from toxic water bodies are a condition of licence for all oil sands producers. These measures are not always successful. In the most recent case, 32 waterfowl died in a Suncor pond in May 2023. The heaviest toll occurred in 2008, when 1,600 ducks died after landing in a Syncrude pond. source site-61"
}