{
    "title": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News ",
    "source": " Shafaq News",
    "Content": "OPEC crude oil production remains steady for third month due to Iraq, UAE non-compliance - Shafaq News Breaking News Trump to announce vice presidential pick soon Syrian businessman Mohammad Katerji killed in Israeli drone strike near Lebanon's border Human rights groups urge new Iranian president to halt lethal force against border porters Al-Hassan succeeds Plasschaert as UNAMI head in Iraq 2024-07-02T09:48:13+00:00 Share font Enable Reading Mode A- A A+ Shafaq News/ OPEC's crude oil production held steady for the third consecutive month as Iraq and the UAE failed to fully implement the agreed-upon cuts, according to a Bloomberg survey. The Organization of the Petroleum Exporting Countries produced an average of 26.98 million barrels per day in June, marking a decrease of 80,000 barrels per day from the previous month. This slight reduction was attributed to minor cuts in production from Iraq and Nigeria. The survey indicated that Iraq and the UAE did not fully comply with the cuts agreed upon at the beginning of the year with other OPEC members. Additionally, Baghdad was unable to implement the extra production cut it had pledged to compensate for previous overproduction levels. To push crude oil prices higher, the OPEC alliance may need to enforce the committed cuts fully. However, efforts to enhance compliance have shown limited results. In June, Iraq reduced its output by 30,000 barrels per day to 4.25 million barrels per day. This reduction in exports brought the country closer to its assigned quota, but its production still exceeded the quota by approximately 250,000 barrels per day, even without considering additional \"compensatory cuts.\" Related News Bloomberg: Iraq reduced its oil production by 130,000 bpd Iraq boosts oil output by 40,000 bpd in May following OPEC decision Basrah crudes surge following global oil rise Basrah crudes surge despite global oil decline Kirkuk oil production surges to over 360,000 bpd EIA reports surge in Iraqi oil exports to the US Shafaq Live Shafaq Live English English Radio facebook Shafaq news english"
}