"Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products ­ Twitter Facebook Linkedin Youtube Instagram Toggle navigation NEWS UKRAINEWAR ZONEWORLD ABOUT UKRAINEOCCUPIED CRIMEAVIDEO EUROMAIDAN UKRAINECRIMEA ANNEXATIONUKRAINE WARINTERVIEWOPINION INTERVIEWSANALYTICSINVESTIGATIONSDISCOVER UKRAINE ARTHISTORYTECHTRAVELMUSICMOVIECULTUREPOLITICSBUSINESSEVENTSPROJECTSABOUTPrivacy PolicyFUND USSelect LanguageУкраїнськаالعربية简体中文NederlandsEnglishFrançaisDeutschहिन्दीItalianoनेपालीPortuguêsРусскийEspañol Home OPINION INVESTIGATIONS Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products Top \"peacemakers\" in sea imports of Russian bloody crude oil and petroleum products July 14, 2024 10:26 am Top \"peacemakers\": Turkey - 2nd in sea imports of Russian bloody crude oil in May 2024 and absolute world champion in sea imports of Russian petroleum products.Andrii Klymenko investigates.In May 2024, Turkey imported - according to our own monitoring - 2.5 million tons of crude oil: from Russian ports of the Baltic Sea (2.1 million tons) and the Black Sea (0.4 million tons). This accounts for 17.3% of the total crude oil exports from the ports of these two seas. In total, 19 out of 100 tankers with crude oil from the Baltic and 4 out of 29 tankers from the Black Sea arrived in Turkey. To estimate this in monetary terms, you can do the following simple arithmetic: 2.4 million tons * 7.3 = 17.52 million barrels * $79.58 = $1.4 billion USD (per month).However, that is not all - unlike India, Turkey is the absolute champion in the sea import of Russian petroleum products (in addition to crude oil - diesel fuel, etc.). In May 2024, Turkey imported - according to our own monitoring - 2.3 million tons of petroleum products from Russian ports of the Baltic Sea (0.7 million tons) and the Black Sea (1.6 million tons). This represents 37.7% of the total export of petroleum products from Russian ports in these two seas.The number of tankers with Russian petroleum products received by Turkish ports in May 2024 might shock an unprepared reader: 83 from the Black Sea and 16 from the Baltic. Out of these 99 tankers, 35 were Russian.By the way, after the start of the Great War, Turkey doubled its average monthly import figures in 2022, and then even tripled or quadrupled them. And now not only oil market specialists are asking the rhetorical question: did the use of low-quality Russian diesel fuel triple in Turkey? Or is it something else?Let's add another topic that raises many questions. For a year now, since July 2023, Turkey has been pushing for the resumption of the \"Black Sea Grain Initiative\" (the same one - with the participation of the UN, Russia, and Turkey, from which Russia demonstratively withdrew), although an alternative has been successfully operating all this time - the Ukrainian sea export corridor (without the UN, without Russia, and without Turkey).Why the Turkish president needs this, no one can understand. It remains to be assumed that:a) the Turkish leader knows something about Russia's plans to attack ships heading to the ports of Greater Odesa via the Ukrainian corridor, orb) he is fulfilling the request of Emperor Pu, who certainly does not like that ships on their way to Ukrainian ports are no longer inspected.Yes, we appreciate that Turkey has closed its straits to Russian warships. And we haven't forgotten about the Bayraktars. But...As we noted a few days ago - ALL \"peacemaker\" countries - those that exist and those that will appear - simply have business with Putin's Russia. And they are not concerned about peace. They are concerned about their banks already feeling the strain - otherwise, soon they will have to somehow wind down their business with the aggressor country. Ukraine Front Lines Share this: FacebookTwitterPinterestLinkedInStumbleuponTumblrRedditDiggEmailPrint Tags: imports od russian crude oil oil embargo russia ukraine war sanctions sanctions against russia Like this: Like Loading... WE NEED YOUR HELP! 24/7, every day, since 2014 our team based in Kyiv is bringing crucial information to the world about Ukraine. Please support truly independent wartime Pulitzer Prize-winning journalism in #Ukraine.You are welcome to fund us: Donate Now Share this: 0 Comments Leave a reply Click here to cancel the reply Your email address will not be published. Required fields are marked *Comment Name *Email *Website Save my name, email, and website in this browser for the next time I comment. Related Articles The International Criminal Court is to investigate the case regarding the situation in Ukraine Hungary calls Ukraine's decision to halt transit of Russian oil by Lukoil \"unacceptable\" A business partner of the Head of the Office of the President of Ukraine, Yermak, borrows money from Russians to buy a house in America Regarding Kamala Harris's chances Ukraine struck Crimea with dozens of ATACMS. Putin lost two Su-30 jets and a hundred soldiers Russia - Ukraine war updates as of July 22, 2024 You can back Ukraine Front Lines to remain #1 Independent Citizen Media about Ukraine. Your investment saves the Truth and lives. LATEST NEWS Russia - Ukraine war updates as of July 22, 2024 Russia - Ukraine war updates as of July 21, 2024 Ukraine has stopped the transit of Russian oil to Hungary. Official Budapest, along with Moscow, still hopes for a \"legal resolution\" Russia - Ukraine war updates as of July 20, 2024 Defender of the Ukrainian language killed - western media on the shooting of Iryna Farion Missile strike on children's playground in Mykolaiv: number of injured rises to 15 civilians Some facts about Iryna Farion, who was killed near her home in Lviv TOP STORIES The ghost of Ukrainian nuclear weapons The West vs. Russia: the tactic of a thousand concessions Russian propaganda fakes about the Kyiv's Children Hospital Okhmatdyt attack The russian statement about the destruction of the Kyiv HPP and the Kaniv reservoir is not simply about blackmail News from the sidelines of the NATO summit in Washington A business partner of the Head of the Office of the President of Ukraine, Yermak, borrows money from Russians to buy a house in America Iryna Farion: During this terrible and wild war cynical beings in Ukrainian parliament are looting the last budget funds DISCOVER UKRAINE A documentary about the fighters of the legendary third separate assault brigade appears on Netflix Constitution of political romanticism Ukraine is developing a swarm of drones capable of attacking without human intervention About Ukraine Front Lines Ukraine Front Lines is the Independent Citizen Media, which disseminates truthful news on the latest updates from Ukraine. Learn More Ukraine Front Lines CONTACT USYou can send us an email and we'll get back to you, Ukraine Front Lines teamSend Sending Log in with your credentials Sign in Remember me Lost your password? Forgot your details? Reset Password I remember my details %d"