{
    "title": "Oil prices surge amid political uncertainty, geopolitical tensions ",
    "source": " MENAFN.COM",
    "Content": "Oil prices surge amid political uncertainty, geopolitical tensions We use cookies We use cookies and other tracking technologies to improve your browsing experience on our website, to show you personalized content and targeted ads, to analyze our website traffic, and to understand where our visitors are coming from. I agreeI declineChange my preferences US Europe Arab Asia Africa | Politics Economy Oil&Energy Entertainment Sport Oil prices surge amid political uncertainty, geopolitical tensions Date 7/16/2024 4:45:28 AM Share on Facebook Tweet on Twitter (MENAFN) Oil prices saw a modest increase on Monday as geopolitical uncertainty in the United States and the Middle East outweighed pressures from a stronger dollar and subdued demand in China. brent crude futures edged up by 15 cents, or 0.2 percent, to reach USD85.18 per barrel by 0425 GMT, following a slight decline of 37 cents on Friday. Similarly, U.S. West Texas Intermediate crude rose by 20 cents to USD82.41 per barrel, marking a 0.2 percent gain.The attempted assassination of U.S. presidential candidate Donald Trump earlier in the week contributed to market uncertainty, according to Tony Sycamore, a market analyst at IG. This event has cast a shadow over the political landscape of a deeply divided country as it approaches the election period, potentially influencing market sentiment.Geopolitical risks in the Middle East also played a role in supporting oil prices, highlighting ongoing concerns about regional stability. Furthermore, the market remains bolstered by the continuing supply cuts by OPEC+ members. Iraq's oil ministry has pledged to counter any excess oil production starting from 2024, indicating a commitment to manage global supply levels amidst market fluctuations.Despite these factors, oil prices had faced downward pressure last week. Brent crude had declined by more than 1.7 percent after four consecutive weeks of gains, while U.S. West Texas Intermediate futures dropped by 1.1 percent. This decline was attributed to weak demand for oil in China, the largest importer of crude globally, where crude oil imports fell by 2.3 percent in the first half of the year to 11.05 million barrels per day. Factors contributing to this decline included disappointing fuel demand and reduced output by independent refiners amid narrow profit margins.China's economic slowdown in the second quarter, exacerbated by challenges such as a prolonged property downturn and job market instability, has raised expectations for additional stimulus measures from Beijing to bolster domestic demand. These developments are closely monitored by market participants for potential implications on global oil consumption and economic recovery trends. MENAFN16072024000045015682ID1108443560 Legal Disclaimer: MENAFN provides the information \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the provider above. Tags Label Comments No comment Category Date 7/16/2024 Most popular stories New Nature Writing Genre Brings Wild And Tricky Aspects Of Climate Cri... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Jensen Huang And Mark Zuckerberg To Explore The Future Of AI And Virtu... 'We Failed': US Secret Service Admits 'Most Significant Mistake' Leadi... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... Market Research Infrastructure-As-A-Service (Iaas) Market Trends, Size, Share, Analysis, ... Unlocking Insights: Lithium Carbonate Analysis Report... Saudi Arabia Hybrid Cloud Market To Witness 21.91% CAGR Until 2032... Saudi Arabia Lingerie Market Share, Size, Growth, Trends, Analysis And Re... United States Hybrid Cloud Market Size To Expand At A CAGR Of 21.95% Duri... Australia Glamping Market Industry Size, Share, Growth, Leading Companies... United States Home Infusion Therapy Market Trends, Scope, Demand, Opportu... More Stories 'Sexist' falsehoods target Kamala Harris after Biden drops out... UN Chief Urges Reform Of Int'l Financial System... 1 Killed, 3 Injured In Israeli Airstrike In Lebanon... Kremlin Awaits 'Concrete Action' Following Zelensky's Proposal On Negotia... UNHCR To Reduce Workforce In Lebanon Amid Budget Constraints... 4.7-Magnitude Quake Jolts Turkey... South Africa Aims To Use BRICS Platform To Boost Trade: Official... Ananya Panday Buys Herself A Powerful New Luxury SUV... Rebounding chip shares lead US stocks higher... Big B Set To Host 'Kaun Banega Crorepati 16' From Aug 12... The coconut tree presidency? Harris memes break the internet... Times When Nikki Tamboli Showed Off Her SEXY Body That Took The Internet ... Newsletter Daily(English) Daily(Arabic) All() Search ******************** Home News News by Industry News by Region Americas Europe Arab World Asia Africa Press Releases Submit Your press Authors Register Submit your Articles RSS MarketData Equities Market Global Indices MENA Indices Qutoes & Charts End of Day stocks Currencies Currency Convertor Cross Rates Historical Currencies Libor Mena Stocks Stocks Search Commodoties Oil & Energy Economic Calendar Stocks Search Research Premium Research Free Research Countries Saudi Arabia UAE Bahrain Qatar Kuwait Jordan Oman Egypt Lebanon Iraq Palestine Syria Tunisia Algeria Morocco Yemen Sections Events Financial Glossary 🍪 We use cookies! Hi, this website uses essential cookies to ensure its proper operation and tracking cookies to understand how you interact with it. The latter will be set only after consent. Let me choose Accept allReject all Cookie usage 📢 I use cookies to ensure the basic functionalities of the website and to enhance your online experience. You can choose for each category to opt-in/out whenever you want. For more details relative to cookies and other sensitive data, please read the full privacy policy. Strictly necessary cookiesStrictly necessary cookies These cookies are essential for the proper functioning of my website. Without these cookies, the website would not work properly Performance and Analytics cookiesPerformance and Analytics cookies These cookies allow the website to remember the choices you have made in the past NameDomainExpirationDescription^_gagoogle.com2 yearsdescription ..._gidgoogle.com1 daydescription ... Advertisement and Targeting cookiesAdvertisement and Targeting cookies These cookies collect information about how you use the website, which pages you visited and which links you clicked on. All of the data is anonymized and cannot be used to identify you More information For any queries in relation to my policy on cookies and your choices, please contact us. Accept allReject allSave settings"
}